[{"tresc":"Fragment kodu SQL oznacza, że klucz obcy","odpowiedz":"łączy się z kolumną imiona."},{"tresc":"Wybierz poprawną definicję funkcji w języku JavaScript","odpowiedz":"function nazwa_funkcji(argumenty) {instrukcje;}"},{"tresc":"W języku HTML, aby nadać dokumentowi tytuł \"Moja strona\", który będzie wyświetlany na zakładce przeglądarki internetowej, należy posłużyć się zapisem","odpowiedz":"<title>Moja strona</title>"},{"tresc":"W serwerze MySQL nadanie roli o nazwie DBManager przyznaje użytkownikowi prawa umożliwiające","odpowiedz":"wszelkie operacje na bazach danych serwera"},{"tresc":"Modelem barw opisującym kolor z użyciem stożka przestrzeni barw jest","odpowiedz":"HSV"},{"tresc":"W wyniku działania pętli zapisanej w języku PHP zostanie wypisany ciąg liczb","odpowiedz":"10 15 20 25 30 35 40 45"},{"tresc":"Aby skorzystać ze skryptu zapisanego w pliku przyklad.js, należy połączyć go ze stroną za pomocą kodu","odpowiedz":"<script src=\"przyklad.js\"></script>"},{"tresc":"Jakie elementy wypisze funkcja wypisz(2) stworzona w języku JavaScript?","odpowiedz":"3 4 6"},{"tresc":"Fragment kodu prezentuje składnię języka","odpowiedz":"PHP"},{"tresc":"Który z obrazów został sformatowany za pomocą przedstawionego stylu CSS?","odpowiedz":"A"},{"tresc":"Metainformacja \"Description\" zawarta w pliku źródłowym HTML powinna zawierać","odpowiedz":"opis, co znajduje się na stronie"},{"tresc":" Zamieszczony w ramce fragment kodu w JavaScript wypisze","odpowiedz":"\"ze\""},{"tresc":" W programie do obróbki grafiki rastrowej zmodyfikowano krzywe kolorów tak, jak zaznaczono ramką na przedstawionym obrazie. Ma to na celu","odpowiedz":"modyfikację najjaśniejszych i najciemniejszych kolorów obrazu."},{"tresc":" W języku HTML aby zdefiniować poziomą linię, należy użyć znacznika","odpowiedz":"<hr>"},{"tresc":" Wskaż prawidłową kolejność stylów CSS mając na uwadze ich pierwszeństwo w formatowaniu elementów strony WWW.","odpowiedz":"Lokalny, Wewnętrzny, Zewnętrzny"},{"tresc":" W formularzu HTML zastosowano znacznik <input>. Wyświetlone pole będzie służyło do wprowadzania maksymalnie","odpowiedz":"20 znaków, które nie są widoczne w polu tekstowym"},{"tresc":" Model barw oparty na 3 parametrach: odcień, nasycenie i jasność to","odpowiedz":"HSV"},{"tresc":" Za pomocą którego zapisu zostanie utworzony w dokumencie HTML element wyświetlający obraz kotek.jpg z tekstem alternatywnym \"obrazek kotka\"?","odpowiedz":"<img src=\"kotek.jpg\" alt=\"obrazek kotka\">"},{"tresc":" Relacja w bazach danych jest","odpowiedz":"logicznym połączeniem tabel"},{"tresc":" W języku PHP, wykonując operacje na bazie danych MySQL, aby zakończyć pracę z bazą, należy wywołać","odpowiedz":"mysqli_close();"},{"tresc":" Tablica tab[] jest wypełniona dowolnymi liczbami całkowitymi. Jaka wartość znajdzie się w zmiennej zm2 po wykonaniu prezentowanego fragmentu kodu?","odpowiedz":"Średnia arytmetyczna liczb z tablicy"},{"tresc":" Podana definicja stylu CSS sprawi, że nagłówki pierwszego stopnia będą","odpowiedz":"wyśrodkowane, pisane wielkimi literami, a odstępy między literami będą ustawione na 10 px"},{"tresc":" Jaki rezultat zostanie wyświetlony po wykonaniu przedstawionego kodu HTML?","odpowiedz":"D"},{"tresc":" W języku JavaScript stworzono funkcję o nazwie liczba_max porównującą trzy liczby naturalne pobrane z parametrów funkcji i zwracającą maksymalną z nich. Prawidłowe wywołanie takiej funkcji wraz z pobraniem jej wyniku będzie miało postać","odpowiedz":"var wynik=liczba_max(a,b,c);"},{"tresc":" Walidacja pól formularza polega na sprawdzeniu","odpowiedz":"czy wprowadzone dane spełniają określone reguły."},{"tresc":" Wynikiem wykonania przedstawionego kodu PHP jest wypisanie wartości","odpowiedz":"147"},{"tresc":" Jaką wartość zwróci funkcja zao zdefiniowana w języku C++, wywołana z aktualnym parametrem 3.55","odpowiedz":"4"},{"tresc":" Które polecenie wydane z konsoli systemowej dokona przywrócenia bazy danych?","odpowiedz":"mysql -u root -p baza < kopia.sql"},{"tresc":" Funkcją agregującą zwracającą liczbę rekordów jest","odpowiedz":"COUNT"},{"tresc":" Specjalna metoda danej klasy stosowana w programowaniu obiektowym, wywoływana automatycznie podczas tworzenia obiektu, której podstawowym zadaniem jest zwykle zainicjowanie pól, to","odpowiedz":"konstruktor"},{"tresc":" Jak nazywa się program, który wykonuje instrukcje zawarte w kodzie źródłowym tworzonego programu bez uprzedniego generowania programu wynikowego?","odpowiedz":"Interpreter"},{"tresc":" W języku HTML zdefiniowano odnośnik do strony internetowej. Aby strona otwierała się w nowym oknie lub zakładce przeglądarki, należy dopisać do definicji odnośnika atrybut","odpowiedz":"target = \"_blank\""},{"tresc":" Zamieszczony w ramce kod wyświetla tabelę składajacą się z","odpowiedz":"jednego wiersza i dwóch kolumn"},{"tresc":" W języku HTML zapis &lt; spowoduje wyświetlenie w przeglądarce znaku","odpowiedz":"<"},{"tresc":" Deklaracja typu dokumentu HTML: <!DOCTYPE HTML> oznacza, że kod jest napisany w wersji","odpowiedz":"5"},{"tresc":" W języku PHP zapisano fragment kodu. Po zakończeniu pętli zmienna a przyjmie wartość","odpowiedz":"20"},{"tresc":" W języku PHP wykonano operację przedstawioną w ramce. Aby wyświetlić wszystkie wyniki tego zapytania należy","odpowiedz":"zastosować pętlę z poleceniem mysqli_fetch_row"},{"tresc":" Dana jest tabela uczniowie, do której wpisano rekordy jak na rysunku. Co będzie wynikiem działania przedstawionego zapytania SQL?","odpowiedz":"Wartość 3.5"},{"tresc":" W języku CSS określono formatowanie znacznika h1 według wzoru. Zakładając, że żadne inne formatowanie nie jest dodane do znacznika h1, wskaż sposób formatowania tego znacznika","odpowiedz":"C"},{"tresc":" Stronę internetową zapisano w języku XHTML. Który z kodów stanowi implementację przedstawionego fragmentu strony, jeżeli żadne style CSS nie zostały zdefiniowane?","odpowiedz":"B"},{"tresc":" Barwa zapisana w modelu RGB(255, 0, 0) jest","odpowiedz":"czerwona"},{"tresc":" W języku CSS wartości underline, overline, blink przyjmują atrybut","odpowiedz":"text-decoration"},{"tresc":"Funkcja agregująca MIN języka SQL ma za zadanie policzyć","odpowiedz":"Wartość minimalną kolumny zwróconej kwerendą"},{"tresc":"Ikona, która wyświetlona jest przed adresem, w polu adresowym przeglądarki internetowej lub przy tytule otwartej karty przeglądarki nosi nazwę","odpowiedz":"favicon"},{"tresc":"W bazie danych hurtowni zdefiniowano tabelę sprzedaz o polach: id, kontrahent, grupa_cenowa, obrot. Aby wyszukać wyłącznie kontrahentów z drugiej grupy cenowej, których obrót jest większy niż 4000zł, należy zastosować polecenie","odpowiedz":"SELECT kontrahent FROM sprzedaz WHERE grupa_cenowa = 2 AND obrot > 4000;"},{"tresc":"Która ze zdefiniowanych funkcji w języku PHP jako wynik zwraca połowę kwadratu wartości przekazanej?","odpowiedz":"function licz($a) { return $a*$a/2; }"},{"tresc":"Co należy zastosować w organizacji danych, aby zapytania w bazie danych były wykonywane szybciej?","odpowiedz":"Indeksy"},{"tresc":"W języku JavaScript stworzono funkcję o nazwie liczba_max porównującą trzy liczby naturalne pobrane z parametrów funkcji i zwracającą maksymalną z nich. Prawidłowe wywołanie takiej funkcji wraz z pobraniem jej wyniku będzie miało postać","odpowiedz":"var wynik=liczba_max(a,b,c);"},{"tresc":"Kodowanie w standardzie ISO-8859-2 stosowane jest w celu poprawnego wyświetlenia","odpowiedz":"polskich liter, takich jak: ś, ć, ń, ó, ą"},{"tresc":"Zmienna typu integer lub int może przechowywać","odpowiedz":"liczbę całkowitą."},{"tresc":"Uprawnienia obiektowe, nadawane użytkownikom serwera bazy danych, mogą pozwalać lub zabraniać","odpowiedz":"wykonywać operacje na bazie, takie jak wstawanie lub modyfikowanie danych"},{"tresc":" Polecenie w języku SQL ALTER TABLE USA... ma za zadanie","odpowiedz":"modyfikację tabeli USA"},{"tresc":" Który opis odnosi się do metody POST wysyłania formularza?","odpowiedz":"Jest wskazana, gdy przesyłane są informacje poufne, np. hasło, numer telefonu czy numer karty kredytowej"},{"tresc":" Właściwym zestawem kroków według kolejności, które należy wykonać w celu nawiązania współpracy między aplikacją internetową po stronie serwera a bazą SQL, jest","odpowiedz":"nawiązanie połączenia z serwerem baz danych, wybór bazy, zapytanie do bazy - wyświetlane na stronie WWW, zamknięcie połączenia"},{"tresc":" Jakie elementy wypisze funkcja wypisz(2) stworzona w języku JavaScript?","odpowiedz":"3 4 6"},{"tresc":" Prawidłowy, zgodny ze standardem języka XHTML, zapis samozamykającego się znacznika odpowiadającego za łamanie linii ma postać","odpowiedz":"<br />"},{"tresc":" Integralność encji w bazie danych zostanie zachowana, jeżeli między innymi","odpowiedz":"dla każdej tabeli zostanie utworzony klucz główny."},{"tresc":" Aby poprawnie zdefiniować hierarchiczną strukturę tekstu witryny internetowej, należy zastosować","odpowiedz":"znaczniki <h1>, <h2> oraz <p>"},{"tresc":" Którą integralność opisuje cytowana definicja?","odpowiedz":"Referencyjną."},{"tresc":" W języku MySQL należy zastosować polecenie REVOKE, aby użytkownikowi anna odebrać prawo do dokonywania zmian jedynie w definicji struktury bazy danych. Polecenie odpowiadające odebraniu tych praw ma postać","odpowiedz":"REVOKE CREATE ALTER DROP ON tabela1 FROM 'anna'@'localhost'"},{"tresc":" Podane polecenie SQL nadaje prawo SELECT","odpowiedz":"do wszystkich tabel w bazie hurtownia"},{"tresc":" Wartości: static, relative, fixed, absolute oraz sticky można przypisać do właściwości","odpowiedz":"position"},{"tresc":" Znacznik <i> języka HTML służy do","odpowiedz":"zmiany kroju pisma na pochylony"},{"tresc":" Jaka treść komunikatu powinna być wstawiona w przedstawionym kodzie PHP zamiast znaków zapytania?","odpowiedz":"Błąd połączenia z serwerem SQL"},{"tresc":" W JavaScript wynik operacji jest równy wartości NaN, jeśli skrypt próbował wykonać","odpowiedz":"działanie arytmetyczne, a zawartość zmiennej była napisem"},{"tresc":" Kolorem o barwie niebieskiej jest kolor","odpowiedz":"#0000EE"},{"tresc":" Po wykonaniu przedstawionego kodu JavaScript wyświetli się wartość","odpowiedz":"13"},{"tresc":" Przedstawiony kod języka PHP","odpowiedz":"definiuje tablicę z trzema wartościami"},{"tresc":" W językach programowania zmienna typu integer służy do przechowywania","odpowiedz":"liczby całkowitej"},{"tresc":" W celu określenia wysokości obrazka wyświetlonego na stronie WWW należy wykorzystać właściwość CSS o nazwie","odpowiedz":"height"},{"tresc":" Selektor klasy w kaskadowych arkuszach stylów należy zdefiniować za pomocą symbolu","odpowiedz":". (kropka)"},{"tresc":" Metainformacja \"Description\" zawarta w pliku źródłowym HTML powinna zawierać","odpowiedz":"opis, co znajduje się na stronie"},{"tresc":" Którego protokołu należy użyć, aby przesłać pliki strony internetowej na serwer hostingowy?","odpowiedz":"FTP"},{"tresc":" Aby odebrać uprawnienia użytkownikowi, należy zastosować polecenie","odpowiedz":"REVOKE"},{"tresc":" Źródłem rekordów dla raportu może być","odpowiedz":"Tabela"},{"tresc":" W kodzie źródłowym zapisanym w języku HTML wskaż błąd walidacji dotyczący tego fragmentu","odpowiedz":"Znacznik zamykający /b niezgodny z zasadą zagnieżdżania"},{"tresc":" Zestaw komponentów i podprogramów służący pisaniu aplikacji, który ponadto narzuca szkielet wyglądu aplikacji, jej strukturę, a czasem nawet wzorzec według którego ma powstać aplikacja, to","odpowiedz":"framework."},{"tresc":" Zapisując hasło użytkownika serwisu WWW (np. bankowości internetowej), w celu jego zabezpieczenia przed odtajnieniem, zwykle używa się funkcji","odpowiedz":"klucza"},{"tresc":" W HTML, aby wstawić obrazek z tekstem przyległym, znajdującym się pośrodku obrazka, należy zapisać znacznik","odpowiedz":"<img src=\"obrazek.png\" alt=\"obraz2\" align=\"middle\"> tekst"},{"tresc":"Za pomocą języka PHP nie jest możliwe","odpowiedz":"Zmienianie dynamiczne zawartości strony HTML w przeglądarce"},{"tresc":"W języku CSS zdefiniowano formatowanie paragrafu, które przypisze mu następujące cechy:","odpowiedz":"tło czerwone, kolor tekstu niebieski, marginesy zewnętrzne ustawione na wartość 40px"},{"tresc":"Fizyczny model replikacji bazy danych przedstawiony na rysunku jest modelem","odpowiedz":"centralnego wydawcy"},{"tresc":"W grafice komputerowej pojęcie kanału alfa jest związane z","odpowiedz":"przezroczystością."},{"tresc":"W formularzu dokumentu PHP istnieje pole <input name=\"im\" />. Po wprowadzeniu przez użytkownika ciągu znaków \"Janek\", w celu dodania zawartości pola do bazy danych, w tablicy $_POST zawarty jest element","odpowiedz":"Janek o indeksie im"},{"tresc":"Aby przetestować poprawność działania kodu JavaScript należy użyć","odpowiedz":"konsoli w przeglądarce internetowej."},{"tresc":"Wskaż komentarz wieloliniowy w języku PHP","odpowiedz":"/* */"},{"tresc":"Aby aplikacja PHP mogła komunikować się z bazą danych, niezbędne jest w pierwszej kolejności wywołanie funkcji o nazwie","odpowiedz":"mysqli_connect"},{"tresc":"W języku HTML zdefiniowano znacznik a. Wartość nofollow atrybutu rel","odpowiedz":"jest informacją dla robota wyszukiwarki Google, aby nie podążał za tym linkiem"},{"tresc":" W znaczniku <head> (w części <meta ... >) strony www NIE umieszcza się informacji dotyczącej","odpowiedz":"typu dokumentu"},{"tresc":" Witryna internetowa wysyła dane poufne za pomocą formularza do kodu PHP. Która metoda wysłania jest najbardziej bezpieczna?","odpowiedz":"Metoda POST, za pomocą protokołu HTTPS"},{"tresc":" W przedstawionym fragmencie kwerendy języka SQL, komenda SELECT ma za zadanie zwrócić","odpowiedz":"liczbę wierszy"},{"tresc":" W języku JavaScript metoda getElementById() odwołuje się do","odpowiedz":"znacznika HTML o podanym id"},{"tresc":" Którą relację w projekcie bazy danych należy ustalić między tabelami widocznymi na rysunku zakładając, że każdy klient sklepu internetowego dokona przynajmniej dwóch zamówień?","odpowiedz":"1:n, gdzie 1 jest po stronie Klienta, a wiele po stronie Zamówienia"},{"tresc":" W formularzu, dane z pola input o typie number zostały zapisane do zmiennej a, a następnie przetworzone w skrypcie JavaScript w następujący sposób. Zmienna x będzie typu","odpowiedz":"liczbowego, całkowitego"},{"tresc":" Przedstawiona w języku CSS definicja stylu dotyczy odsyłacza, który","odpowiedz":"został wcześniej odwiedzony"},{"tresc":" Znacznik <s> w języku HTML powoduje","odpowiedz":"przekreślenie tekstu"},{"tresc":" Kompresja bezstratna pliku graficznego gwarantuje","odpowiedz":"pierwotną jakość grafiki."},{"tresc":" W języku CSS, aby zdefiniować niestandardowe odstępy między wyrazami, stosuje się właściwość","odpowiedz":"word-spacing"},{"tresc":" Wysokość dźwięku zależy od","odpowiedz":"częstotliwości drgania fali akustycznej"},{"tresc":" W języku JavaScript, aby sprawdzić warunek czy liczba znajduje się w przedziale (100;200>, należy zapisać:","odpowiedz":"if (liczba > 100 && liczba <= 200)"},{"tresc":" W procesie walidacji stron internetowych nie bada się","odpowiedz":"źródła pochodzenia narzędzi edytorskich"},{"tresc":" Aby w pliku z rozszerzeniem php umieścić kod w języku PHP należy użyć znaczników","odpowiedz":"<?php .......... ?>"},{"tresc":" Który z zapisów znacznika <meta> jest prawidłowy ze względu na wykorzystane atrybuty?","odpowiedz":"<meta name = \"description\" content = \"Masz jakieś hobby? To jest strona dla Ciebie!\">"},{"tresc":" Który znacznik należący do sekcji head dokumentu HTML w wersji 5 jest wymagany przez walidator języka HTML, a jego brak jest zgłaszany jako błąd (error)?","odpowiedz":"title"},{"tresc":" Oznaczenie barwy w postaci #ff00e0 jest równoważne zapisowi","odpowiedz":"rgb(255,0,224)"},{"tresc":" Jakie wartości muszą przyjmować zmienne w funkcji biblioteki mysqli, aby połączyć się z serwerem i bazą danych?","odpowiedz":"adres serwera - $a, nazwa bazy danych - $d, login - $b, hasło - $c"},{"tresc":" Konstruktor w języku PHP jest metodą o nazwie","odpowiedz":"_construct"},{"tresc":" W programie MS Access we właściwościach pola klasa należy ustawić maskę wprowadzania danych. Którą maskę należy podać, aby wprowadzone dane były złożone z trzech znaków w formacie: obowiązkowa cyfra, po niej obowiązkowe dwie litery?","odpowiedz":"0LL"},{"tresc":" Baza danych zawiera dane multimedialne, co wiąże się z przechowywaniem dużych ilości danych binarnych. Do takich danych należy zastosować typ","odpowiedz":"BLOB"},{"tresc":" Błędy interpretacji kodu PHP są zapisane:","odpowiedz":"w logu pod warunkiem ustawienia odpowiedniego parametru w pliku php.ini"},{"tresc":" Za pomocą którego słowa kluczowego deklaruje się zmienną w języku JavaScript?","odpowiedz":"var"},{"tresc":" DOM dostarcza metod i własności, które w języku JavaScript pozwalają na","odpowiedz":"pobieranie i modyfikowanie elementów strony wyświetlonej przez przeglądarkę"},{"tresc":" Wskaż instrukcję iteracyjną.","odpowiedz":"for"},{"tresc":" W języku CSS zdefiniowano formatowanie dla stopki. Aby użyć tego formatowania dla bloku opisanego znacznikiem div, należy zapisać","odpowiedz":"<div id=\"stopka\">"},{"tresc":" Kolor 255 12 12 w modelu RGB na stronie www powinien być zapisany w postaci","odpowiedz":"#FF0C0C"},{"tresc":" Przedstawiona definicja formularza została zastosowana na stronie internetowej, która wysyła dane do pliku zapisanego w języku PHP. W której tablicy będą dostępne dane z formularza?","odpowiedz":"$_POST"},{"tresc":"Który zapis stylu CSS ustawi tło bloku na kolor niebieski?","odpowiedz":"div {background-color: blue;}"},{"tresc":"Który z kodów HTML opisuje przedstawioną tabelę? (Dla uproszczenia pominięto zapis stylu obramowania tabeli i komórek)","odpowiedz":"B"},{"tresc":"Aby stworzyć przycisk na stronę internetową według wzoru, należy w programie do grafiki rastrowej użyć opcji","odpowiedz":"zaokrąglenie lub wybranie opcji prostokąt z zaokrąglonymi rogami"},{"tresc":"Warunek zapisany w JavaScript jest prawdziwy, gdy zmienna x przechowuje","odpowiedz":"dowolną dodatnią wartość liczbową"},{"tresc":"Dla którego akapitu zastosowano przedstawioną właściwość stylu CSS?","odpowiedz":"B"},{"tresc":"Aby zamieścić na stronie internetowej film, należy użyć znacznika","odpowiedz":"<video>"},{"tresc":"Wynikiem działania pętli for w przedstawionym kodzie PHP jest wyświetlenie liczb","odpowiedz":"1 1"},{"tresc":"Która lista jest interpretacją przedstawionego kodu?","odpowiedz":"C"},{"tresc":"W bazie danych MySQL polecenie CREATE USER umożliwia","odpowiedz":"utworzenie użytkownika"},{"tresc":" Tabela Pacjenci ma pola: imie, nazwisko, wiek, lekarz_id. Aby zestawić raport zawierający wyłącznie imiona i nazwiska pacjentów poniżej 18 roku życia, którzy zapisani są do lekarza o id równym 6, można posłużyć się kwerendą SQL","odpowiedz":"SELECT imie, nazwisko FROM Pacjenci WHERE wiek<18 AND lekarz_id=6;"},{"tresc":" Zastosowanie kwerendy SQL: DELETE FROM mieszkania WHERE status=1; spowoduje usunięcie","odpowiedz":"rekordów, w których pole status jest równe 1, z tabeli mieszkania"},{"tresc":" Tekst paragrafu, wyśrodkowany w pionie, opisuje w CSS reguła","odpowiedz":"vertical-align: middle"},{"tresc":" W języku JavaScript zapisano kod, którego wynikiem działania jest","odpowiedz":"wyświetlenie okna z polem edycyjnym, w którym jest wpisany domyślny tekst \"Adam\""},{"tresc":" Kaskadowe arkusze stylów tworzy się w celu","odpowiedz":"definiowania sposobu formatowania elementów strony internetowej"},{"tresc":" Które zdarzenie pozwala wykonać kod w języku JavaScript w chwili wysyłania formularza HTML i zablokować lub pozwolić na jego wysłanie?","odpowiedz":"onSubmit"},{"tresc":" Zdefiniowano bazę danych z tabelą podzespoły o polach: model, producent, typ, cena. Aby wyświetlić wszystkie modele pamięci RAM firmy Kingston w kolejności od najtańszej do najdroższej, należy posłużyć się kwerendą:","odpowiedz":"SELECT model FROM podzespoly WHERE typ=\"RAM\" AND producent=\"Kingston\" ORDER BY cena ASC;"},{"tresc":" W podanym kodzie HTML przedstawiony styl CSS jest stylem","odpowiedz":"lokalnym"},{"tresc":" W MS SQL Server polecenie RESTORE DATABASE służy do","odpowiedz":"odtworzenia bazy danych z kopii bezpieczeństwa"},{"tresc":" Testy dotyczące skalowalności oprogramowania mają za zadanie sprawdzić, czy aplikacja","odpowiedz":"potrafi działać przy zakładanym i większym obciążeniu"},{"tresc":" Aby wyświetlić jedynie imię, nazwisko i ulicę wszystkich mieszkańców, należy zastosować zapytanie","odpowiedz":"SELECT imie, nazwisko, ulica FROM Mieszkancy JOIN Adresy ON Mieszkancy.Adresy_id = Adresy.id;"},{"tresc":" Aby za pomocą CSS zdefiniować przedstawione opływanie obrazu tekstem należy w stylu obrazu wprowadzić zapis","odpowiedz":"float: right;"},{"tresc":" W kodzie PHP znak \"//\" oznacza","odpowiedz":"początek komentarza jednoliniowego"},{"tresc":" Aby obraz umieszczony na stronie internetowej automatycznie skalował się do rozmiaru ekranu, na którym jest wyświetlana strona, należy","odpowiedz":"jego szerokość ustawić w wartościach procentowych"},{"tresc":" Aby naprawić bazę danych w MySQL, należy użyć polecenia","odpowiedz":"REPAIR"},{"tresc":" Hermetyzacja to zasada programowania obiektowego mówiąca o tym, że","odpowiedz":"pola i metody wykorzystywane tylko przez daną klasę/obiekt są ograniczone zasięgiem private lub protected"},{"tresc":" W języku SQL dla dowolnych zestawów danych w tabeli Uczniowie, aby wybrać rekordy, które zawierają wyłącznie uczennice o imieniu \"Aleksandra\", urodzone po roku \"1998\", należy zapisać zapytanie","odpowiedz":"SELECT * FROM Uczniowie WHERE imie=\"Aleksandra\" AND rok_urodzenia > \"1998\";"},{"tresc":" W języku SQL polecenie ALTER TABLE ma za zadanie","odpowiedz":"modyfikować kolumny w tabeli"},{"tresc":" Jaką funkcję pełni kwerenda krzyżowa w bazie MS Access?","odpowiedz":"Prezentuje zliczone wartości z pola i przyporządkowuje je w wiersze i kolumny"},{"tresc":" Proces filtracji sygnału wejściowego w dziedzinie czasu, obejmujący zasadę superpozycji, związany jest filtrem","odpowiedz":"liniowym"},{"tresc":" Wartość i typ zmiennej w języku PHP można sprawdzić za pomocą funkcji","odpowiedz":"var_dump()"},{"tresc":" Grafik chce przekształcić bez utraty jakości obraz JPG w format PNG w ten sposób, żeby wszędzie tam, gdzie w pierwotnym obrazie jest kolor biały, w obrazie docelowym była przezroczystość. Aby to zrobić, powinien","odpowiedz":"dodać kanał alfa"},{"tresc":" Ile razy zostanie wykonana pętla zapisana w przedstawionym skrypcie PHP?","odpowiedz":"6"},{"tresc":" W języku PHP float reprezentuje typ","odpowiedz":"zmiennoprzecinkowy"},{"tresc":" Aby przywrócić bazę danych MS SQL z kopii bezpieczeństwa, należy zastosować polecenie","odpowiedz":"RESTORE DATABASE"},{"tresc":" Które z wymienionych osób odpowiadają za przygotowanie systemu bazy danych do pracy produkcyjnej w sposób ciągły, zarządzanie użytkownikami i instalowanie nowych wersji systemu bazodanowego?","odpowiedz":"Administratorzy systemu bazy danych"},{"tresc":" Chcąc sformatować w stylach CSS wszystkie obrazy zawarte w akapicie, powinno się użyć selektora","odpowiedz":"p img"},{"tresc":" Przedstawiona baza danych zawiera trzy tabele i dwie relacje. Aby wyświetlić dane wszystkich lekarzy przypisanych do konkretnego pacjenta, należy przyrównać klucze","odpowiedz":"Lekarze.id = Pacjenci.Lekarze_id"},{"tresc":" Dana jest tabela oceny o polach id, nazwisko, imie, ocena. Przedstawione zapytanie jest przykładem","odpowiedz":"selekcji."},{"tresc":"W bazach danych relacja wiele-do-wielu pomiędzy tabelami występuje, gdy","odpowiedz":"wielu wierszom tabeli A przypada wiele wierszy tabeli B."},{"tresc":"Włączenie do kodu skryptu zawartości pliku egzamin.php, zawierającego kod PHP, wymaga dodania instrukcji","odpowiedz":"include(\"egzamin.php\");"},{"tresc":"Aby wyświetlić rekordy z tabeli pracownicy tylko dla pracowników, którzy skończyli 26 lat należy użyć zapytania","odpowiedz":"SELECT * FROM pracownicy WHERE wiek > 25;"},{"tresc":"Program FileZilla może posłużyć do","odpowiedz":"publikacji strony internetowej"},{"tresc":"W języku JavaScript zadeklarowana zmienna i, która ma przechowywać wynik dzielenia wynoszący 1, to","odpowiedz":"var i = parseInt(3/2);"},{"tresc":"W języku PHP zapisano instrukcję pętli przedstawioną w ramce. Ile powtórzeń będzie miała podana pętla, jeśli zmienna sterująca nie jest modyfikowana w jej wnętrzu, oraz nie wprowadzono instrukcji modyfikacji pętli typu break?","odpowiedz":"10 powtórzeń"},{"tresc":"Dana jest tabela o nazwie wycieczki z polami: nazwa, cena, miejsca (jako liczba wolnych miejsc). Aby dla dowolnego zbioru danych tabeli wyświetlić jedynie nazwy tych wycieczek, dla których cena jest niższa niż 2000 zł i mają przynajmniej cztery wolne miejsca, należy posłużyć się zapytaniem","odpowiedz":"SELECT nazwa FROM wycieczki WHERE cena < 2000 AND miejsca > 3;"},{"tresc":"W języku HTML zdefiniowano odnośnik do strony internetowej. Aby strona otwierała się w nowym oknie lub zakładce przeglądarki, należy dopisać do definicji odnośnika atrybut","odpowiedz":"target = \"_blank\""},{"tresc":" Z którym ze słów kluczowych programowania obiektowego w języku JavaScript wiąże się dostęp do pól i metod tylko z poziomu klasy, w której są zdefiniowane?","odpowiedz":"private"},{"tresc":" Który z elementów dokumentacji aplikacji powinien znaleźć się w dokumentacji użytkownika?","odpowiedz":"Opis obsługi funkcji systemu"},{"tresc":" Baza danych zawiera tabelę o nazwie pracownicy o polach: nazwisko, imie, pensja, wiek. Jak wygląda składnia polecenia wyznaczającego średnią pensję pracowników?","odpowiedz":"select AVG (pensja) from pracownicy"},{"tresc":" W przedstawionym diagramie bazy danych biblioteka, elementy: czytelnik, wypozyczenie i ksiazka są","odpowiedz":"encjami"},{"tresc":" W języku PHP zapisano fragment kodu. Plik cookie stworzony tym poleceniem","odpowiedz":"zostanie usunięty po jednym dniu od jego utworzenia"},{"tresc":" Na tabeli muzyka, przedstawionej na rysunku, zostało wykonane następujące zapytanie SQL. Jaki wynik zwróci ta kwerenda?","odpowiedz":"pusty wynik"},{"tresc":" Wbudowanym w pakiet XAMPP narzędziem służącym do zarządzania bazą danych jest","odpowiedz":"phpMyAdmin"},{"tresc":" Podstawowym zadaniem systemu CMS jest oddzielenie treści serwisu informacyjnego od jego wyglądu. Efekt ten jest uzyskany poprzez generowanie zawartości","odpowiedz":"z bazy danych oraz wyglądu ze zdefiniowanego szablonu"},{"tresc":" Rozproszonym systemem kontroli wersji projektu programistycznego jest","odpowiedz":"GIT."},{"tresc":" Kolor zapisany kodem heksadecymalnym: #1510FE w kodzie RGB będzie miał wartość","odpowiedz":"rgb(21,16,254)"},{"tresc":" Który zestaw pojęć definiuje interfejs użytkownika strony internetowej?","odpowiedz":"Przyciski, menu, interakcja użytkownika z aplikacją."},{"tresc":" W tabeli artykuly wykonano następujące polecenia dotyczące praw użytkowania jan. Po wykonaniu poleceń użytkownik jan będzie miał prawa do","odpowiedz":"tworzenia tabeli i wypełniania jej danymi"},{"tresc":" Na potrzeby strony internetowej zdefiniowano styl. Styl będzie przypisany tylko do niektórych znaczników (np. niektórych nagłówków, kilku akapitów). W takim wypadku, aby przypisać styl do kilku konkretnych znaczników, najlepiej jest zastosować","odpowiedz":"klasę"},{"tresc":" W języku PHP sumę logiczną oznacza operator","odpowiedz":"||"},{"tresc":" Aby naprawić uszkodzoną tabelę w MySQL, należy wydać polecenie","odpowiedz":"REPAIR TABLE"},{"tresc":" W języku HTML, aby scalić w pionie dwie sąsiednie komórki w kolumnie tabeli, należy zastosować atrybut","odpowiedz":"rowspan"},{"tresc":" Aby zdefiniować w języku HTML listę nienumerowaną, należy użyć znacznika","odpowiedz":"<ul>"},{"tresc":" W języku PHP zapisywanie danych do pliku realizuje funkcja","odpowiedz":"fputs()"},{"tresc":" Metoda udostępniania bazy danych w programie Microsoft Access, dotycząca wszystkich obiektów bazy umieszczonych na dysku sieciowym i używanych jednocześnie przez różne osoby nosi nazwę","odpowiedz":"folderu sieciowego"},{"tresc":" Która z instrukcji języka JavaScript dokona zmiany koloru tekstu na niebieski w akapicie zdefiniowanym w dokumencie HTML?","odpowiedz":"document.getElementById(\"jeden\").style.color = \"blue\";"},{"tresc":" W języku SQL wykorzystywanym przez bazę danych MySQL atrybut UNIQUE polecenia CREATE TABLE","odpowiedz":"Jest stosowany, jeśli wartość w kolumnie nie mogą się powtarzać"},{"tresc":" Podczas obróbki grafiki rastrowej w programie z obsługą kanałów dodanie kanału alfa oznacza","odpowiedz":"dodanie warstwy z przezroczystością"},{"tresc":" W stylu CSS aby zadeklarować krój czcionki, należy użyć właściwości","odpowiedz":"font-family"},{"tresc":"W programowaniu obiektowym mechanizm współdzielenia pól i metod klasy w taki sposób, że klasa pochodna zawiera metody zdefiniowane w klasie bazowej nazywa się","odpowiedz":"dziedziczeniem"},{"tresc":"Dana jest tabela uczniowie o polach id, imie, nazwisko, data_ur (format rrrr-mm-dd). Które zapytanie w języku SQL wyświetli tylko imiona i nazwiska uczniów urodzonych w 2001 roku?","odpowiedz":"SELECT imie, nazwisko FROM uczniowie WHERE data_ur like \"2001-%-%\";"},{"tresc":"Zapis znacznika HTML w postaci","odpowiedz":"jest poprawny, po wybraniu odnośnika aktualna strona zostanie przewinięta do elementu o nazwie \"hobby\""},{"tresc":"Zamieszczony w ramce fragment kodu w JavaScript wypisze","odpowiedz":"\"ze\""},{"tresc":"W jakim formacie będzie wyświetlana data po uruchomieniu przedstawionego kodu?","odpowiedz":"Monday, 10th July 2017"},{"tresc":"Dla dowolnego a z przedziału (0,99) zadaniem funkcji zapisanej w języku Java Script jest:","odpowiedz":"wypisanie liczb z przedziału a...100 i zwrócenie wartości zmiennej n"},{"tresc":"Polecenie serwera MySQL przedstawione poniżej sprawi, że użytkownikowi tkowal zostaną","odpowiedz":"odebrane prawa usuwania i modyfikowania danych w tabeli pracownicy"},{"tresc":"Odwołaniem do imienia Agata, zawartym w przedstawionej tablicy JavaScript, jest element","odpowiedz":"Imiona[3];"},{"tresc":"Który opis odnosi się do metody POST wysyłania formularza?","odpowiedz":"Jest wskazana, gdy przesyłane są informacje poufne, np. hasło, numer telefonu czy numer karty kredytowej"},{"tresc":" Przedstawione polecenie MySQL ma za zadanie","odpowiedz":"Zmienić typ kolumny w tabeli ksiazki"},{"tresc":" W języku CSS, w celu zdefiniowania wewnętrznego górnego marginesu, czyli odstepu między elementem a otaczającym go obramowaniem, należy użyć polecenia","odpowiedz":"padding-top"},{"tresc":" Kanał alfa służy do zdefiniowania","odpowiedz":"przezroczystość obiektu graficznego"},{"tresc":" Wskaż poprawny zapis instrukcji zapisanej w języku JavaScript.","odpowiedz":"document.write(\"Liczba π z dokładnością do 2 miejsc po przecinku ≈ \" + 3.14 );"},{"tresc":" Personalizowanie wyglądu strony dla danego użytkownika i jego identyfikacja w serwisie są możliwe dzięki mechanizmowi","odpowiedz":"cookie"},{"tresc":" Wartość pola tabeli pełniącego rolę klucza podstawowego","odpowiedz":"musi być unikalna"},{"tresc":" W znaczniku meta w miejsce kropek należy wpisać","odpowiedz":"streszczenie treści strony."},{"tresc":" Aby ustawić tło na stronie www należy użyć polecenia","odpowiedz":"<body bgcolor=\"\"></body>"},{"tresc":" Przedstawiony kod źródłowy, zapisany w języku C++, ma za zadanie dla wprowadzanych dowolnych całkowitych liczb różnych od zera wypisać","odpowiedz":"tylko liczby parzyste"},{"tresc":" W języku JavaScript, aby zmienić wartość atrybutu znacznika HTML, po uzyskaniu obiektu za pomocą metody getElementById należy skorzystać z","odpowiedz":"metody setAttribute"},{"tresc":" W języku HTML informacje dotyczące autora, streszczenia i słów kluczowych strony należy umieścić","odpowiedz":"pomiędzy znacznikami <head> i </head>, w znaczniku <meta>"},{"tresc":" Ile iteracji będzie miała pętla zapisana w języku PHP, zakładając, że zmienna sterująca nie jest modyfikowana we wnętrzu pętli?","odpowiedz":"6"},{"tresc":" Które tabele zostaną sprawdzone za pomocą przedstawionego polecenia?","odpowiedz":"Tabele, które zmieniły się od ostatniej kontroli lub nie zostały poprawnie zamknięte"},{"tresc":" Zdefiniowanie klucza obcego jest niezbędne do utworzenia","odpowiedz":"relacji 1..n"},{"tresc":" W języku CSS zdefiniowano następujące formatowanie. Kolorem czerwonym zostanie zapisany","odpowiedz":"tylko tekst pochylony nagłówka pierwszego stopnia"},{"tresc":" Który z wymienionych znaczników języka HTML nie jest stosowany w celu formatowania tekstu?","odpowiedz":"<div>"},{"tresc":" Pętla while powinna być wykonywana tak długo, jak długo zmienna x będzie przyjmowała wartości z przedziału obustronnie otwartego (-2, 5). Zapis tego warunku w nagłówku pętli za pomocą języka PHP ma postać","odpowiedz":"($x > -2) && ($x < 5)"},{"tresc":" W aplikacjach internetowych tablice asocjacyjne to tablice, w których","odpowiedz":"indeks jest łańcuchem tekstowym"},{"tresc":" Który z formatów NIE pozwala na zapis plików animowanych?","odpowiedz":"ACE"},{"tresc":" W języku PHP funkcja, która może służyć do sprawdzenia, czy dany ciąg jest fragmentem innego ciągu, to","odpowiedz":"strstr();"},{"tresc":" Formatem zapisu rastrowych plików graficznych z kompresją bezstratną jest","odpowiedz":"PNG"},{"tresc":" W języku CSS, aby formatować tekst poprzez przekreślenie, podkreślenie dolne lub górne, należy zastosować","odpowiedz":"text-decoration"},{"tresc":" Zakładając, że użytkownik wcześniej nie miał żadnych praw, polecenie SQL nada użytkownikowi anna prawa jedynie do","odpowiedz":"wybierania, wstawiania oraz aktualizacji danych tabeli o nazwie klienci."},{"tresc":" W języku PHP w wyniku działania fragmentu kodu w zmiennej o nazwie Nowy_Napis znajdzie się","odpowiedz":"zawsze sprawdz swoj kod"},{"tresc":" W języku SQL aby zmodyfikować dane w tabeli, należy posłużyć się poleceniem","odpowiedz":"UPDATE"},{"tresc":" Która ze zdefiniowanych funkcji w języku PHP jako wynik zwraca połowę kwadratu wartości przekazanej?","odpowiedz":"function licz($a) { return $a*$a/2; }"},{"tresc":" Które z zapytań SQL, wybiera nazwiska z tabeli klient, które są minimum jednoliterowe i rozpoczynają się od litery Z?","odpowiedz":"SELECT nazwisko FROM klient WHERE nazwisko LIKE 'Z%';"},{"tresc":" Na rysunku pokazano schemat rozmieszczenia bloków na stronie WWW, w której jego części umieszcza się zwykle stopkę strony?","odpowiedz":"5"},{"tresc":"Dana jest tabela pracownicy o polach id, nazwisko, imie, wynagrodzenie. Kolumnę wynagrodzenie można usunąć za pomocą instrukcji","odpowiedz":"ALTER TABLE pracownicy DROP COLUMN wynagrodzenie;"},{"tresc":"W tabeli podzespoly należy zmienić wartość pola URL na 'toshiba.pl' dla wszystkich rekordów, gdzie pole producent to TOSHIBA. W języku SQL modyfikacja będzie miała postać","odpowiedz":"UPDATE podzespoly SET URL='toshiba.pl' WHERE producent='TOSHIBA';"},{"tresc":"Podana definicja stylu CSS sprawi, że nagłówki pierwszego stopnia będą","odpowiedz":"wyśrodkowane, pisane wielkimi literami, a odstępy między literami będą ustawione na 10 px"},{"tresc":"Edytor spełniający założenia WYSIWYG musi umożliwiać","odpowiedz":"uzyskanie zbliżonego wyniku tworzonej strony do jej obrazu w przeglądarce internetowej"},{"tresc":"Za pomocą przedstawionego zapytania w tabeli zostanie","odpowiedz":"dodana kolumna nazwa2 typu zmiennoprzecinkowego"},{"tresc":"Na rysunku przedstawiono dwie tabele. Aby połączyć je relacją jeden do wielu, jeden po stronie Klienci wiele po stronie Zamowienia, należy","odpowiedz":"Dodać pole klucza obcego do tabeli Zamowienia i połączyć je z ID tabeli Klienci"},{"tresc":"W języku CSS poniższy zapis użyty na stronie, na której jest kilka paragrafów, a każdy z nich ma po kilka linii sprawi, że","odpowiedz":"pierwsza linia każdego paragrafu będzie miała większą czcionkę niż następne linie"},{"tresc":"Fragment kodu napisany w języku HTML zamieszczony w ramce przedstawia listę","odpowiedz":"numerowaną"},{"tresc":"Aby przesłać dane za pomocą funkcji mysqli_query() w skrypcie PHP, który wstawia do bazy danych dane pobrane z formularza ze strony internetowej, jako jednego z parametrów należy użyć kwerendy","odpowiedz":"INSERT INTO"},{"tresc":" Wskaż słowo kluczowe w języku C++ dodawane przed wbudowanym typem danych, które przesuwa zakres liczby wyłącznie nieujemne","odpowiedz":"unsigned"},{"tresc":" Wielkość grafiki JPEG umieszczonej na stronie internetowej może mieć wpływ na","odpowiedz":"długość czasu ładowania strony."},{"tresc":" Zmienna typu integer lub int może przechowywać","odpowiedz":"liczbę całkowitą."},{"tresc":" Pojęcie \"front-end\" stosowane w kontekście tworzenia stron WWW odnosi się do","odpowiedz":"interfejsu strony internetowej związanego z technologiami działającymi po stronie przeglądarki internetowej."},{"tresc":" Za pomocą polecenia ALTER TABLE można","odpowiedz":"zmienić strukturę tabeli"},{"tresc":" Dla którego akapitu zastosowano przedstawioną właściwość stylu CSS?","odpowiedz":"B"},{"tresc":" Które z wyrażeń logicznych zapisanych w języku C sprawdza, czy zmienna o nazwie zm1 należy do przedziału (6, 203> ?","odpowiedz":"(zm1 > 6) && (zm1 <= 203)"},{"tresc":" Na rysunku została przedstawiona relacja jeden do wielu. Łączy ona","odpowiedz":"klucz obcy rezyserzy_id tabeli filmy z kluczem podstawowym id tabeli rezyserzy"},{"tresc":" Polecenie SQL, które usuwa bazę danych o nazwie firma, ma postać","odpowiedz":"DROP DATABASE firma;"},{"tresc":" Do graficznego tworzenia stron internetowych należy wykorzystać.","odpowiedz":"program typu WYSIWYG"},{"tresc":" Według którego parametru oraz dla ilu tabel zostaną zwrócone wiersze na liście w wyniku przedstawionego zapytania?","odpowiedz":"Według parametru nr_id dla wszystkich tabel"},{"tresc":" Baza danych MySQL uległa uszkodzeniu. Które z działań NIE pomoże przy jej naprawie?","odpowiedz":"Wykonanie replikacji bazy danych"},{"tresc":" Fragment kodu prezentuje składnię języka","odpowiedz":"PHP"},{"tresc":" Aby witryna internetowa prawidłowo skalowała się w urządzeniach mobilnych, należy wielkość czcionki zdefiniować","odpowiedz":"w procentach"},{"tresc":" Fragment kodu w języku PHP wypisze","odpowiedz":"samą nazwę konta, czyli \"adres\""},{"tresc":" Wymaganiem aplikacji internetowej jest, aby ta była wykonywana po stronie klienta. W którym języku należy zaimplementować tę aplikację?","odpowiedz":"JavaScript"},{"tresc":" Na obrazie przedstawiono efekt formatowania stylami CSS oraz kod HTML generujący ten przykład. Zakładając, że marginesy wewnętrzne wynoszą 50 px, a zewnętrzne wynoszą 20 px, styl CSS dla obrazu ma postać","odpowiedz":"C"},{"tresc":" Które z poleceń umożliwia dodanie kolumny zadaniekompletne do tabeli zadania?","odpowiedz":"ALTER TABLE zadania ADD COLUMN zadaniekompletne int"},{"tresc":" Który styl CSS pozwoli zdefiniować wyrównanie tekstu do prawej strony?","odpowiedz":"<p style=\"text-align: right\">tekst</p>"},{"tresc":" Która z operacji NIE WPŁYNIE na rozmiar / wielkość zajmowanej pamięci pliku graficznego?","odpowiedz":"Skalowanie obrazu za pomocą atrybutów HTML"},{"tresc":" Zmienne typu int odnoszą się do liczb","odpowiedz":"całkowitych"},{"tresc":" Zapisaną językiem PHP funkcję o nazwie policz wywołano z argumentem $Z = 1. Jaki wynik zostanie zwrócony?","odpowiedz":"13"},{"tresc":" W języku HTML, aby uzyskać następujący efekt pogrubienia, pochylenia lub zapisania w górnym indeksie należy zapisać kod:","odpowiedz":"<b>pogrubiony </b><i>pochylony</i> lub w <sup>górnym indeksie</sup>"},{"tresc":" Kod: SELECT imie, pesel, wiek FROM dane WHERE wiek IN (18,30) spowoduje wybranie:","odpowiedz":"imion, numerów PESEL i wieku osób w wieku równym 18 lub 30 lat"},{"tresc":" Zadaniem przedstawionej funkcji zapisanej w języku JavaScript jest","odpowiedz":"wypisanie liczb parzystych z przedziału od a do b"},{"tresc":" Do reprezentacji liczb zmiennoprzecinkowych w języku C stosowany jest typ","odpowiedz":"double"},{"tresc":" Projektując stronę internetową, umieszczono kod definiujący jej styl. Jaką szerokość pozostawiono na treść strony?","odpowiedz":"560 px"},{"tresc":"Aby przenieść witrynę na serwer, można skorzystać z oprogramowania","odpowiedz":"FileZilla"},{"tresc":"Wymaganiem aplikacji internetowej jest, aby ta była wykonywana po stronie klienta. W którym języku należy zaimplementować tę aplikację?","odpowiedz":"JavaScript"},{"tresc":"Za pomocą polecenia BACKUP LOG w MS SQL Server można","odpowiedz":"wykonać kopię bezpieczeństwa dziennika transakcyjnego"},{"tresc":"Globalne tablice do przechowywania danych o ciastkach i sesjach: $_COOKIE oraz $_SESSION są częścią języka","odpowiedz":"PHP"},{"tresc":"W języku skryptowym JavaScript zmienne mogą być deklarowane","odpowiedz":"w momencie pierwszego użycia zmiennej"},{"tresc":"Plik graficzny należy zapisać w formacie GIF, jeżeli","odpowiedz":"jest potrzeba zapisu obrazu lub animacji"},{"tresc":"W przedstawonym kodzie JavaScript dla ułatwienia ponumerowano linie. W kodzie znajduje się błąd, gdyż po uruchomieniu żaden komunikat nie zostaje wyświetlony. Aby wyeliminować błąd, należy","odpowiedz":"wstawić nawiasy klamrowe do sekcji if oraz else"},{"tresc":"W języku JavaScript poprawnie nadana zmienna to","odpowiedz":"imie2"},{"tresc":"W języku SQL ustawienie klucza podstawowego na polu id w tabeli uczniowie możliwe jest za pomocą polecenia","odpowiedz":"ALTER TABLE uczniowie ADD PRIMARY KEY (id);"},{"tresc":" W języku CSS wartości: underline, overline, line-through oraz blink dotyczą właściwości","odpowiedz":"text-decoration"},{"tresc":" Wskaż instrukcję równoważną do instrukcji switch zapisanej językiem PHP.","odpowiedz":"B"},{"tresc":" Aby pozbyć się nienaturalnego odwzorowania ukośnych krawędzi linii w grafice rastrowej, czyli tak zwanego schodkowania, należy zastosować filtr","odpowiedz":"antyaliasingu"},{"tresc":" Który framework został opracowany dla skryptowego języka PHP?","odpowiedz":"Symfony."},{"tresc":" Która z funkcji SQL NIE pobiera argumentów?","odpowiedz":"now"},{"tresc":" W poleceniu CREATE TABLE języku SQL atrybut określający, która kolumna tabeli jest kluczem podstawowym, to","odpowiedz":"PRIMARY KEY"},{"tresc":" W języku JavaScript utworzono obiekt. Aby pobrać wartość własności w można zapisać","odpowiedz":"obiekt.w"},{"tresc":" Znacznik języka HTML, który służy do oznaczenia fragmentu tekstu jako kodu komputerowego, to","odpowiedz":"<code> </code>"},{"tresc":" W języku PHP zmienna typu float przyjmuje wartości","odpowiedz":"zmiennoprzecinkowe"},{"tresc":" Prosta animacja może być zapisana w formacie","odpowiedz":"GIF"},{"tresc":" Która z wymienionych funkcji sortowania wykorzystywana w języku PHP sortuje tablicę asocjacyjną według indeksów","odpowiedz":"ksort()"},{"tresc":" Dla przedstawionego fragmentu kodu walidator HTML zwróci błąd, ponieważ","odpowiedz":"nie domknięto cudzysłowu"},{"tresc":" W języku JavaScript przedstawiona definicja jest definicją","odpowiedz":"tablicy"},{"tresc":" W języku JavaScript należy zapisać warunek, który będzie spełniony, gdy zmienna a będzie dowolną liczbą naturalną dodatnią (bez 0) lub gdy zmienna b będzie dowolną liczbą z przedziału domkniętego od 10 do 100. Użyte w tym warunku wyrażenie logiczne będzie miało postać","odpowiedz":"(a>0) || ((b>=10) && (b<=100))"},{"tresc":" Kwalifikatory dostępu: private, protected i public definiują mechanizm","odpowiedz":"hermetyzacji."},{"tresc":" Baza danych zawiera tabele artykuły z polami: nazwa, typ, producent, cena. Aby wyświetlić wszystkie nazwy artykułów wyłącznie typu pralka, dla których cena jest z przedziału 1000 PLN i 1500 PLN, należy zastosować polecenie","odpowiedz":"SELECT nazwa FROM artykuly WHERE typ=\"pralka\" AND cena BETWEEN 1000 AND 1500;"},{"tresc":" Aby dostosować stronę internetową dla niewidomych, należy nadać wyświetlanym za pomocą znacznika img obrazom atrybut","odpowiedz":"alt"},{"tresc":" W przedstawionym fragmencie algorytmu zastosowano","odpowiedz":"jedną pętlę"},{"tresc":" Po wykonaniu kodu PHP zostanie wyświetlona aktualna data zawierająca jedynie","odpowiedz":"rok."},{"tresc":" W języku CSS, należy zdefiniować tło dokumentu jako obraz rys.png. Obraz ma powtarzać się jedynie w poziomie. Którą definicję należy przypisać selektorowi body?","odpowiedz":"{background-image: url(\"rys.png\"); background-repeat: repeat-x;}"},{"tresc":" Aby obraz wstawiony kodem HTML mógł być interpretowany przez programy wspomagające osoby niewidzące, należy zdefiniować atrybut","odpowiedz":"alt"},{"tresc":" Dana jest tabela uczniowie o polach id, imie, nazwisko, data_ur (format rrrr-mm-dd). Które zapytanie w języku SQL wyświetli tylko imiona i nazwiska uczniów urodzonych w 2001 roku?","odpowiedz":"SELECT imie, nazwisko FROM uczniowie WHERE data_ur like \"2001-%-%\";"},{"tresc":" Do utworzenia kopii zapasowej bazy danych w MySQL należy użyć polecenia","odpowiedz":"mysqldump"},{"tresc":" Baza danych 6-letniej szkoły podstawowej zawiera tabelę szkola z polami: imie, nazwisko, klasa. Wszyscy uczniowie klas 1-5 zdali do następnej klasy. Aby zwiększyć wartość w polu klasa o 1 należy użyć polecenia","odpowiedz":"UPDATE szkola SET klasa=klasa+1 WHERE klasa>=1 AND klasa <=5;"},{"tresc":" Kodowanie w standardzie ISO-8859-2 stosowane jest w celu poprawnego wyświetlenia","odpowiedz":"polskich liter, takich jak: ś, ć, ń, ó, ą"},{"tresc":"Kod zamieszczony w ramce spowoduje wypisanie liczb","odpowiedz":"2 4 6 8 10"},{"tresc":"Wartości: static, relative, fixed, absolute oraz sticky można przypisać do właściwości","odpowiedz":"position"},{"tresc":"W kodzie JavaScript pobrano element za pomocą metody getElementById. Aby zmodyfikować zawartość (treść) elementu można użyć właściwości","odpowiedz":"innerHTML"},{"tresc":"Aby obraz zmieniał się płynnie w filmie, liczba klatek (nieprzenikających się wzajemnie) na sekundę musi znajdować się przynajmniej w zakresie","odpowiedz":"24-30 fps"},{"tresc":"Polecenie SQL, które usuwa bazę danych o nazwie firma, ma postać","odpowiedz":"DROP DATABASE firma;"},{"tresc":"Który zapis definiuje w języku PHP komentarz wieloliniowy?","odpowiedz":"/* */"},{"tresc":"Baza danych zawiera tabelę uczniowie z polami: imie, nazwisko, klasa. Aby odnaleźć imiona i nazwiska tych uczniów, których nazwiska rozpoczynają się literą M, należy zastosować polecenie SQL","odpowiedz":"SELECT nazwisko, imie FROM uczniowie WHERE nazwisko LIKE \"M%\";"},{"tresc":"Podczas strumieniowego przesyłania cyfrowego materiału wideo parametrem wpływającym na jakość obrazu i dźwięku jest przepływność. Wielkość ta opisuje liczbę","odpowiedz":"bitów transmitowanych w jednostce czasu."},{"tresc":"Testy aplikacji internetowej mające za zadanie sprawdzenie skalowalności aplikacji i bazy danych oraz architektury serwera i konfiguracji noszą nazwę testów","odpowiedz":"kompatybilności"},{"tresc":" W celu zmodyfikowania tekstu \"ala ma psa\" na \"ALA MA PSA\" należy użyć funkcji PHP","odpowiedz":"strtoupper(\"ala ma psa\");"},{"tresc":" W języku PHP zmienna predefiniowana $_SESSION zawiera","odpowiedz":"zmienne zarejestrowane w bieżącej sesji"},{"tresc":" Pole lub zbiór pól jednoznacznie identyfikujący każdy pojedynczy wiersz w tabeli w bazie danych to klucz","odpowiedz":"podstawowy."},{"tresc":" Który znacznik lub grupa znaczników nie są stosowane do definiowania struktury strony HTML?","odpowiedz":"<i>, <b>, <u>"},{"tresc":" Za pomocą którego protokołu można opublikować stronę internetową na serwerze?","odpowiedz":"FTP"},{"tresc":" Które ze zdań jest prawdziwe w stosunku do grafiki rastrowej?","odpowiedz":"Jest to prezentacja obrazu za pomocą pionowo-poziomej siatki odpowiednio kolorowanych pikseli na monitorze komputera, drukarce lub innym urządzeniu wyjściowym"},{"tresc":" Która z wbudowanych funkcji agregujących języka SQL oblicza średnią wartości we wskazanej kolumnie?","odpowiedz":"AVG"},{"tresc":" Analizując przedstawiony kod zapisany w języku HTML, można stwierdzić, że w przeglądarce","odpowiedz":"blok B będzie oddalony od bloku A o 20 px"},{"tresc":" W języku SQL polecenie INSERT INTO","odpowiedz":"wprowadza dane do tabeli"},{"tresc":" Którego języka należy użyć, aby zapisać skrypt wykonywany po stronie klienta w przegladarce internetowej?","odpowiedz":"JavaScript"},{"tresc":" Które ze stwierdzeń dotyczących języków programowania NIE jest prawdziwe","odpowiedz":"SQL jest językiem programowania strukturalnego"},{"tresc":" Kod strony WWW napisanej w języku PHP","odpowiedz":"jest wykonywany po stronie serwera"},{"tresc":" Przedstawiony fragment kodu PHP działa poprawnie i ma za zadanie wyświetlić na stronie internetowej dane pobrane kwerendą z bazy danych. Z ilu pól zostaną wyświetlone dane?","odpowiedz":"Z trzech pól."},{"tresc":" Który z odsyłaczy posiada poprawną konstrukcję?","odpowiedz":"<a href=\"mailto:adres\"> tekst </a>"},{"tresc":" Programem do edycji dźwięku jest","odpowiedz":"Audacity"},{"tresc":" Strona HTML definiuje akapit oraz rysunek. Aby rysunek został umieszczony przez przeglądarkę w tej samej linii co akapit po jego lewej stronie, należy w stylu CSS rysunku zawrzeć własność","odpowiedz":"float:left;"},{"tresc":" Co można powiedzieć o normalizacji przedstawionej tabeli?","odpowiedz":"Tabela nie jest znormalizowana"},{"tresc":" Za pomocą którego protokołu należy wysłać pliki na serwer WWW?","odpowiedz":"FTP"},{"tresc":" Jednoznacznym identyfikatorem rekordu w bazie danych jest pole","odpowiedz":"klucza podstawowego"},{"tresc":" Element zadeklarowany w języku C++ double *x; to","odpowiedz":"Wskaźnik"},{"tresc":" Struktura prostych baz danych, w których wszystkie dane są przechowywane w jednej tabeli, nazywana jest modelem","odpowiedz":"jednorodnym"},{"tresc":" Który format pliku jest formatem rastrowym?","odpowiedz":"TIFF"},{"tresc":"Jakiego formatu należy użyć do zapisu obrazu z kompresją stratną?","odpowiedz":"JPEG"},{"tresc":"Przedstawiona w języku C++ definicja typu wyliczeniowego sprawi, że enumerator CZWARTEK będzie równy","odpowiedz":"liczbie 4"},{"tresc":"Aby zwiększyć szybkość działania strony zawierającej grafikę o wymiarach 2000 px na 760 px, należy zmniejszyć rozmiary grafiki","odpowiedz":"w programie graficznym."},{"tresc":"W kodzie HTML kolor biały można zapisać za pomocą wartości","odpowiedz":"rgb(255,255,255)"},{"tresc":"Jak nazywa się element oznaczony znakiem zapytania w strukturze platformy .NET, który umożliwia tworzenie własnych aplikacji z użyciem frameworków i zamianę kompilowanego kodu pośredniego na kod maszynowy procesora zainstalowanego w komputerze?","odpowiedz":"Wspólne środowisko uruchomieniowe (CLR)"},{"tresc":"Błędy interpretacji kodu PHP są zapisane:","odpowiedz":"w logu pod warunkiem ustawienia odpowiedniego parametru w pliku php.ini"},{"tresc":"Za pomocą którego słowa kluczowego deklaruje się zmienną w języku JavaScript?","odpowiedz":"var"},{"tresc":"Za pomocą którego zapytania Administrator odbierze prawo przeglądania oraz aktualizacji danych w bazie gazeta, dla użytkownika redaktor?","odpowiedz":"REVOKE SELECT, UPDATE ON gazeta.* FROM 'redaktor'@'localhost';"},{"tresc":" Zakładając, że zmienne: a, b, c przechowują wartości numeryczne, wynikiem działania warunku będzie wypisanie liczby","odpowiedz":"największej"},{"tresc":" Który sposób komentowania w języku PHP pozwala na zapis bloku komentarza w kilku liniach?","odpowiedz":"/* */"},{"tresc":" Która informacja dotycząca przedstawionego kodu jest prawdziwa?","odpowiedz":"Znak kropki \".\" jest operatorem konkatenacji."},{"tresc":" W kodzie JavaScript pętla zostanie wykonana","odpowiedz":"3 razy"},{"tresc":" Który z typów wspieranych przez język PHP służy do obsługi zmiennych logicznych?","odpowiedz":"Boolean"},{"tresc":" W relacyjnych bazach danych, jeżeli dwie tabele są połączone za pomocą ich kluczy głównych, mamy do czynienia z relacją","odpowiedz":"1..1"},{"tresc":" W języku C++ zdefiniowano zmienną: char zm1;. W jaki sposób można do niej przypisać wartość zgodnie ze składnią języka?","odpowiedz":"zm1 = 'w';"},{"tresc":" Wskaż typ relacji pomiędzy tabelami: Tabela1 i Tabela3","odpowiedz":"Wiele do wielu"},{"tresc":" W którym z przypadków walidacja fragmentu kodu CSS przebiegnie pomyślnie?","odpowiedz":"p { font-weight:bold; }"},{"tresc":" Które zapytanie SQL dla tabeli pracownicy utworzonej według schematu: id, imie, nazwisko, plec, zarobek, obliczy osobno średni zarobek kobiet i średni zarobek mężczyzn?","odpowiedz":"SELECT AVG(zarobek) FROM pracownicy GROUP BY plec;"},{"tresc":" Aby zamieścić na stronie internetowej film, należy użyć znacznika","odpowiedz":"<video>"},{"tresc":" Znaczniki <header>, <article>, <section>, <footer> są charakterystyczne dla języka","odpowiedz":"HTML 5"},{"tresc":" W języku SQL klauzula DISTINCT instrukcji SELECT sprawi, że zwrócone dane","odpowiedz":"nie będą zawierały powtórzeń"},{"tresc":" Przedstawione pole input umożliwi","odpowiedz":"zaznaczenie opcji"},{"tresc":" Jakiego rodzaju mechanizm kontroli bezpieczeństwa wykonywania aplikacji zawiera środowisko uruchomieniowe platformy .NET Framework?","odpowiedz":"Mechanizm wykonywania aplikacji oparty na uprawnieniach kodu (CAS - Code Access Security) i na rolach (RBS - Role-Based Security)"},{"tresc":" Dana jest tablica o nazwie tab wypełniona liczbami całkowitymi różnymi od zera. Przedstawiony kod zapisany w języku PHP ma za zadanie:","odpowiedz":"zamienić wszystkie elementy tablicy na liczby z przeciwnym znakiem"},{"tresc":" Wskaż rezultat działania fragmentu kodu JavaScript","odpowiedz":"Dodanie akapitu na koniec strony"},{"tresc":" Aby w tworzonej w języku SQL tabeli praca dodać w kolumnie stawka warunek, że musi przyjmować rzeczywiste wartości dodatnie mniejsze od 50, należy użyć zapisu","odpowiedz":"... stawka float CHECK(stawka>0 AND stawka<50.00)"},{"tresc":" Przedstawiono efekt formatowania CSS oraz kod HTML. Jak należy zdefiniować styl, aby osiągnąć takie formatowanie?","odpowiedz":"p::first-line {font-size: 200%; color:brown;}"},{"tresc":" Jak nazywa się podzbiór strukturalnego języka zapytań, związany z formułowaniem zapytań do bazy danych za pomocą polecenia SELECT?","odpowiedz":"SQL DQL (ang. Data Query Language)"},{"tresc":" W języku PHP przekierowanie użytkownika na inną stronę WWW jest możliwe za pomocą funkcji","odpowiedz":"header();"},{"tresc":" Do grupowania obszarów na poziomie bloków, które będą formatowane za pośrednictwem znaczników, należy użyć","odpowiedz":"<div>"},{"tresc":"Aby w JavaScript wykonać wymienione kroki, należy w znaczniku <script> umieścić kod","odpowiedz":"A = prompt(\"Podaj kwalifikację: \"); document.write(\"Kwalifikacja: \" + A);"},{"tresc":"Za pomocą którego polecenia SQL można usunąć z tabeli artykuly wiersze zawierające słowo \"sto\" znajdujące się w dowolnym miejscu pola tresc?","odpowiedz":"DELETE FROM artykuly WHERE tresc LIKE \"%sto%\";"},{"tresc":"Po wykonaniu kodu PHP zostanie wyświetlona aktualna data zawierająca jedynie","odpowiedz":"rok."},{"tresc":"Aby stworzyć tabelę w bazie danych, należy zastosować polecenie SQL","odpowiedz":"CREATE TABLE"},{"tresc":"Zakładając, że zmienne: a, b, c przechowują wartości numeryczne, wynikiem działania warunku będzie wypisanie liczby","odpowiedz":"największej"},{"tresc":"Wynikiem uruchomienia zapytania SQL jest","odpowiedz":"liczba uczniów, których średnia ocen wynosi 5"},{"tresc":"Aby na stronie internetowej wyświetlić logo, którego tło jest przezroczyste, należy zastosować format","odpowiedz":"PNG"},{"tresc":"Funkcja phpinfo() pozwala na:","odpowiedz":"uzyskanie informacji o środowisku pracy serwera obsługującego PHP"},{"tresc":"Który z rysunków obrazuje efekt działania przedstawionego fragmentu kodu HTML?","odpowiedz":"C"},{"tresc":" Dana jest tabela psy o polach: imie, rasa, telefon_wlasciciela, rok_szczepienia. Aby wyszukać telefony właścicieli, których psy były szczepione przed 2015 rokiem, należy użyć polecenia SQL","odpowiedz":"SELECT telefon_wlasciciela FROM psy WHERE rok_szczepienia < 2015"},{"tresc":" Aby przywrócić bazę danych z kopii bezpieczeństwa na serwerze MSSQL, należy posłużyć się poleceniem","odpowiedz":"RESTORE DATABASE"},{"tresc":" W bazach danych relacja wiele-do-wielu pomiędzy tabelami występuje, gdy","odpowiedz":"wielu wierszom tabeli A przypada wiele wierszy tabeli B."},{"tresc":" W języku JavaScript typ boolean może być reprezentowany przez wartość","odpowiedz":"true"},{"tresc":" W serwerze MySQL nadanie roli o nazwie DBManager przyznaje użytkownikowi prawa umożliwiające","odpowiedz":"wszelkie operacje na bazach danych serwera"},{"tresc":" Pole insert_id zdefiniowane w bibliotece MySQLi języka PHP może być wykorzystane do","odpowiedz":"otrzymania id ostatnio wstawionego wiersza."},{"tresc":" Który rastrowy format graficzny jest obsługiwany przez przeglądarki internetowe?","odpowiedz":"PNG"},{"tresc":" Baza danych księgarni zawiera tabelę ksiazki z polami: id, idAutor, tytul, ileSprzedanych oraz tabelę autorzy z polami: id, imie, nazwisko. Aby stworzyć raport sprzedanych książek z tytułami i nazwiskami autorów, należy","odpowiedz":"Zdefiniować relację 1..n dla tabel ksiazki i autorzy, a następnie stworzyć kwerendę łączącą obie tabele"},{"tresc":" Podczas walidacji dokumentu HTML5 pojawił się komunikat o treści: \"Error: Element head is missing a required instance of child element title\". Oznacza to, że w dokumencie","odpowiedz":"nie zdefiniowano elementu <title> w części <head> dokumentu."},{"tresc":" W celu przyspieszenia operacji na bazie danych należy do pól często wyszukiwanych lub sortowanych","odpowiedz":"utworzyć indeks"},{"tresc":" Jak nazywa się element bazy danych, za pomocą którego można jedynie odczytać dane z bazy, prezentując je w postaci tekstu lub wykresu?","odpowiedz":"Raport"},{"tresc":" W CSS symbolem jednostki miary, wyrażonej w punktach edytorskich, jest","odpowiedz":"pt"},{"tresc":" Co zostanie wypisane w wyniku wykonania przedstawionych instrukcji?","odpowiedz":"1"},{"tresc":" W języku PHP zapisano fragment kodu działającego na bazie MySQL. Jego zadaniem jest wypisanie","odpowiedz":"miasta i kodu pocztowego z pierwszego zwróconego rekordu"},{"tresc":" Cechą formatu PNG jest","odpowiedz":"bezstratna kompresja"},{"tresc":" Przedstawiono kod tabeli 3x2. Której z modyfikacji w jej drugim wierszu należy dokonać, aby tabela wyglądała jak na obrazku z niewidocznym wierszem?","odpowiedz":"<tr style=\"visibility: hidden\">"},{"tresc":" Kolor zapisany kodem RGB, o wartości rgb(255, 128, 16) w kodzie szesnastkowym będzie miał wartość:","odpowiedz":"#ff8010"},{"tresc":" Który modyfikator wskazuje podany opis?","odpowiedz":"private"},{"tresc":" Która z przedstawionych grup znaczników HTML zawiera znaczniki służące do grupowania elementów i tworzenia struktury dokumentu?","odpowiedz":"div, article, header"},{"tresc":" Która wartość zostanie wypisana przez algorytm?","odpowiedz":"15"},{"tresc":" Co należy zastosować w organizacji danych, aby zapytania w bazie danych były wykonywane szybciej?","odpowiedz":"Indeksy"},{"tresc":"Kolor zielony, w notacji szesnastkowej skróconej, można zapisać w CSS sekwencją","odpowiedz":"#0F0"},{"tresc":"W języku JavaScript, aby wydzielić fragment napisu znajdujący się pomiędzy wskazanymi przez parametr indeksami należy użyć metody","odpowiedz":"slice()"},{"tresc":"Ukrywanie pewnych pól lub metod obiektów danej klasy tak, aby były one dostępne tylko metodom wewnętrznym tej klasy lub funkcjom zaprzyjaźnionym, to","odpowiedz":"hermetyzacja"},{"tresc":"Które tabele zostaną sprawdzone za pomocą przedstawionego polecenia?","odpowiedz":"Tabele, które zmieniły się od ostatniej kontroli lub nie zostały poprawnie zamknięte"},{"tresc":"W CSS symbolem jednostki miary, wyrażonej w punktach edytorskich, jest","odpowiedz":"pt"},{"tresc":"Kolor 255 12 12 w modelu RGB na stronie www powinien być zapisany w postaci","odpowiedz":"#FF0C0C"},{"tresc":"W przedstawionym fragmencie algorytmu zastosowano","odpowiedz":"jedną pętlę"},{"tresc":"Operator arytmetyczny modulo w języku SQL to","odpowiedz":"%"},{"tresc":"Model opisu przestrzeni barw o parametrach: odcień, nasycenie i jasność, to","odpowiedz":"HSV"},{"tresc":" Proces, w którym wykrywa się i usuwa błędy w kodzie źródłowym programów, to","odpowiedz":"Debugowanie"},{"tresc":" Do tabeli pracownicy wpisano rekordy. Co zostanie wyświetlone po uruchomieniu kwerendy SQL SELECT podanej w ramce?","odpowiedz":"Wartość 10000, czyli suma pensji pracownika o id=4 oraz o id=6"},{"tresc":" Które z poleceń naprawi uszkodzoną tabelę w języku SQL?","odpowiedz":"REPAIR TABLE tblname"},{"tresc":" Który ze sposobów komentowania kodu nie jest stosowany w kodzie PHP?","odpowiedz":"<!-- komentarz -->"},{"tresc":" Aby zbadać rozkład ilościowy poszczególnych kolorów zdjęcia, należy użyć","odpowiedz":"histogramu"},{"tresc":" Normalizacja tabel jest procesem, który ma na celu","odpowiedz":"sprawdzenie i optymalizację bazy danych"},{"tresc":" Które ze stwierdzeń dotyczących klucza podstawowego jest prawdziwe?","odpowiedz":"Jest unikalny w obrębie tabeli"},{"tresc":" W języku CSS poniższy zapis sprawi, że kolor żółty przyjmie czcionka","odpowiedz":"odnośników, które otwierają sie w osobnej karcie"},{"tresc":" Aby edytować nakładające się na siebie pojedyncze fragmenty obrazu, pozostawiając pozostałe elementy niezmienione, należy zastosować","odpowiedz":"Warstwy"},{"tresc":" Dana jest tablica n-elementowa o nazwie t[n]. Zadaniem algorytmu zapisanego w postaci listy kroków jest wypisania sumy","odpowiedz":"co drugiego elementu tablicy"},{"tresc":" W jaki sposób wykonanie podanej w ramce kwerendy SQL wpłynie na tabelę pracownicy?","odpowiedz":"Zmieni typ danych kolumny plec na znakowy o stałej długości 9"},{"tresc":" Aby użyć zewnętrznego skryptu JavaScript o nazwie skrypt.js, należy zapisać w kodzie HTML","odpowiedz":"<script src=\"skrypt.js\"></script>"},{"tresc":" Dokonując konwersji obrazu z 8 bitową głębią kolorów na obraz z 4 bitową głębią, liczba kolorów zmniejszy się o","odpowiedz":"240"},{"tresc":" Po uszkodzeniu serwera bazy danych, aby możliwie najsprawniej przywrócić działanie kompletnej bazy należy użyć","odpowiedz":"aktualnej wersji kopii zapasowej."},{"tresc":" Jednostka ppi (pixels per inch)","odpowiedz":"określa rozdzielczość obrazów rastrowych"},{"tresc":" Aby policzyć wszystkie wiersze tabeli Koty należy użyć polecenia:","odpowiedz":"SELECT COUNT(*) FROM Koty"},{"tresc":" Który z typów relacji wymaga utworzenia tabeli pośredniej łączącej klucze główne obu tabel?","odpowiedz":"n..m"},{"tresc":" Które ze stwierdzeń, w odniesieniu do zamieszczonej w ramce definicji funkcji, jest poprawne?","odpowiedz":"Wczytanie tekstu zakończy się, gdy tekst będzie się składał przynajmniej z 3 znaków"},{"tresc":" Ile maksymalnie należy użyć znaczników <td> w tabeli o trzech kolumnach i trzech wierszach niezawierającej złączeń komórek i wiersza nagłówkowego?","odpowiedz":"9"},{"tresc":" W czasie przetwarzania dźwięku, aby pozbyć się niechcianych odgłosów spowodowanych złą jakością mikrofonu, należy zastosować narzędzie","odpowiedz":"usuwania szumów"},{"tresc":" Którego znacznika NIE NALEŻY umieszczać w nagłówku dokumentu HTML?","odpowiedz":"<h2>"},{"tresc":" Na podstawie tabeli Towar wykonano następujące zapytanie SQL. Jaki będzie wynik tej operacji?","odpowiedz":"Papier ksero A4, Kredki 24 kolory, Zeszyt A5, Zeszyt A5 w linie"},{"tresc":" W języku HTML znacznik <strong>tekst</strong> będzie wyświetlany w ten sam sposób przez przeglądarkę co znacznik","odpowiedz":"<b>tekst</b>"},{"tresc":" Aby zdefiniować łamanie linii tekstu, np. w zmiennej napisowej, należy posłużyć się znakiem","odpowiedz":"n"},{"tresc":"Który język skryptowy ogólnego przeznaczenia należy wykorzystać do tworzenia aplikacji WWW, zagnieżdżanych w języku HTML i uruchamianych po stronie serwera?","odpowiedz":"PHP"},{"tresc":"Specjalna metoda danej klasy stosowana w programowaniu obiektowym, wywoływana automatycznie podczas tworzenia obiektu, której podstawowym zadaniem jest zwykle zainicjowanie pól, to","odpowiedz":"konstruktor"},{"tresc":"Personalizowanie wyglądu strony dla danego użytkownika i jego identyfikacja w serwisie są możliwe dzięki mechanizmowi","odpowiedz":"cookie"},{"tresc":"Za pomocą którego protokołu można opublikować stronę internetową na serwerze?","odpowiedz":"FTP"},{"tresc":"Element zadeklarowany w języku C++ double *x; to","odpowiedz":"Wskaźnik"},{"tresc":"Wskaż pętlę, która w języku JavaScript wyświetli sześć kolejnych liczb parzystych","odpowiedz":"for(i=2;i<=12;i+=2) {document.write(i);}"},{"tresc":"Jak zdefiniować w języku CSS formatowanie hiperłącza, żeby nieodwiedzony link był w kolorze żółtym, a odwiedzony w kolorze zielonym?","odpowiedz":"a:link {color: yellow;} a:visited{color: green;}"},{"tresc":"Saturacja koloru nazywana jest inaczej","odpowiedz":"nasyceniem koloru"},{"tresc":" Blok deklaracji postaci background-attachment: scroll powoduje, że","odpowiedz":"tło strony będzie przewijane razem z tekstem"},{"tresc":" Tabele: Klienci i Zgloszenia są powiązane relacją jeden do wielu. Aby wybrać jedynie opis zgłoszenia oraz odpowiadające mu nazwisko klienta dla zgłoszenia numer 5, należy wydać polecenie","odpowiedz":"SELECT opis, nazwisko FROM Zgloszenia JOIN Klienci ON Klienci.id = Zgloszenia.Klienci_id WHERE Zgloszenia.id = 5;"},{"tresc":" Atrybut value w polu formularza XHTML","odpowiedz":"wskazuje odpowiedź domyślną"},{"tresc":" Który z wymienionych formatów umożliwia zapis dźwięku i obrazu?","odpowiedz":"MP4"},{"tresc":" Wskaż PRAWDZIWE stwierdzenie dla polecenia: CREATE TABLE IF NOT EXISTS ADRES(ulica VARCHAR(70) CHARACTER SET utf8);","odpowiedz":"IF NOT EXISTS stosuje się opcjonalnie, aby upewnić się, że brak w bazie danych takiej tabeli"},{"tresc":" Wskaż różnicę pomiędzy poleceniami DROP TABLE i TRUNCATE TABLE.","odpowiedz":"DROP TABLE usuwa tabelę, a TRUNCATE TABLE usuwa wszystkie dane, pozostawiając pustą tabelę."},{"tresc":" Która z wymienionych funkcji zapisanych językiem PHP zwraca sumę połowy a i połowy b","odpowiedz":"function licz($a, $b) {return $a/2 + $b/2;}"},{"tresc":" Wskaż funkcję PHP, za pomocą której odczytana zawartość pliku jest zapisywana do zmiennej reprezentującej ciąg znaków.","odpowiedz":"file_get_contents();"},{"tresc":" Aby bezpiecznie przesłać pliki strony internetowej na serwer WWW można użyć protokołu","odpowiedz":"SFTP"},{"tresc":" Wskaż funkcję JavaScript, za pomocą której można obliczyć połowę kwadratu liczby przekazanej jako argument.","odpowiedz":"function wynik(a) { return a*a/2; }"},{"tresc":" Aby aplikacja PHP mogła komunikować się z bazą danych, niezbędne jest w pierwszej kolejności wywołanie funkcji o nazwie","odpowiedz":"mysqli_connect"},{"tresc":" Który fragment kodu JavaScript zwróci wartość true?","odpowiedz":"\"def\" > \"abc\""},{"tresc":" Wskaż zapisany w języku JavaScript warunek, który ma sprawdzić spełnienie przynajmniej jednego z przypadków: 1) dowolna naturalna liczba a jest trzycyfrowa, 2) dowolna całkowita liczba b jest ujemna","odpowiedz":"((a>99) && (a<1000)) || (b<0)"},{"tresc":" W kodzie CSS zastosowano formatowanie elementu listy, przy czym żadne inne formatowanie CSS nie zostało zdefiniowane. Zastosowane formatowanie sprawi, że","odpowiedz":"po najechaniu kursorem na element listy, zmieni się kolor tekstu na Maroon."},{"tresc":" Aby wskazać błędy składniowe w kodzie HTML, należy zastosować","odpowiedz":"walidator."},{"tresc":" Modelem barw opisującym kolor z użyciem stożka przestrzeni barw jest","odpowiedz":"HSV"},{"tresc":" Obraz, który ma być wyświetlony na stronie powinien mieć tło przezroczyste. Wskaż format graficzny, w którym należy zapisać taki plik.","odpowiedz":"PNG"},{"tresc":" Która wartość tekstowa nie pasuje do podanego w ramce wzorca wyrażenia regularnego?","odpowiedz":"Jelenia Góra"},{"tresc":" Kod zamieszczony w ramce spowoduje wypisanie liczb","odpowiedz":"2 4 6 8 10"},{"tresc":" Na przedstawionej tabeli samochody wykonano zapytanie SQL: SELECT model FROM samochody WHERE rocznik=2016; W wyniku podanego zapytania zostaną zwrócone następujące wartości:","odpowiedz":"Punto, Corsa, Corolla"},{"tresc":" Aby wykonać kopię zapasową bazy danych MySQL można posłużyć się","odpowiedz":"eksportem bazy."},{"tresc":" Aby stworzyć przycisk na stronę internetową według wzoru, należy w programie do grafiki rastrowej użyć opcji","odpowiedz":"zaokrąglenie lub wybranie opcji prostokąt z zaokrąglonymi rogami"},{"tresc":"W relacyjnych bazach danych, jeżeli dwie tabele są połączone za pomocą ich kluczy głównych, mamy do czynienia z relacją","odpowiedz":"1..1"},{"tresc":"W języku SQL przywilej SELECT polecenia GRANT pozwala użytkownikowi baz danych na","odpowiedz":"odczyt danych z tabeli"},{"tresc":"Aby wykonać kod zapisany językiem PHP wystarczy, że w systemie zainstalowano","odpowiedz":"serwer WWW z interpreterem PHP"},{"tresc":"Która z wbudowanych funkcji agregujących języka SQL oblicza średnią wartości we wskazanej kolumnie?","odpowiedz":"AVG"},{"tresc":"Narzędziem służącym do grupowania i prezentowania informacji z wielu rekordów w celu ich drukowania lub rozpowszechniania jest","odpowiedz":"raport"},{"tresc":"Czynnością zalecaną przed wykonaniem kopii bezpieczeństwa danych w bazie MySQL jest","odpowiedz":"sprawdzenie integralności bazy i ewentualnie jej naprawa."},{"tresc":"Pole lub zbiór pól jednoznacznie identyfikujący każdy pojedynczy wiersz w tabeli w bazie danych to klucz","odpowiedz":"podstawowy."},{"tresc":"Aby policzyć wszystkie wiersze tabeli Koty należy użyć polecenia:","odpowiedz":"SELECT COUNT(*) FROM Koty"},{"tresc":" Co definiuje w języku C++ przedstawiony fragment kodu?","odpowiedz":"Typ strukturalny składający się z trzech pól"},{"tresc":" Przed wykonaniem kopii bezpieczeństwa bazy danych, tak aby kopia ta była poprawna i możliwa do późniejszego odtworzenia, należy sprawdzić","odpowiedz":"spójność bazy danych"},{"tresc":" Aby zwiększyć szybkość działania strony zawierającej grafikę o wymiarach 2000 px na 760 px, należy zmniejszyć rozmiary grafiki","odpowiedz":"w programie graficznym."},{"tresc":" Aby uzyskać efekt rozstrzelenia liter w selektorze CSS, należy użyć właściwości","odpowiedz":"letter-spacing"},{"tresc":" W przedstawionej definicji stylu CSS, powtarzanie dotyczy","odpowiedz":"rysunku umieszczonego w tle strony w pionie"},{"tresc":" Dla akapitu zdefiniowano styl CSS. Które właściwości stylu CSS poprawnie opisują dla akapitu krój czcionki: Arial; rozmiar czcionki: 16 pt; styl czcionki: pochylenie?","odpowiedz":"p {font-family: Arial; font-size: 16pt; font-style: italic;}"},{"tresc":" Formatem plików dźwiękowych z kompresją bezstratną jest","odpowiedz":"FLAC"},{"tresc":" Funkcja agregująca MIN języka SQL ma za zadanie policzyć","odpowiedz":"Wartość minimalną kolumny zwróconej kwerendą"},{"tresc":" W folderze www znajdują się podfoldery html i style, w których zapisane są odpowiednio pliki z rozszerzeniem html i pliki z rozszerzeniem css. Chcąc dołączyć styl.css do pliku HTML należy użyć","odpowiedz":"<link rel=\"Stylesheet\" type=\"text/css\" href=\"/../style/styl.css\" />"},{"tresc":" Aby zmodyfikować strukturę tabeli w bazie MySQL należy wykonać polecenie","odpowiedz":"ALTER TABLE"},{"tresc":" W języku HTML, aby scalić w poziomie dwie sąsiednie komórki w wierszu tabeli należy zastosować atrybut","odpowiedz":"colspan"},{"tresc":" Aby obraz zmieniał się płynnie w filmie, liczba klatek (nieprzenikających się wzajemnie) na sekundę musi znajdować się przynajmniej w zakresie","odpowiedz":"24-30 fps"},{"tresc":" Formatem bezstratnej kompresji dźwięku jest","odpowiedz":"FLAC"},{"tresc":" Polecenie serwera MySQL przedstawione poniżej sprawi, że użytkownikowi tkowal zostaną","odpowiedz":"odebrane prawa usuwania i modyfikowania danych w tabeli pracownicy"},{"tresc":" W której technologii nie jest możliwe przetwarzanie danych użytkownika wprowadzanych na stronie WWW?","odpowiedz":"CSS"},{"tresc":"Do zabezpieczeń serwera bazy danych przed atakami hakerów nie należy","odpowiedz":"Defragmentacja dysków"},{"tresc":"Zapis w języku JavaScript ma za zadanie","odpowiedz":"utworzenie obiektu napis1 klasy napisy"},{"tresc":"Na obrazie przedstawiono efekt formatowania stylami CSS oraz kod HTML generujący ten przykład. Zakładając, że marginesy wewnętrzne wynoszą 50 px, a zewnętrzne wynoszą 20 px, styl CSS dla obrazu ma postać","odpowiedz":"C"},{"tresc":"W języku CSS zdefiniowano formatowanie dla pola edycyjnego. Tak formatowane pole edycyjne będzie miało jasnozielone tło","odpowiedz":"po kliknięciu myszą w celu zapisania w nim tekstu."},{"tresc":"Które ze stwierdzeń dotyczących języków programowania NIE jest prawdziwe","odpowiedz":"SQL jest językiem programowania strukturalnego"},{"tresc":"Który format pliku jest formatem rastrowym?","odpowiedz":"TIFF"},{"tresc":"W którym standardzie języka hipertekstowego zostały wprowadzone do składni znaczniki sekcji <footer>, <header>, <nav>?","odpowiedz":"HTML5"},{"tresc":"Znacznik <s> w języku HTML powoduje","odpowiedz":"przekreślenie tekstu"},{"tresc":"W przedstawionej klasie zdefiniowano","odpowiedz":"dwie właściwości."},{"tresc":" Tabele Osoby i Adresy są połączone relacją jeden do wielu. Jakie zapytanie SQL należy zapisać, aby korzystając z tej relacji, prawidłowo wyświetlić nazwiska oraz przyporządkowane im miasta?","odpowiedz":"SELECT nazwisko, Miasto FROM Osoby JOIN Adresy ON Osoby.Adresy_id=Adresy.id;"},{"tresc":" Wskaż model barw, który stosuje się do wyświetlania kolorów na ekranie monitora komputerowego","odpowiedz":"RGB"},{"tresc":" Aby dopasować dźwięk do danego poziomu głośności, należy użyć efektu","odpowiedz":"normalizacji"},{"tresc":" W języku PHP pobrano z bazy danych wyniki działania kwerendy za pomocą polecenia mysql_query(). Aby otrzymać ze zwróconej kwerendy wierszy danych, należy zastosować polecenie:","odpowiedz":"mysql_fetch_row()"},{"tresc":" Polecenie DBCC CHECKDB(\"sklepAGD\", Repair_fast) w MS SQL Server","odpowiedz":"sprawdzi spójność bazy danych i naprawi uszkodzone indeksy"},{"tresc":" W przedstawionym kodzie PHP, zamiast znaków zapytania powinien pojawić się komunikat:","odpowiedz":"Błąd przetwarzania zapytania"},{"tresc":" W zamieszczonym przykładzie pseudoklasa hover sprawi, że styl pogrubiony będzie przypisany","odpowiedz":"odnośnikowi, w momencie kiedy najechał na niego kursor myszy"},{"tresc":" Zadaniem funkcji zapisanej w języku PHP jest","odpowiedz":"Zwrócenie wartości 1, gdy liczba jest parzysta"},{"tresc":" W języku SQL, aby zmienić strukturę tabeli, np. poprzez dodanie lub usunięcie kolumny, należy zastosować polecenie","odpowiedz":"ALTER TABLE"},{"tresc":" W programie Microsoft Access formą zabezpieczeń dostępu do danych związaną z tabelą i kwerendą jest","odpowiedz":"przypisanie uprawnień"},{"tresc":" Przedstawione formatowanie CSS sprawi, że dla prezentowanego nagłówka trzeciego stopnia","odpowiedz":"tło będzie pomarańczowe"},{"tresc":" W języku PHP, dla zmiennych a = 5 i b = 3 wartość typu zmiennoprzecinkowego zwróci wyrażenie","odpowiedz":"a / b"},{"tresc":" Pogrubienie tekstu za pomocą znacznika <b> można uzyskać także przy wykorzystaniu właściwości CSS","odpowiedz":"font-weight"},{"tresc":" Jak zdefiniować w języku CSS formatowanie hiperłącza, żeby nieodwiedzony link był w kolorze żółtym, a odwiedzony w kolorze zielonym?","odpowiedz":"a:link {color: yellow;} a:visited{color: green;}"},{"tresc":" Jaki wynik zwróci zapytanie z ramki wykonane na przedstawionej tabeli?","odpowiedz":"3"},{"tresc":"Aby zamieścić aplikację PHP w internecie, należy jej pliki źródłowe skopiować na serwer za pomocą protokołu","odpowiedz":"FTP"},{"tresc":"Formularze do obsługi baz danych tworzy się w celu","odpowiedz":"wygodniejszego wprowadzania, edytowania i usuwania danych"},{"tresc":"W języku CSS, aby zdefiniować niestandardowe odstępy między wyrazami, stosuje się właściwość","odpowiedz":"word-spacing"},{"tresc":"Programem do edycji dźwięku jest","odpowiedz":"Audacity"},{"tresc":"Funkcja drzewo kontekstowe edytor WYSIWYG Adobe Dreamweaver służy do","odpowiedz":"wyświetlania interaktywnego drzewa struktury HTML dla zawartości statycznej i dynamicznej"},{"tresc":"Język JavaScrypt ma obsługę","odpowiedz":"obiektów DOM"},{"tresc":"W języku XHTML zapisano fragment kodu, który zawiera błąd walidacji. Na czym polega ten błąd?","odpowiedz":"Znacznik <br> powinien być zamknięty"},{"tresc":"Który z wymienionych poniżej języków jest typowo front-endowy (wykonywany po stronie klienta)?","odpowiedz":"CSS"},{"tresc":"Którego protokołu należy użyć, aby przesłać pliki strony internetowej na serwer hostingowy?","odpowiedz":"FTP"},{"tresc":" Deklaracja w języku JavaScript: var x=true; powoduje, że zmienna x jest typu","odpowiedz":"logicznego"},{"tresc":" Przedstawiony kod został zapisany w języku JavaScript. W podanej definicji obiektu metodą jest element o nazwie","odpowiedz":"oblicz"},{"tresc":" Którą klauzulę powinno się zastosować w poleceniu CREATE TABLE języka SQL, aby dane pole rekordu nie było puste?","odpowiedz":"NOT NULL"},{"tresc":" W skrypcie PHP należy utworzyć cookie o nazwie owoce które przyjmie wartość jabłko. Cookie ma być dostępne przez jedną godzinę od jego utworzenia. W tym celu należy w skrypcie PHP użyć funkcji:","odpowiedz":"setcookie(\"owoce\",\"jabłko\",time()+3600);"},{"tresc":" Które oprogramowanie NIE JEST systemem zarządzania treścią (CMS)?","odpowiedz":"Apache"},{"tresc":" Wskaż wynik wykonania skryptu napisanego w języku PHP","odpowiedz":"A"},{"tresc":" W języku C, aby zadeklarować stałą, należy użyć","odpowiedz":"const"},{"tresc":" Integralność referencyjna w modelu relacyjnych baz danych oznacza, że","odpowiedz":"wartość klucza obcego w danej tabeli musi być albo równa wartości klucza głównego w tabeli z nia powiązanej albo równa wartości NULL"},{"tresc":" Aby w języku HTML uzyskać takie formatowanie paragrafu dla tekstu należy zastosować kod","odpowiedz":"<p>Tekst może być <mark>zaznaczony</mark> albo <em>istotny</em> dla autora</p>"},{"tresc":" Zamieszczony w ramce fragment skryptu w języku JavaScript","odpowiedz":"przypisze zmiennej s długość napisu ze zmiennej t"},{"tresc":" Który znacznik służy budowaniu hierarchii tekstu w języku HTML?","odpowiedz":"<h6>"},{"tresc":" Który kod jest alternatywny do kodu zamieszczonego w ramce?","odpowiedz":"A"},{"tresc":" Witryna internetowa ma mieć przedstawioną strukturę bloków. Aby uzyskać ten układ, należy znacznikom sekcji przypisać właściwości w następujący sposób:","odpowiedz":"float tylko dla bloków: 2, 3, 4; clear dla bloku 5"},{"tresc":" W języku PHP, aby połączyć się z bazą danych MySQL przy pomocy biblioteki mysqli, stosując zamieszczony zapis, w miejscu litery 'c' należy zapisać","odpowiedz":"nazwę użytkownika."},{"tresc":" Aby zdefiniować krój czcionki w stylu CSS, należy użyć właściwości","odpowiedz":"font-family"},{"tresc":" Aby nadać użytkownikowi uprawnienia do tabel w bazie danych, należy zastosować polecenie","odpowiedz":"GRANT"},{"tresc":" W języku PHP zmienna $_GET jest zmienną","odpowiedz":"predefiniowaną, używaną do przekazywania danych do skryptów PHP poprzez adres strony"},{"tresc":" W języku SQL, wykorzystywanym przez bazę danych MySQL w tabeli samochody, aby nadać wartość równą 0 dla kolumny przebieg, należy posłużyć się kwerendą","odpowiedz":"UPDATE samochody SET przebieg = 0;"},{"tresc":" W języku HTML zapisano formularz. Który z efektów działania kodu będzie wyświetlony przez przeglądarkę zakładając, że w drugie pole użytkownik wpisał wartość \"ala ma kota\"?","odpowiedz":"B"},{"tresc":"W algebrze relacji operacja selekcji polega na","odpowiedz":"wybraniu krotek spełniających określone warunki"},{"tresc":"W której części dokumentu HTML należy umieścić wewnętrzny arkusz stylów?","odpowiedz":"W części nagłówkowej strony."},{"tresc":"Składowymi modelu barw CMYK są kolory:","odpowiedz":"cyjan, magenta, żółty i czarny."},{"tresc":"W zapytaniu SQL umieszczonym poniżej, znak gwiazdki oznacza, że w wyniku tego zapytania","odpowiedz":"zostaną wyświetlone wszystkie kolumny tabeli mieszkancy"},{"tresc":"Aby prawidłowo udokumentować linię kodu języka Java Script, należy po znakach // wpisać komentarz","odpowiedz":"w zmiennej x maksymalna wartość ze zmiennych a, b, c"},{"tresc":"Typ zmiennej w języku JavaScript","odpowiedz":"następuje poprzez przypisanie wartości"},{"tresc":"Dana jest tablica o nazwie tab wypełniona liczbami całkowitymi różnymi od zera. Przedstawiony kod zapisany w języku PHP ma za zadanie:","odpowiedz":"zamienić wszystkie elementy tablicy na liczby z przeciwnym znakiem"},{"tresc":"Język HTML dysponuje nagłówkami do budowania hierarchii treści. Nagłówki te występują jedynie w zakresie","odpowiedz":"h1 - h6"},{"tresc":" Aby zamieścić aplikację PHP w internecie, należy jej pliki źródłowe skopiować na serwer za pomocą protokołu","odpowiedz":"FTP"},{"tresc":" W języku JavaScript zapis w ramce oznacza, że","odpowiedz":"zmienna x będzie przechowywać wynik działania metody nazwa"},{"tresc":" W ramce przedstawiono kod JavaScript z błędem logicznym. Program powinien wypisywać informację, czy liczby są sobie równe czy nie, lecz nie wykonuje tego. Wskaż odpowiedź, która dotyczy błędu","odpowiedz":"W klauzuli if występuje przypisanie zamiast porównania"},{"tresc":" W języku PHP zmiennej a przypisano tekst, w którym kilkukrotnie występuje słowo Kowalski. Aby jednym pleceniem zmienić w zmiennej a wszystkie wystąpienia słowa Kowalski na słowo Nowak, należy zastosować polecenie","odpowiedz":"$a = str_replace('Kowalski', 'Nowak', $a);"},{"tresc":" Które polecenie w CSS służy do załączenia zewnętrznego arkusza stylów?","odpowiedz":"import"},{"tresc":" Która lista jest interpretacją przedstawionego kodu?","odpowiedz":"C"},{"tresc":" Domyślna nazwa pliku konfiguracyjnego serwera Apache to","odpowiedz":".htaccess"},{"tresc":" Dana jest tabela zwierzeta z polami: nazwa, gatunek, gromada, cechy, dlugosc_zycia. Dla dowolnego zestawu danych, aby wyświetlić nazwy tych zwierząt, które żyją przynajmniej 20 lat oraz są ssakami, należy wydać zapytanie:","odpowiedz":"SELECT nazwa FROM zwierzeta WHERE dlugosc_zycia >=20 AND gromada = 'ssak';"},{"tresc":" Aby na stronie internetowej wyświetlić logo, którego tło jest przezroczyste, należy zastosować format","odpowiedz":"PNG"},{"tresc":" Jak działa instrukcja łącząca wyniki zapytań INTERSECT w języku SQL?","odpowiedz":"Zwraca część wspólną wyników dwóch zapytań."},{"tresc":" Fragment kodu języku PHP ma następującą postać. Wynikiem działania pętli będzie wypisanie liczb:","odpowiedz":"0,4,8,12,16,20"},{"tresc":" W bazie danych wykonano następujące polecenie dotyczące praw użytkownika adam. Po wykonaniu poleceń użytkownik adam będzie miał prawa do","odpowiedz":"usunięcia tabeli lub jej rekordów"},{"tresc":" W poleceniach, których celem jest odtwarzanie na stronie internetowej dźwięku jako podkładu muzycznego NIE wykorzystuje się atrybutu","odpowiedz":"href=\"C:/100.wav\">"},{"tresc":" Który z wymienionych poniżej języków jest typowo front-endowy (wykonywany po stronie klienta)?","odpowiedz":"CSS"},{"tresc":" W języku HTML aby zdefiniować słowa kluczowe strony, należy użyć zapisu","odpowiedz":"<meta name=\"keywords\" content=\"psy, koty, gryzonie\">"},{"tresc":" Operator arytmetyczny modulo w języku SQL to","odpowiedz":"%"},{"tresc":" W języku HTML zdefiniowano znacznik a. Wartość nofollow atrybutu rel","odpowiedz":"jest informacją dla robota wyszukiwarki Google, aby nie podążał za tym linkiem"},{"tresc":" Językami programowania działającymi po stronie serwera są:","odpowiedz":"Java, C#, Python, Ruby, PHP"},{"tresc":" W języku HTML zdefiniowano hiperłącze ze znakiem #. Co stanie się po wybraniu przedstawionego odsyłacza?","odpowiedz":"Strona przewinie się do elementu o wartości id równej dane"},{"tresc":"Który z paragrafów został sformatowany przedstawionym stylem zakładając, że pozostałe własności paragrafu przyjmują wartości domyślne?","odpowiedz":"C"},{"tresc":"Dla których imion zastosowana w zapytaniu klauzula LIKE jest prawdziwa?","odpowiedz":"Arleta, Krzysztof, Krystyna, Tristan."},{"tresc":"Organizacja zajmująca się ustalaniem standardu dla języka HTML nosi nazwę","odpowiedz":"W3C"},{"tresc":"Przedstawiona linia kreskowana w stylu obramowania CSS jest określona właściwością","odpowiedz":"dashed"},{"tresc":"W języku C++ funkcja zwracająca wynik potęgowania, działająca na dwóch parametrach wejściowych: liczbie x i wykładniku w, ma deklarację","odpowiedz":"int potega(int x, int w);"},{"tresc":"Formatami Video obsługiwanymi w standardzie HTML5 są","odpowiedz":"MP4, Ogg, WebM"},{"tresc":"Kaskadowe arkusze stylów tworzy się w celu","odpowiedz":"definiowania sposobu formatowania elementów strony internetowej"},{"tresc":"Programista napisał w języku C++ pętlę, która miała obliczyć wynik działania 5! (5! = 1 * 2 * 3 * 4 * 5). Popełnił jednak błąd logiczny polegający na tym, że","odpowiedz":"w drugim parametrze pętli powinno być porównanie i < 6 zamiast i < 5"},{"tresc":" W aplikacji internetowej komunikat powinien pojawiać się tylko wtedy, gdy dany użytkownik jest na stronie po raz pierwszy. Którą funkcję PHP należy w tym celu zastosować?","odpowiedz":"setcookie"},{"tresc":" W instrukcji warunkowej JavaScript należy sprawdzić przypadek, gdy zmienne a oraz b są dodatnie, z czego zmienna b jest mniejsza od 100. Warunek taki powinien być zapisany w następujący sposób:","odpowiedz":"if ( a > 0 && b > 0 && b < 100)"},{"tresc":" Ikona, która wyświetlona jest przed adresem, w polu adresowym przeglądarki internetowej lub przy tytule otwartej karty przeglądarki nosi nazwę","odpowiedz":"favicon"},{"tresc":" Program o nazwie FileZilla pozwala na","odpowiedz":"publikację strony internetowej na odległym serwerze."},{"tresc":" Wśród czterech podstawowych kolorów modelu barw CMYK jest","odpowiedz":"czarny."},{"tresc":" W tabeli podzespoly należy zmienić wartość pola URL na 'toshiba.pl' dla wszystkich rekordów, gdzie pole producent to TOSHIBA. W języku SQL modyfikacja będzie miała postać","odpowiedz":"UPDATE podzespoly SET URL='toshiba.pl' WHERE producent='TOSHIBA';"},{"tresc":" Który sposób komentowania jednoliniowego jest dozwolony w języku JavaScript?","odpowiedz":"//"},{"tresc":" Proporcje obrazu 16:9 (przy założeniu, że piksel ma kształt kwadratu) można uzyskać przy rozdzielczości","odpowiedz":"1366 na 768 pikseli."},{"tresc":" Znacznik meta języka HTML należy umieścić","odpowiedz":"w części nagłówkowej witryny internetowej"},{"tresc":" Na potrzeby strony internetowej przygotowano grafikę rysunek.jpg o rozmiarze: szerokość 200 px, wysokość 100 px. Aby wyświetlić tę grafikę jako miniaturę – pomniejszoną z zachowaniem proporcji, można zastosować znacznik","odpowiedz":"<img src=\"rysunek.png\" style=\"width: 50px\">"},{"tresc":" Tabela o nazwie naprawy zawiera pola: klient, czyNaprawione. Aby usunąć te rekordy, w których pole czyNaprawione jest prawdą, należy posłużyć się poleceniem","odpowiedz":"DELETE FROM naprawy WHERE czyNaprawione = TRUE;"},{"tresc":" W bazie danych, w celu uporządkowania listy uczniów według roku urodzenia, należy użyć polecenia","odpowiedz":"SELECT imie,nazwisko,klasa from uczniowie order by rok_urodzenia"},{"tresc":" Które wyrażenie logiczne należy zastosować w języku JavaScript, aby wykonać operacje tylko dla dowolnych liczb ujemnych z przedziału jednostronnie domkniętego <-200,-100)?","odpowiedz":"(liczba >=-200) && (liczba<-100)"},{"tresc":" Zadaniem funkcji PHP o nazwie mysql_num_rows() jest","odpowiedz":"zwrócić liczbę wierszy znajdujących się w wyniku zapytania"},{"tresc":" Fizyczny model replikacji bazy danych przedstawiony na rysunku jest modelem","odpowiedz":"centralnego wydawcy"},{"tresc":"Odpowiednia kolejność procesów przetwarzania analogowo-cyfrowego dźwięku to:","odpowiedz":"próbkowanie, kwantyzacja, kodowanie."},{"tresc":"W języku SQL, aby zabezpieczyć kwerendę CREATE USER tak, aby nie zostało utworzone konto w przypadku, gdy już istnieje, można posłużyć się składnią","odpowiedz":"CREATE USER IF NOT EXISTS 'anna'@'localhost' IDENTIFIED BY 'yu&T%';"},{"tresc":"W języku JavaScript wynik działania instrukcji zmienna++; będzie taki sam jak instrukcji","odpowiedz":"zmienna+=1;"},{"tresc":"Instrukcja for może być zastąpiona instrukcją","odpowiedz":"while"},{"tresc":"W języku CSS przypisano regułę: float:left; dla bloku. Reguła ta zostanie wykorzystana do","odpowiedz":"ustawienia bloku na lewo względem innych"},{"tresc":"Parametr face znacznika <font> służy do określenia","odpowiedz":"nazwy czcionki"},{"tresc":"W języku SQL polecenie INSERT INTO","odpowiedz":"wprowadza dane do tabeli"},{"tresc":"Które zapytanie SQL dla tabeli pracownicy utworzonej według schematu: id, imie, nazwisko, plec, zarobek, obliczy osobno średni zarobek kobiet i średni zarobek mężczyzn?","odpowiedz":"SELECT AVG(zarobek) FROM pracownicy GROUP BY plec;"},{"tresc":" W języku JavaScript zdefiniowano obiekt Samochod. Aby wywołać jedną z metod tego obiektu, należy zapisać","odpowiedz":"Samochod.spalanie()"},{"tresc":" Znacznik <pre> </pre> jest stosowany w celu wyświetlenia","odpowiedz":"treści czcionką o stałej szerokości."},{"tresc":" Przedstawiony fragment kodu PHP służy do obsługi","odpowiedz":"formularza."},{"tresc":" Ile razy należy zapisać instrukcję warunkową, aby zaimplementować w języku programowania przedstawiony algorytm?","odpowiedz":"Dwa razy."},{"tresc":" Jakie sa nazwy typowych poleceń języka zapytań SQL, związane z wykonywaniem operacji na danych SQL DML (np.: umieszczanie danych w bazie, kasowanie dokonywanie zmian w danych)?","odpowiedz":"DELETE, INSERT, UPDATE"},{"tresc":" W bazie danych MYSQL dana jest tabela programów komputerowych o polach: nazwa, producent, rokWydania. Aby kwerenda SELECT zwróciła wszystkie nazwy producentów tak, by nazwy te nie powtarzały się, należy zapisać:","odpowiedz":"SELECT DISTINCT producent FROM programy;"},{"tresc":" W jakim formacie należy zapisać obraz, aby mógł być wyświetlony na stronie internetowej z zachowaniem przezroczystości?","odpowiedz":"PNG"},{"tresc":" Model opisu przestrzeni barw o parametrach: odcień, nasycenie i jasność, to","odpowiedz":"HSV"},{"tresc":" Wskaż komentarz wieloliniowy w języku PHP","odpowiedz":"/* */"},{"tresc":" Wskaż BŁĘDNY opis optymalizacji kodu wynikowego programu","odpowiedz":"Jej celem jest sprawdzenie zgodności z wymogami formalnymi"},{"tresc":" W języku JavaScript zadeklarowana zmienna i, która ma przechowywać wynik dzielenia wynoszący 1, to","odpowiedz":"var i = parseInt(3/2);"},{"tresc":" Która instrukcja algorytmu odpowiada graficznej reprezentacji bloku przedstawionego na rysunku?","odpowiedz":"n > 20"},{"tresc":" W języku PHP funkcja trim ma za zadanie","odpowiedz":"Usuwać białe znaki lub inne znaki podane w parametrze, z obu końców napisu"},{"tresc":" Kolor zielony, w notacji szesnastkowej skróconej, można zapisać w CSS sekwencją","odpowiedz":"#0F0"},{"tresc":" W języku skryptowym JavaScript operatory: ||, && należą do grupy operatorów","odpowiedz":"logicznych"},{"tresc":" W zapytaniu SQL umieszczonym poniżej, znak gwiazdki oznacza, że w wyniku tego zapytania","odpowiedz":"zostaną wyświetlone wszystkie kolumny tabeli mieszkancy"},{"tresc":" Przedstawiona linia kodu została zapisana w języku","odpowiedz":"JavaScript"},{"tresc":" Plikiem konfiguracyjnym, który pozwala na zdefiniowanie ustawień PHP dla całego serwera, jest","odpowiedz":"php.ini"},{"tresc":"W bazie danych sklepu istnieje tabela artykuly zawierająca pole o nazwie nowy. Aby to pole wypełnić wartościami TRUE dla każdego rekordu, należy zastosować kwerendę","odpowiedz":"UPDATE artykuly SET nowy=TRUE;"},{"tresc":"Na podstawie tabeli Towar wykonano następujące zapytanie SQL. Jaki będzie wynik tej operacji?","odpowiedz":"Papier ksero A4, Kredki 24 kolory, Zeszyt A5, Zeszyt A5 w linie"},{"tresc":"Zgodnie z właściwościami ACID, dotyczącym wykonania transakcji, wymaganie trwałości (ang. durability) oznacza, że","odpowiedz":"dane zatwierdzone przez transakcję powinny być dostępne niezależnie od tego, co się będzie działo po jej zakończeniu"},{"tresc":"Wskaż poprawną kolejność etapów projektowania relacyjnej bazy danych","odpowiedz":"Określenie zbioru danych, Selekcja, Określenie kluczy podstawowych tabel, Określenie relacji"},{"tresc":"Aby zadeklarować pole klasy, do którego mają dostęp jedynie metody tej klasy i pole to nie jest dostępne dla klas pochodnych, należy użyć kwalifikatora dostępu","odpowiedz":"private"},{"tresc":"Który sposób komentowania jednoliniowego jest dozwolony w języku JavaScript?","odpowiedz":"//"},{"tresc":"Obiektem służącym w bazie danych do podsumowywania, wyświetlania i wydruków danych jest","odpowiedz":"raport"},{"tresc":" W języku HTML atrybut alt znacznika img jest wykorzystywany w celu zdefiniowania","odpowiedz":"tekstu, który będzie wyświetlony, jeśli nie może być wyświetlona grafika"},{"tresc":" Który język skryptowy ogólnego przeznaczenia należy wykorzystać do tworzenia aplikacji WWW, zagnieżdżanych w języku HTML i uruchamianych po stronie serwera?","odpowiedz":"PHP"},{"tresc":" Funkcja phpinfo() pozwala na:","odpowiedz":"uzyskanie informacji o środowisku pracy serwera obsługującego PHP"},{"tresc":" W języku CSS aby zdefiniować odmienne formatowanie dla pierwszej litery akapitu, należy zastosować selektor","odpowiedz":"pseudoelementu p::first-letter"},{"tresc":" Przedstawiony fragment kodu PHP ma za zadanie umieścić dane znajdujące się w zmiennych $a, $b, $c w bazie danych, w tabeli dane. Tabela dane zawiera cztery pola, z czego pierwsze to autoinkrementowany klucz główny. Które z poleceń powinno być przypisane do zmiennej $zapytanie?","odpowiedz":"INSERT INTO dane VALUES (NULL, '$a', '$b', '$c');"},{"tresc":" W załączonym fragmencie kodu CSS kolor jest zapisany w postaci","odpowiedz":"szesnastkowej"},{"tresc":" Wykonanie kodu JavaScript w przeglądarce wymaga","odpowiedz":"interpretowania"},{"tresc":" Którego typu danych w bazie MySQL należy użyć, aby przechować w jednym polu datę i czas?","odpowiedz":"TIMESTAMP"},{"tresc":" Częstotliwość próbkowania ma wpływ na","odpowiedz":"jakość cyfrowego dzwięku"},{"tresc":" W języku CSS, aby uzyskać efekt pochylenia tekstu, należy użyć właściwości","odpowiedz":"font-style"},{"tresc":" Tabela filmy zawiera klucz główny id oraz klucz obcy rezyserID. Tabela rezyserzy zawiera klucz główny id. Obydwie tabele połączone są relacją jeden po stronie rezyserzy do wielu po stronie filmy. Aby w kwerendzie SELECT połączyć tabele filmy i rezyserzy, należy zapisać","odpowiedz":"... filmy JOIN rezyserzy ON filmy.rezyserID = rezyserzy.id ..."},{"tresc":" Atrybutem określającym lokalizację pliku graficznego dla znacznika <img> jest","odpowiedz":"src"},{"tresc":" Debugger to program służący do","odpowiedz":"wyszukiwania błędów w kodzie programu"},{"tresc":" W językach programowania tylko zmienna jednego typu wbudowanego może przyjmować wyłącznie dwie wartości. Jest to typ","odpowiedz":"logiczny"},{"tresc":" Wskaż stwierdzenie, które jest prawdziwe dla następującej definicji stylu:","odpowiedz":"Zdefiniowano dwie klasy"},{"tresc":"Grafik chce przekształcić bez utraty jakości obraz JPG w format PNG w ten sposób, żeby wszędzie tam, gdzie w pierwotnym obrazie jest kolor biały, w obrazie docelowym była przezroczystość. Aby to zrobić, powinien","odpowiedz":"dodać kanał alfa"},{"tresc":"Przedstawione w języku CSS formatowanie czcionki będzie obowiązywać dla","odpowiedz":"całego kodu HTML, jako formatowanie domyślne dla wszystkich elementów strony."},{"tresc":"W języku JavaScript podany w ramce fragment funkcji ma za zadanie","odpowiedz":"policzyć sumę wszystkich elementów tablicy"},{"tresc":"Który z podanych formatów można zapisać materiał wideo wraz ze ścieżką dźwiękową?","odpowiedz":"MP4"},{"tresc":"Wykonując raport w systemie obsługi relacyjnych baz danych, umożliwia się","odpowiedz":"analizę wybranych danych"},{"tresc":"Aby zobaczyć wyniki działania skryptu napisanego w języku PHP, będącego elementem strony WWW, musi być on","odpowiedz":"zinterpretowany po stronie serwera"},{"tresc":"Ile iteracji będzie miała przedstawiona pętla zapisana w języku PHP, zakładając, że zmienna sterująca nie jest modyfikowana we wnętrzu pętli?","odpowiedz":"11"},{"tresc":" Aby w JavaScript wykonać wymienione kroki, należy w znaczniku <script> umieścić kod","odpowiedz":"A = prompt(\"Podaj kwalifikację: \"); document.write(\"Kwalifikacja: \" + A);"},{"tresc":" Klucz obcy w tabeli jest tworzony po to, aby","odpowiedz":"zdefiniować relację 1..n wiążącą go z kluczem głównym innej tabeli"},{"tresc":" Do uruchomienia systemu CMS Joomla! wymagane jest środowisko:","odpowiedz":"Apache, PHP i MySQL"},{"tresc":" Funkcja JavaScript powinna być wywołana za każdym razem, gdy użytkownik wpisze dowolny znak do pola edycji. Którego zdarzenia należy użyć?","odpowiedz":"onkeydown"},{"tresc":" Aby zapisać prostą animację na potrzeby strony internetowej, można skorzystać z formatu","odpowiedz":"GIF"},{"tresc":" W edytorze grafiki wektorowej stworzono przedstawiony kształt, który powstał z dwóch figur: trójkąta i koła. W celu stworzenia tego kształtu, po narysowaniu figur i odpowiednim ich ustawieniu, należy skorzystać z funkcji","odpowiedz":"sumy"},{"tresc":" Aby przy pomocy zapytania SQL zmodyfikować strukturę istniejącej tabeli, należy zastosować kwerendę","odpowiedz":"ALTER TABLE"},{"tresc":" Zdarzenie JavaScript, będące reakcją na pojedynczo kliknięty dowolny element strony, nosi nazwę","odpowiedz":"onClick"},{"tresc":" Instrukcja języka PHP tworząca obiekt pkt dla zdefiniowanej w ramce klasy Punkt ma postać","odpowiedz":"pkt = new Punkt();"},{"tresc":" Aby obsłużyć połączenie z bazą MySQL podczas tworzenia aplikacji internetowej, można wykorzystać język","odpowiedz":"PHP"},{"tresc":" Warunek zapisany językiem PHP wypisze liczbę, gdy","odpowiedz":"jest ona parzysta"},{"tresc":" W kodzie CSS zdefiniowano cztery klasy formatowania, których następnie użyto do formatowania paragrafów. Efekt widoczny na rysunku powstał po zastosowaniu klasy o nazwie","odpowiedz":"format2"},{"tresc":" W tabeli personel znajdują się pola: imie, nazwisko, pensja, staz. Aby otrzymać średnią pensję pracowników, dla których staż wynosi od 10 do 20 lat pracy włącznie, należy wykonać kwerendę:","odpowiedz":"SELECT AVG(pensja) FROM personel WHERE staz >= 10 AND staz <= 20;"},{"tresc":"Wskaż model barw, który stosuje się do wyświetlania kolorów na ekranie monitora komputerowego","odpowiedz":"RGB"},{"tresc":"W języku SQL aby zmodyfikować dane w tabeli, należy posłużyć się poleceniem","odpowiedz":"UPDATE"},{"tresc":"Wskaż kod CSS odpowiadający układowi bloków 2 - 5, zakładając, że są one zbudowane w oparciu o przedstawiony kod HTML.","odpowiedz":"B"},{"tresc":"Dana jest tabela zwierzeta z polami: nazwa, gatunek, gromada, cechy, dlugosc_zycia. Dla dowolnego zestawu danych, aby wyświetlić nazwy tych zwierząt, które żyją przynajmniej 20 lat oraz są ssakami, należy wydać zapytanie:","odpowiedz":"SELECT nazwa FROM zwierzeta WHERE dlugosc_zycia >=20 AND gromada = 'ssak';"},{"tresc":"Aby zbadać rozkład ilościowy poszczególnych kolorów zdjęcia, należy użyć","odpowiedz":"histogramu"},{"tresc":"Dla przedstawionego fragmentu kodu walidator HTML zwróci błąd, ponieważ","odpowiedz":"nie domknięto cudzysłowu"},{"tresc":" Do edycji grafiki wektorowej stosuje się program","odpowiedz":"Corel Draw"},{"tresc":" Który z wymienionych formatów plików NIE JEST wykorzystywany do publikacji grafiki lub animacji na stronach internetowych?","odpowiedz":"AIFF"},{"tresc":" Który typ należy zastosować, aby pole bazy danych przyjmowało liczby rzeczywiste?","odpowiedz":"FLOAT"},{"tresc":" Aby utworzyć relację jeden do wielu, w tabeli po stronie wiele, należy zdefiniować","odpowiedz":"klucz obcy wskazujący na klucz podstawowy tabeli po stronie jeden"},{"tresc":" Jakiego znacznika należy użyć, aby przejść do kolejnej linii tekstu, nie tworząc akapitu na stronie interenetowej ?","odpowiedz":"<br>"},{"tresc":" Jak nazywa się metoda sortowania polegająca na podziale na n przedziałów jednakowej długości, w których następuje sortowanie, po czym posortowane zawartości przedziałów są poddawane analizie i prezentacji?","odpowiedz":"Sortowanie kubełkowe."},{"tresc":" Dla każdej iteracji pętli wartość bieżącego elementu tablicy jest przypisywana do zmiennej, a wskaźnik tablicy jest przesuwany o jeden, aż do ostatniego elementu tablicy. Zdanie to jest prawdziwe dla instrukcji","odpowiedz":"foreach"},{"tresc":" Uprawnienia obiektowe, nadawane użytkownikom serwera bazy danych, mogą pozwalać lub zabraniać","odpowiedz":"wykonywać operacje na bazie, takie jak wstawanie lub modyfikowanie danych"},{"tresc":" W języku SQL, aby zabezpieczyć kwerendę CREATE USER tak, aby nie zostało utworzone konto w przypadku, gdy już istnieje, można posłużyć się składnią","odpowiedz":"CREATE USER IF NOT EXISTS 'anna'@'localhost' IDENTIFIED BY 'yu&T%';"},{"tresc":" Edytor spełniający założenia WYSIWYG musi umożliwiać","odpowiedz":"uzyskanie zbliżonego wyniku tworzonej strony do jej obrazu w przeglądarce internetowej"},{"tresc":" Jak nazywa się technika umożliwiająca otwarcie połączenia klienta z serwerem i komunikację bez przeładowywania całej strony WWW w sposób asynchroniczny ?","odpowiedz":"AJAX"},{"tresc":" Za pomocą którego zapytania Administrator odbierze prawo przeglądania oraz aktualizacji danych w bazie gazeta, dla użytkownika redaktor?","odpowiedz":"REVOKE SELECT, UPDATE ON gazeta.* FROM 'redaktor'@'localhost';"},{"tresc":" W części nagłówkowej kodu HTML zapisano tekst przedstawiony na obrazku. Zapisany tekst zostanie wyświetlony","odpowiedz":"na pasku tytułu przeglądarki"},{"tresc":" Za pomocą której metody obiektu location języka JavaScript można zastąpić bieżący dokument na dokument spod adresu wskazanego przez parametr metody?","odpowiedz":"replace();"},{"tresc":"Które polecenie służy do zmiany wartości o jeden w polu RokStudiów w tabeli Studenci dla studentów, którzy studiują na roku 1÷4?","odpowiedz":"UPDATE Studenci SET RokStudiow = RokStudiow+1 WHERE RokStudiow < 5;"},{"tresc":"W języku JavaScript instrukcję a++; można inaczej zapisać jako","odpowiedz":"a=a+1;"},{"tresc":"W przedstawionej definicji stylu CSS, powtarzanie dotyczy","odpowiedz":"rysunku umieszczonego w tle strony w pionie"},{"tresc":"Baza danych 6-letniej szkoły podstawowej zawiera tabelę szkola z polami: imie, nazwisko, klasa. Wszyscy uczniowie klas 1-5 zdali do następnej klasy. Aby zwiększyć wartość w polu klasa o 1 należy użyć polecenia","odpowiedz":"UPDATE szkola SET klasa=klasa+1 WHERE klasa>=1 AND klasa <=5;"},{"tresc":"Wskaż sposób, w jaki należy odwołać się do pliku default.css, jeśli index.html znajduje się bezpośrednio w katalogu Strona?","odpowiedz":"<link rel=\"stylesheet\" type=\"text/css\" href=\"./style/default.css\" />"},{"tresc":"W języku PHP w instrukcji switch musi występować","odpowiedz":"konstrukcja switch(wyrażenie)"},{"tresc":"Która cecha grafiki wektorowej jest prawdziwa?","odpowiedz":"Grafika wektorowa jest niezależna od rozdzielczości."},{"tresc":" Który odnośnik jest prawidłowo zdefiniowany?","odpowiedz":"<a href=\"http://strona.pl\">strona</a>"},{"tresc":" W przedstawionej klasie zdefiniowano","odpowiedz":"dwie właściwości."},{"tresc":" Polecenie pg_connect języka PHP służy do połączenia z bazą","odpowiedz":"PostgreSQL"},{"tresc":" Wciśnięcie przycisku o treści \"niebieski\" spowoduje wykonanie przedstawionego kodu JavaScript. Jaki będzie efekt jego działania?","odpowiedz":"Zmiana koloru tekstu \"Przykładowy tekst\" na niebieski"},{"tresc":" Do optymalnej realizacji algorytmu szukającego największej z trzech podanych liczb a, b i c, wystarczy zastosować","odpowiedz":"dwa warunki"},{"tresc":" W języku JavaScript zdefiniowana zmienna i, która ma przechowywać wynik dzielenia wynoszący 1, to","odpowiedz":"var i=parseInt(3/2);"},{"tresc":" Które z formatowań NIE JEST wyrażone w języku CSS?","odpowiedz":"C"},{"tresc":" W tabeli Recepta pola Imie i Nazwisko dotyczą pacjenta, na którego recepta jest wydana. Którą kwerendę należy zastosować, aby dla wszystkich recept uzyskać datę wystawienia recepty oraz imię i nazwisko lekarza wystawiającego?","odpowiedz":"SELECT Lekarz.Imie, Lekarz.Nazwisko, DataWystawienia FROM Recepta JOIN Lekarz ON Recepta.Lekarz_id = Lekarz.id;"},{"tresc":" Aby prawidłowo udokumentować linię kodu języka Java Script, należy po znakach // wpisać komentarz","odpowiedz":"w zmiennej x maksymalna wartość ze zmiennych a, b, c"},{"tresc":" Jak nazywa się element oznaczony znakiem zapytania w strukturze platformy .NET, który umożliwia tworzenie własnych aplikacji z użyciem frameworków i zamianę kompilowanego kodu pośredniego na kod maszynowy procesora zainstalowanego w komputerze?","odpowiedz":"Wspólne środowisko uruchomieniowe (CLR)"},{"tresc":" W języku HTML, aby uzyskać efekt jak na przykładzie, należy zastosować konstrukcję","odpowiedz":"<p><big>Duży tekst</big> zwykły tekst</p>"},{"tresc":" Kwerenda pozwalająca na wprowadzenie zmian w wielu rekordach lub przeniesienie wielu rekordów przy użyciu pojedynczej operacji, nosi nazwę kwerendy","odpowiedz":"funkcjonalnej"},{"tresc":" Aby ustawić czcionkę Verdana w kodzie CSS, należy wykorzystać właściwość","odpowiedz":"font-family: Verdana;"},{"tresc":"W instrukcji warunkowej języka JavaScript należy sprawdzić przypadek, gdy wartość zmiennej a jest z przedziału (0, 100), natomiast wartość zmiennej b jest większa od zera. Warunek taki jest prawidłowo zapisany w nastepujący sposób","odpowiedz":"if (a>0 && a<100 && b>0)"},{"tresc":"W języku CSS określono formatowanie znacznika h1 według wzoru. Zakładając, że żadne inne formatowanie nie jest dodane do znacznika h1, wskaż sposób formatowania tego znacznika","odpowiedz":"C"},{"tresc":"W języku JavaScript utworzono obiekt. Aby pobrać wartość własności w można zapisać","odpowiedz":"obiekt.w"},{"tresc":"Chcąc dodać do listy rozwijalnej przedstawionego formularza HTML możliwość zaznaczenia kilku opcji jednocześnie, należy w znaczniku select dodać atrybut","odpowiedz":"multiple"},{"tresc":"Które z wyrażeń logicznych zapisanych w języku C sprawdza, czy zmienna o nazwie zm1 należy do przedziału (6, 203> ?","odpowiedz":"(zm1 > 6) && (zm1 <= 203)"},{"tresc":"Tablica tab[] jest wypełniona dowolnymi liczbami całkowitymi. Jaka wartość znajdzie się w zmiennej zm2 po wykonaniu prezentowanego fragmentu kodu?","odpowiedz":"Średnia arytmetyczna liczb z tablicy"},{"tresc":"Aby uprościć wprowadzenie i edytowanie danych w tabeli, należy zdefiniować","odpowiedz":"formularz"},{"tresc":" Dana jest tabela programiści o polach: id, nick, ilosc_kodu, ocena. Pole ilosc_kodu zawiera liczbę linii kodu napisanych przez programistę w danym miesiącu. Aby policzyć sumę linii kodu, który napisali wszyscy programiści, należy użyć polecenia","odpowiedz":"SELECT SUM(ilosc_kodu) FROM programisci;"},{"tresc":" Rozwinięcie słowne akronimu ACID w SQL to","odpowiedz":"atomic, consistent, isolated, durable."},{"tresc":" W języku JavaScript, aby wydzielić fragment napisu znajdujący się pomiędzy wskazanymi przez parametr indeksami należy użyć metody","odpowiedz":"slice()"},{"tresc":" Jak posortowana będzie lista, utworzona ze wszystkich kolumn tabeli uczniowie i zawierająca uczniów ze średnią większą od 5, która zostanie zwrócona jako wynik przedstawionego zapytania?","odpowiedz":"Malejąco według parametru klasa"},{"tresc":" W skład typowego frameworka wchodzą","odpowiedz":"zarządzanie komunikacją z bazą danych, mechanizm uruchamiania i przetwarzania akcji"},{"tresc":" Która z przedstawionych funkcji języka PHP zamieni słowo \"kota\" na słowo \"mysz\" w napisie \"ala ma kota\"?","odpowiedz":"str_replace( \"kota\", \"mysz\", \"ala ma kota\");"},{"tresc":" Który kod języka HTML da efekt formatowania jak na przedstawionym rysunku?","odpowiedz":"<p>W tym <i>paragrafie <b>zobaczysz</b> sposoby formatowania</ i> tekstu w HTML</p>"},{"tresc":" Za pomocą której funkcji języka PHP można ustanowić połączenie z bazą danych o nazwie zwierzaki?","odpowiedz":"$polacz = mysqli_connect('localhost', 'root','','zwierzaki');"},{"tresc":" Znacznik języka HTML, który służy do dynamicznego tworzenia grafiki na stronie internetowej bez osadzania dodatkowych plików, to","odpowiedz":"<canvas>"},{"tresc":" W języku JavaScript instrukcję a++; można inaczej zapisać jako","odpowiedz":"a=a+1;"},{"tresc":" Którym słowem kluczowym, w języku z rodziny C należy posłużyć się, aby przypisać alternatywną nazwę dla istniejącego typu danych?","odpowiedz":"typedef"},{"tresc":" Który z obrazów został sformatowany za pomocą przedstawionego stylu CSS?","odpowiedz":"A"},{"tresc":" W programie INKSCAPE / COREL aby uzyskać przedstawiony efekt napisu, należy","odpowiedz":"skorzystać z funkcji wstaw / dopasuj tekst do ścieżki"},{"tresc":" Polecenie wysyłane do serwera bazy danych, polegające na zbieraniu, poszukiwaniu lub modyfikowaniu danych w bazie jest nazywane","odpowiedz":"kwerendą."},{"tresc":" Rozmycie Gaussa, wygładzanie, szum RGB są funkcjami programu do obróbki","odpowiedz":"Grafiki rastrowej"},{"tresc":"Kolorem o barwie niebieskiej jest kolor","odpowiedz":"#0000EE"},{"tresc":"Atrybutem określającym lokalizację pliku graficznego dla znacznika <img> jest","odpowiedz":"src"},{"tresc":"Polecenie SQL o treści: UPDATE artykuly SET cena = cena * 0.7 WHERE kod = 2; oznacza","odpowiedz":"w tabeli artykuly obniża wartość każdego pola cena dla którego pole kod jest równe 2"},{"tresc":"W aplikacji internetowej komunikat powinien pojawiać się tylko wtedy, gdy dany użytkownik jest na stronie po raz pierwszy. Którą funkcję PHP należy w tym celu zastosować?","odpowiedz":"setcookie"},{"tresc":"Przedstawiony fragment kodu PHP służy do obsługi","odpowiedz":"formularza."},{"tresc":"Prosta animacja może być zapisana w formacie","odpowiedz":"GIF"},{"tresc":"Znacznik <i> języka HTML służy do","odpowiedz":"zmiany kroju pisma na pochylony"},{"tresc":"Aby obraz umieszczony na stronie internetowej automatycznie skalował się do rozmiaru ekranu, na którym jest wyświetlana strona, należy","odpowiedz":"jego szerokość ustawić w wartościach procentowych"},{"tresc":"Który z komentarzy opisuje zadanie zdefiniowanej w języku PHP funkcji?","odpowiedz":"/* Funkcja zwraca wartość wyższą z dwóch podanych, gdy są równe zwraca wartość -1 */"},{"tresc":" W której części dokumentu HTML należy umieścić wewnętrzny arkusz stylów?","odpowiedz":"W części nagłówkowej strony."},{"tresc":" Wybierz poprawną definicję funkcji w języku JavaScript","odpowiedz":"function nazwa_funkcji(argumenty) {instrukcje;}"},{"tresc":" W podanej regule CSS: h1 {color: blue} h1 oznacza","odpowiedz":"selektor"},{"tresc":" Która z zasad tworzenia części <head> języka HTML jest poprawna?","odpowiedz":"W części <head> mogą wystąpić znaczniki <meta>, <title>, <link>"},{"tresc":" Automatyczna weryfikacja właściciela strony udostępnianej przez protokół HTTPS jest możliwa dzięki","odpowiedz":"certyfikatowi SSL"},{"tresc":" Interpreter PHP wygeneruje błąd i nie wykona kodu, jeżeli programista:","odpowiedz":"nie postawi średnika po wyrażeniu w instrukcji if, jeśli po nim nastąpiła sekcja else"},{"tresc":" W języku skryptowym JavaScript zmienne mogą być deklarowane","odpowiedz":"w momencie pierwszego użycia zmiennej"},{"tresc":" Język JavaScrypt ma obsługę","odpowiedz":"obiektów DOM"},{"tresc":" Które ze stwierdzeń prawidłowo charakteryzuje zdefiniowaną tabelę: CREATE TABLE dane (kolumna INTEGER(3));","odpowiedz":"Tabela o nazwie dane posiada jedną kolumnę liczb całkowitych"},{"tresc":" Za pomocą języka PHP nie jest możliwe","odpowiedz":"Zmienianie dynamiczne zawartości strony HTML w przeglądarce"},{"tresc":" Do uruchomienia skryptu JavaScript wymagane jest oprogramowanie","odpowiedz":"przeglądarki internetowej"},{"tresc":"Wskaż typ relacji pomiędzy tabelami: Tabela1 i Tabela3","odpowiedz":"Wiele do wielu"},{"tresc":"Do uruchomienia skryptu JavaScript wymagane jest oprogramowanie","odpowiedz":"przeglądarki internetowej"},{"tresc":"Wskaż wynik wykonania przedstawionego kodu PHP, jeżeli zmienna tab jest tablicą.","odpowiedz":"sarny dziki"},{"tresc":"Dana jest tabela uczniowie, do której wpisano rekordy jak na rysunku. Co będzie wynikiem działania przedstawionego zapytania SQL?","odpowiedz":"Wartość 3.5"},{"tresc":"Który znacznik należący do sekcji head dokumentu HTML w wersji 5 jest wymagany przez walidator języka HTML, a jego brak jest zgłaszany jako błąd (error)?","odpowiedz":"title"},{"tresc":"Baza danych zawiera tabelę faktury o polach: numer, data, id_klienta, wartość, status. Każdego dnia generowany jest raport faktur z bieżącego dnia. Wyświetlane są jedynie numery i wartości faktur. Która z kwerend SQL służy do stworzenia tego raportu?","odpowiedz":"SELECT numer, wartosc FROM faktury WHERE data=CURRENT_DATE();"},{"tresc":"Aby ustawić czcionkę Verdana w kodzie CSS, należy wykorzystać właściwość","odpowiedz":"font-family: Verdana;"},{"tresc":" W języku PHP zastosowano funkcję is_int(). Które z podanych wywołań tej funkcji zwróci wartość TRUE?","odpowiedz":"is_int(135)"},{"tresc":" W celu dodania rekordu do tabeli Pracownicy należy użyć polecenia SQL","odpowiedz":"INSERT INTO Pracownicy VALUES (\"Jan\", \"Kowalski\");"},{"tresc":" Która z instrukcji umożliwia wysłanie tekstu do przeglądarki?","odpowiedz":"echo"},{"tresc":" W bazie danych zdefiniowano tabelę Mieszkancy wypełnioną danymi. Aby usunąć tę tabelę wraz z zawartością, należy posłużyć się poleceniem","odpowiedz":"DROP TABLE Mieszkancy;"},{"tresc":" Który parametr obiektu graficznego ulegnie zmianie po modyfikacji wartości kanału alfa?","odpowiedz":"Przezroczystość"},{"tresc":" Instrukcja DROP języka SQL ma za zadanie","odpowiedz":"usunąć istniejący obiekt"},{"tresc":" Dana jest tabela mieszkania zawierająca kolumny o nazwach: adres, metraz, ile_pokoi, standard, status, cena. Wykonanie przedstawionej kwerendy SQL SELECT sprawi, że zostaną wyświetlone","odpowiedz":"Metraż oraz cena tych mieszkań, które mają więcej niż 3 pokoje"},{"tresc":" Ukrywanie pewnych pól lub metod obiektów danej klasy tak, aby były one dostępne tylko metodom wewnętrznym tej klasy lub funkcjom zaprzyjaźnionym, to","odpowiedz":"hermetyzacja"},{"tresc":" W języku CSS zapis selektora p > i { color: red; } oznacza, że kolorem czerwonym zostanie sformatowany","odpowiedz":"jedynie ten tekst w znaczniku <i>, który jest umieszczony bezpośrednio wewnątrz znacznika <p>"},{"tresc":" Obiekt typu array w języku Javascript służy do przechowywania","odpowiedz":"wielu wartości dowolnego typu"},{"tresc":"Program o nazwie FileZilla pozwala na","odpowiedz":"publikację strony internetowej na odległym serwerze."},{"tresc":"Witryna internetowa wysyła dane poufne za pomocą formularza do kodu PHP. Która metoda wysłania jest najbardziej bezpieczna?","odpowiedz":"Metoda POST, za pomocą protokołu HTTPS"},{"tresc":"Wskaż typ złożony.","odpowiedz":"class"},{"tresc":"Które wartości będą kolejno wypisane w wyniku działania przedstawionego skryptu","odpowiedz":"2 2 1"},{"tresc":"Aby zdefiniować w języku HTML listę nienumerowaną, należy użyć znacznika","odpowiedz":"<ul>"},{"tresc":"W języku SQL dla dowolnych zestawów danych w tabeli Uczniowie, aby wybrać rekordy, które zawierają wyłącznie uczennice o imieniu \"Aleksandra\", urodzone po roku \"1998\", należy zapisać zapytanie","odpowiedz":"SELECT * FROM Uczniowie WHERE imie=\"Aleksandra\" AND rok_urodzenia > \"1998\";"},{"tresc":"Jak nazywa się metoda dołączania arkusza stylów do dokumentu HTML użyta w przedstawionym kodzie?","odpowiedz":"Styl wpisany, lokalny"},{"tresc":"Jaką funkcję pełni kwerenda krzyżowa w bazie MS Access?","odpowiedz":"Prezentuje zliczone wartości z pola i przyporządkowuje je w wiersze i kolumny"},{"tresc":"Poniżej przedstawiono fragment kodu języka HTML. Jest on definicją listy:","odpowiedz":"C"},{"tresc":" W języku CSS, zapis w następującej postaci sprawi, iż koloru czerwonego będzie","odpowiedz":"pierwsza litera nagłówka pierwszego stopnia"},{"tresc":" W języku C++ funkcja zwracająca wynik potęgowania, działająca na dwóch parametrach wejściowych: liczbie x i wykładniku w, ma deklarację","odpowiedz":"int potega(int x, int w);"},{"tresc":" Aby przetestować poprawność działania kodu JavaScript należy użyć","odpowiedz":"konsoli w przeglądarce internetowej."},{"tresc":" Edytując grafikę w edytorze grafiki rastrowej należy pozbyć się kolorów z rysunku tak, aby obraz był w odcieniach szarości. Można do tego efektu wykorzystać funkcję","odpowiedz":"desaturacji"},{"tresc":" W programowaniu obiektowym mechanizm współdzielenia pól i metod klasy w taki sposób, że klasa pochodna zawiera metody zdefiniowane w klasie bazowej nazywa się","odpowiedz":"dziedziczeniem"},{"tresc":" Zdefiniowano bazę danych z tabelą mieszkancy o polach: nazwisko, imie, miasto. Następnie stworzono następujące zapytanie do bazy: SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Poznań\" UNION ALL SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Kraków\"; Wskaż zapytanie, które zwróci identyczne dane:","odpowiedz":"SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Poznań\" OR miasto=\"Kraków\";"},{"tresc":" Wskaż poprawną kolejność etapów projektowania relacyjnej bazy danych","odpowiedz":"Określenie zbioru danych, Selekcja, Określenie kluczy podstawowych tabel, Określenie relacji"},{"tresc":" W języku PHP w instrukcji switch musi występować","odpowiedz":"konstrukcja switch(wyrażenie)"},{"tresc":" Chcąc dodać do listy rozwijalnej przedstawionego formularza HTML możliwość zaznaczenia kilku opcji jednocześnie, należy w znaczniku select dodać atrybut","odpowiedz":"multiple"},{"tresc":" Z jakimi mechanizmami nadawania zabezpieczeń, dającymi możliwości wykonywania operacji na bazie danych, związane są zagadnienia zarządzania kontami, użytkownikami i uprawnieniami?","odpowiedz":"Z przywilejami systemowymi"},{"tresc":" Brak którego elementu języka HTML wygeneruje ostrzeżenie lub błąd walidatora HTML?","odpowiedz":"<title>"},{"tresc":" Aby wyświetlić rekordy z tabeli pracownicy tylko dla pracowników, którzy skończyli 26 lat należy użyć zapytania","odpowiedz":"SELECT * FROM pracownicy WHERE wiek > 25;"},{"tresc":" Zadaniem przedstawionej pętli jest","odpowiedz":"utworzenie dziesięciu obiektów typu Ksiazka."},{"tresc":" W języku SQL ustawienie klucza podstawowego na polu id w tabeli uczniowie możliwe jest za pomocą polecenia","odpowiedz":"ALTER TABLE uczniowie ADD PRIMARY KEY (id);"},{"tresc":" Które z pól są umieszczone w formularzu?","odpowiedz":"Input(Text), Select, Input(Radio), Input(Radio), Input(Submit), Input(Reset)"},{"tresc":" Kod języka CSS można umieścić wewnątrz kodu HTML, posługując się znacznikiem","odpowiedz":"<style>"},{"tresc":" Odwołaniem do imienia Agata, zawartym w przedstawionej tablicy JavaScript, jest element","odpowiedz":"Imiona[3];"},{"tresc":"W języku CSS zdefiniowano formatowanie dla stopki. Aby użyć tego formatowania dla bloku opisanego znacznikiem div, należy zapisać","odpowiedz":"<div id=\"stopka\">"},{"tresc":"W której technologii nie jest możliwe przetwarzanie danych użytkownika wprowadzanych na stronie WWW?","odpowiedz":"CSS"},{"tresc":"Który z odsyłaczy posiada poprawną konstrukcję?","odpowiedz":"<a href=\"mailto:adres\"> tekst </a>"},{"tresc":"Deklaracja typu dokumentu HTML: <!DOCTYPE HTML> oznacza, że kod jest napisany w wersji","odpowiedz":"5"},{"tresc":"Który rastrowy format graficzny jest obsługiwany przez przeglądarki internetowe?","odpowiedz":"PNG"},{"tresc":"Dana jest tablica n-elementowa o nazwie t[n]. Zadaniem algorytmu zapisanego w postaci listy kroków jest wypisania sumy","odpowiedz":"co drugiego elementu tablicy"},{"tresc":"Rozproszonym systemem kontroli wersji projektu programistycznego jest","odpowiedz":"GIT."},{"tresc":" W skrypcie JavaScript zastosowano metodę DOM getElementsByClassName('akapit'). Metoda ta odwoła się do akapitu","odpowiedz":"<p class=\"akapit\">akapit4</p>"},{"tresc":" W języku PHP operatorem reszty z dzielenia jest:","odpowiedz":"%"},{"tresc":" W programowaniu obiektowym w języku JavaScript użyty w przedstawionym kodzie zapis: this.zawod oznacza","odpowiedz":"metodę"},{"tresc":" Wskaż prawidłową kolejność tworzenia bazy danych","odpowiedz":"Określenie celu, stworzenie tabel, utworzenie relacji, normalizacja"},{"tresc":" W przedstawonym kodzie JavaScript dla ułatwienia ponumerowano linie. W kodzie znajduje się błąd, gdyż po uruchomieniu żaden komunikat nie zostaje wyświetlony. Aby wyeliminować błąd, należy","odpowiedz":"wstawić nawiasy klamrowe do sekcji if oraz else"},{"tresc":" Która z przedstawionych metod pozwoli wypisać w języku JavaScript komunikat w konsoli przeglądarki internetowej?","odpowiedz":"console.log(\"test\");"},{"tresc":" W formularzu dokumentu PHP istnieje pole <input name=\"im\" />. Po wprowadzeniu przez użytkownika ciągu znaków \"Janek\", w celu dodania zawartości pola do bazy danych, w tablicy $_POST zawarty jest element","odpowiedz":"Janek o indeksie im"},{"tresc":" Przedstawiony kod źródłowy ma za zadanie wyświetlić","odpowiedz":"losowe liczby od 0 do 100 tak długo, aż nie zostanie wylosowana wartość 0"},{"tresc":" Polecenie w języku SQL GRANT ALL PRIVILEGES ON klienci TO pracownik","odpowiedz":"nadaje wszystkie uprawnienia do tabeli klienci użytkownikowi pracownik"},{"tresc":" Funkcja agregująca AVG użyta w zapytaniu ma za zadanie","odpowiedz":"obliczyć średnią arytmetyczną cen wszystkich usług."},{"tresc":" Jakie uprawnienia będzie miał użytkownik jan po wykonaniu na bazie danych przedstawionych poleceń?","odpowiedz":"Będzie mógł zmienić strukturę tabeli klienci"},{"tresc":" Polecenie colspan służy do łączenia komórek tabeli w poziomie, natomiast rowspan w pionie. Którą z tabel wyświetli fragment kodu napisany w języku HTML?","odpowiedz":"B"},{"tresc":"Podczas walidacji dokumentu HTML5 pojawił się komunikat o treści: \"Error: Element head is missing a required instance of child element title\". Oznacza to, że w dokumencie","odpowiedz":"nie zdefiniowano elementu <title> w części <head> dokumentu."},{"tresc":"Która informacja dotycząca przedstawionego kodu jest prawdziwa?","odpowiedz":"Znak kropki \".\" jest operatorem konkatenacji."},{"tresc":"W relacyjnym modelu baz danych krotkami nazywa się","odpowiedz":"wiersze tabeli z wyjątkiem wiersza nagłówkowego, w którym umieszcza się nazwy kolumn"},{"tresc":"Który sposób komentowania w języku PHP pozwala na zapis bloku komentarza w kilku liniach?","odpowiedz":"/* */"},{"tresc":" Która cecha grafiki wektorowej jest prawdziwa?","odpowiedz":"Grafika wektorowa jest niezależna od rozdzielczości."},{"tresc":" Aby stworzyć tabelę w bazie danych, należy zastosować polecenie SQL","odpowiedz":"CREATE TABLE"},{"tresc":" Wskaż stwierdzenie, które nie jest prawdziwe dla następującej definicji funkcji w języku C++?","odpowiedz":"Funkcja zwraca wartość"},{"tresc":" Wskaż znacznik pozwalający na zapisanie tekstu nieprawidłowego lub nieodpowiedniego w sposób przekreślony.","odpowiedz":"<s> </s>"},{"tresc":" W instrukcji CREATE TABLE użycie klauzuli PRIMARY KEY przy deklaracji pola tabeli spowoduje, że pole to stanie się","odpowiedz":"kluczem podstawowym"},{"tresc":" W języku HTML, aby wstawić na stronę obraz zapisany w formacie JPG, należy zastosować znacznik","odpowiedz":"<img>"},{"tresc":" Komentarz w kodzie PHP można umieścić pomiędzy znakami","odpowiedz":"/* ... */"},{"tresc":" Fragment kodu SQL oznacza, że klucz obcy","odpowiedz":"łączy się z kolumną imiona."},{"tresc":" Wskaż poprawną definicję stylu CSS dla przycisku typu submit o właściwościach: czarny kolor tła, brak obramowania, marginesy wewnętrzne 5 px.","odpowiedz":"A"},{"tresc":" Przedstawiono fragment JavaScript. Po jego wykonaniu zmienna str2 będzie przechowywać","odpowiedz":"vaSc"},{"tresc":" Wykonując raport w systemie obsługi relacyjnych baz danych, umożliwia się","odpowiedz":"analizę wybranych danych"},{"tresc":" Ustalenie relacji pomiędzy tabelami w systemie bazodanowym MySQL umożliwia klauzula","odpowiedz":"REFERENCES"},{"tresc":" W języku SQL w wyniku wykonania zapytania ALTER TABLE osoba DROP COLUMN grupa; zostanie","odpowiedz":"usunięta kolumna grupa"},{"tresc":" W instrukcji warunkowej języka JavaScript należy sprawdzić przypadek, gdy wartość zmiennej a jest z przedziału (0, 100), natomiast wartość zmiennej b jest większa od zera. Warunek taki jest prawidłowo zapisany w nastepujący sposób","odpowiedz":"if (a>0 && a<100 && b>0)"},{"tresc":" Zamieszczony kod HTML formularza zostanie wyświetlony przez przeglądarkę w sposób:","odpowiedz":"D"},{"tresc":"W języku JavaScript metoda document.getElementById(id) ma za zadanie","odpowiedz":"zwrócić odniesienie do pierwszego elementu HTML o podanym id"},{"tresc":"Który z wymienionych znaczników języka HTML nie jest stosowany w celu formatowania tekstu?","odpowiedz":"<div>"},{"tresc":"Aby odebrać prawa dostępu do serwera MySQL, należy posłużyć się instrukcją","odpowiedz":"REVOKE"},{"tresc":"Tekst paragrafu, wyśrodkowany w pionie, opisuje w CSS reguła","odpowiedz":"vertical-align: middle"},{"tresc":"Deklaracja w języku JavaScript: var x=true; powoduje, że zmienna x jest typu","odpowiedz":"logicznego"},{"tresc":" Które stwierdzenie najlepiej opisuje klasę Owoc zdefiniowaną w języku PHP i przedstawioną na listingu?","odpowiedz":"Ma dwa pola i jedną metodę, pole kolor ma zakres widzialności ograniczony tylko do metod klasy."},{"tresc":" Testy wydajnościowe mają na celu sprawdzenie","odpowiedz":"stopnia spełnienia wymagań wydajnościowych przez system lub moduł"},{"tresc":" Który z wymienionych systemów nie jest systemem CMS?","odpowiedz":"Adobe Flash"},{"tresc":" Jednym z wariantów testów jednostkowych jest analiza ścieżek, która polega na","odpowiedz":"określeniu punktu początkowego i końcowego oraz badaniu możliwych dróg pomiędzy tymi punktami."},{"tresc":" Kolor zapisany kodem RGB o wartości rgb(128, 16, 8) w postaci szesnastkowej ma wartość","odpowiedz":"#801008"},{"tresc":" Polecenie języka SQL w postaci","odpowiedz":"dodaje do tabeli kolumnę o nazwie kod typu text"},{"tresc":" Który z formatów zapewnia największa redukcję rozmiaru pliku dźwiękowego?","odpowiedz":"MP3"},{"tresc":" Grafik wykonał logo strony internetowej. To czarny znaczek na przezroczystym tle. Aby zachować wszystkie atrybuty obrazu i umieścić go na stronie internetowej, grafik powinien zapisać obraz w formacie","odpowiedz":"PNG"},{"tresc":" Obiekt bazy danych, którego głównym przeznaczeniem jest drukowanie lub wyświetlanie zestawień danych, to","odpowiedz":"raport."},{"tresc":" Debugger to oprogramowanie, którego zadaniem jest","odpowiedz":"dynamiczna analiza uruchomionego programu w celu wykrycia przyczyn nieprawidłowego działania."},{"tresc":" Polecenie REVOKE SELECT ON nazwa1 FROM nazwa2 w języku SQL umożliwia","odpowiedz":"odbieranie uprawnień użytkownikowi"},{"tresc":" Formatowanie CSS akapitu określa styl szarej ramki o cechach:","odpowiedz":"linia kropkowa; grubość 2 px; marginesy pomiędzy tekstem a ramką 15 px."},{"tresc":" Poniżej została przedstawiona obsługa","odpowiedz":"ciasteczek"},{"tresc":" Przedstawiona instrukcja JavaScript wyświetli","odpowiedz":"false"},{"tresc":" Program FileZilla może posłużyć do","odpowiedz":"publikacji strony internetowej"},{"tresc":" W języku CSS poniższy zapis użyty na stronie, na której jest kilka paragrafów, a każdy z nich ma po kilka linii sprawi, że","odpowiedz":"pierwsza linia każdego paragrafu będzie miała większą czcionkę niż następne linie"},{"tresc":" W bazie danych sklepu istnieją dwie tabele powiązane relacją: produkty oraz oceny. Tabela oceny zawiera dowolną liczbę ocen klientów dla danego produktu opisaną polami: id, ocena (pole numeryczne), produktID (klucz obcy). Aby wskazać maksymalną ocenę dla produktu o ID równym 10, należy posłużyć się zapytaniem","odpowiedz":"SELECT MAX(ocena) FROM oceny WHERE produktID = 10;"},{"tresc":" Wskaż pętlę, która w języku JavaScript wyświetli sześć kolejnych liczb parzystych","odpowiedz":"for(i=2;i<=12;i+=2) {document.write(i);}"},{"tresc":" Za pomocą przedstawionego zapytania w tabeli zostanie","odpowiedz":"dodana kolumna nazwa2 typu zmiennoprzecinkowego"},{"tresc":" Formatami Video obsługiwanymi w standardzie HTML5 są","odpowiedz":"MP4, Ogg, WebM"},{"tresc":"Która z operacji NIE WPŁYNIE na rozmiar / wielkość zajmowanej pamięci pliku graficznego?","odpowiedz":"Skalowanie obrazu za pomocą atrybutów HTML"},{"tresc":"W skrypcie JavaScript zastosowano metodę DOM getElementsByClassName('akapit'). Metoda ta odwoła się do akapitu","odpowiedz":"<p class=\"akapit\">akapit4</p>"},{"tresc":"Głównym celem stosowania edytora WYSIWYG jest","odpowiedz":"szybka wizualizacja tworzonej strony."},{"tresc":"Wskaż rezultat działania fragmentu kodu JavaScript","odpowiedz":"Dodanie akapitu na koniec strony"},{"tresc":"Wskaż poprawny składniowo warunek zapisany w języku PHP i sprawdzający brak połączenia z bazą MySQL.","odpowiedz":"if (mysqli_connect_errno()){}"},{"tresc":"Aby dopasować dźwięk do danego poziomu głośności, należy użyć efektu","odpowiedz":"normalizacji"},{"tresc":"Aby zapisać prostą animację na potrzeby strony internetowej, można skorzystać z formatu","odpowiedz":"GIF"},{"tresc":" Bitmapa jest obrazem","odpowiedz":"rastrowym"},{"tresc":" Saturacja koloru nazywana jest inaczej","odpowiedz":"nasyceniem koloru"},{"tresc":" Jaką wartość przyjmie zmienna x po wykonaniu kodu PHP przedstawionego w ramce?","odpowiedz":"Liczby wierszy przetworzonych zapytaniem DELETE FROM"},{"tresc":" W standardzie HDTV jest stosowana rozdzielczość","odpowiedz":"1920 x 1080 px"},{"tresc":" W bazie danych sklepu istnieje tabela artykuly zawierająca pole o nazwie nowy. Aby to pole wypełnić wartościami TRUE dla każdego rekordu, należy zastosować kwerendę","odpowiedz":"UPDATE artykuly SET nowy=TRUE;"},{"tresc":" Który z formatów grafiki jest najbardziej odpowiedni do zapisu obrazu z przezroczystością na potrzeby strony internetowej?","odpowiedz":"PNG"},{"tresc":" Dla przedstawionego fragmentu dokumentu HTML zdefiniowano formatowanie CSS selektora klasy \"menu\" tak, aby kolor tła bloku był zielony. Która definicja stylu CSS odpowiada temu formatowaniu?","odpowiedz":"div.menu { background-color: green; }"},{"tresc":" Której funkcji edytora grafiki rastrowej należy użyć, aby przygotować rysunek do wyświetlenia na stronie w ten sposób, żeby było widoczne tylko to, co znajduje się w ramce?","odpowiedz":"Kadrowanie"},{"tresc":" W grafice komputerowej pojęcie kanału alfa jest związane z","odpowiedz":"przezroczystością."},{"tresc":" W którym z bloków należy umieścić warunek pętli?","odpowiedz":"C"},{"tresc":" W języku CSS zdefiniowano następujące formatowanie. Oznacza to, że kolorem niebieskim zostanie zapisany","odpowiedz":"pochylony tekst paragrafu"},{"tresc":"W języku CSS zapis selektora p > i { color: red; } oznacza, że kolorem czerwonym zostanie sformatowany","odpowiedz":"jedynie ten tekst w znaczniku <i>, który jest umieszczony bezpośrednio wewnątrz znacznika <p>"},{"tresc":"Który typ języka PHP umożliwia przechowywanie wielu wartości z możliwością ich indeksowania?","odpowiedz":"array"},{"tresc":"Językami programowania działającymi po stronie serwera są:","odpowiedz":"Java, C#, Python, Ruby, PHP"},{"tresc":"Selektor klasy w kaskadowych arkuszach stylów należy zdefiniować za pomocą symbolu","odpowiedz":". (kropka)"},{"tresc":"Polecenie języka SQL w postaci","odpowiedz":"dodaje do tabeli kolumnę o nazwie kod typu text"},{"tresc":"Zamieszczony w ramce kod wyświetla tabelę składajacą się z","odpowiedz":"jednego wiersza i dwóch kolumn"},{"tresc":"Jednym z wariantów testów jednostkowych jest analiza ścieżek, która polega na","odpowiedz":"określeniu punktu początkowego i końcowego oraz badaniu możliwych dróg pomiędzy tymi punktami."},{"tresc":" Jak nazywa się edytor wspomagający tworzenie stron internetowych, którego sposób działania można w polskim tłumaczeniu określić jako: otrzymujesz to, co widzisz?","odpowiedz":"WYSIWYG"},{"tresc":" Formatem o najwyższej rozpiętości tonalnej wśród wymienionych jest","odpowiedz":"RAW"},{"tresc":" Aby w wyniku zapytania wyeliminować powtarzające się wiersze, należy użyć klauzuli","odpowiedz":"DISTINCT"},{"tresc":" Dana jest tabela pracownicy o polach id, nazwisko, imie, wynagrodzenie. Kolumnę wynagrodzenie można usunąć za pomocą instrukcji","odpowiedz":"ALTER TABLE pracownicy DROP COLUMN wynagrodzenie;"},{"tresc":" Wskaż nazwę Systemu Zarządzania Treścią, którego logo zostało przedstawione na rysunku.","odpowiedz":"Joomla!"},{"tresc":" Logo systemu CMS o nazwie Joomla! to","odpowiedz":"B"},{"tresc":" Parametr face znacznika <font> służy do określenia","odpowiedz":"nazwy czcionki"},{"tresc":" Które polecenie służy do zmiany wartości o jeden w polu RokStudiów w tabeli Studenci dla studentów, którzy studiują na roku 1÷4?","odpowiedz":"UPDATE Studenci SET RokStudiow = RokStudiow+1 WHERE RokStudiow < 5;"},{"tresc":" Przedstawiono tabelę zdefiniowaną kodem HTML, bez formatowania CSS. Który z fragmentów kodu HTML odpowiada pierwszemu wierszowi tabeli?","odpowiedz":"D"},{"tresc":" W bazie danych sklepu komputerowego istnieje tabela komputery. Aby zdefiniować raport wyświetlający dla dowolnego zbioru danych tabeli, jedynie pola tabeli dla komputerów, w których jest nie mniej niż 8 GB pamięci, a procesor to Intel, można posłużyć sie kwerendą","odpowiedz":"SELECT * FROM komputery WHERE procesor = \"Intel\" AND pamiec >= 8;"},{"tresc":"Jakiego typu specjalizowane oprogramowanie narzędziowe należy zainstalować, aby umożliwić wykonywanie jego użytkownikowi operacji na zgromadzonych danych?","odpowiedz":"System Zarządzania Bazą Danych (SZBD)"},{"tresc":"Za pomocą której metody obiektu location języka JavaScript można zastąpić bieżący dokument na dokument spod adresu wskazanego przez parametr metody?","odpowiedz":"replace();"},{"tresc":"Polecenie colspan służy do łączenia komórek tabeli w poziomie, natomiast rowspan w pionie. Którą z tabel wyświetli fragment kodu napisany w języku HTML?","odpowiedz":"B"},{"tresc":"Jaki program komputerowy przekształca kod źródłowy, napisany w konkretnym języku programowania, na język komputera?","odpowiedz":"Kompilator"},{"tresc":"Wskaż wynik wykonania skryptu PHP.","odpowiedz":"zielony, niebieski, czarny, biały,"},{"tresc":"W języku PHP chcąc wyświetlić ciąg n znaków @, należy użyć funkcji","odpowiedz":"D"},{"tresc":" Wynikiem działania przedstawionego fragmentu programu JavaScript jest wartość zmiennej w równa","odpowiedz":"sumie naturalnych liczb parzystych mniejszych od 50."},{"tresc":" W kodzie HTML zapisano w bloku tekst formatowany pewnym stylem. Aby wtrącić wewnątrz tekstu kilka słów formatowanych innym stylem, należy zastosować znacznik","odpowiedz":"<span>"},{"tresc":" O przedstawionym obiekcie języka JavaScript można powiedzieć, że ma","odpowiedz":"dwie właściwości i jedną metodę"},{"tresc":" W języku CSS, aby sformatować dowolny element języka HTML w ten sposób, że po najechaniu na niego kursorem zmienia on kolor czcionki, należy zastosować pseudoklasę","odpowiedz":":hover"},{"tresc":" Typ zmiennej w języku JavaScript","odpowiedz":"następuje poprzez przypisanie wartości"},{"tresc":" W celu zapewnienia spójności danych w bazie programu Microsoft Access należy skorzystać","odpowiedz":"z więzów integralności"},{"tresc":" Fragment kodu w języku JavaScript realizujący dodawanie dwóch liczb ma następującą postać. Aby dodawanie wykonane było po kliknięciu przycisku o nazwie dodaj, należy w wykropkowane miejsce wstawić","odpowiedz":"<button onclick=\"return dodaj()\">dodaj</button>"},{"tresc":" Aby uzyskać informacje o środowisku pracy serwera obsługującego PHP, należy skorzystać z funkcji","odpowiedz":"phpinfo()"},{"tresc":" Wskaż zapytanie, w którym dane zostały posortowane.","odpowiedz":"SELECT imie, nazwisko FROM mieszkancy WHERE wiek > 18 ORDER BY wiek;"},{"tresc":" Dołączenie zewnętrznego arkusza stylów do kodu HTML jest realizowane przy użyciu znacznika","odpowiedz":"<link>"},{"tresc":" Które ze zdań opisuje grafikę wektorową?","odpowiedz":"Zapisywany obraz jest opisywany za pośrednictwem figur geometrycznych umieszczonych w układzie współrzędnych"},{"tresc":" Sposób programowania, w którym ciąg poleceń (sekwencji instrukcji) przekazywanych komputerowi jest postrzegany jako program, nosi nazwę programowania","odpowiedz":"imperatywnego"},{"tresc":" Aby przesłać dane za pomocą funkcji mysqli_query() w skrypcie PHP, który wstawia do bazy danych dane pobrane z formularza ze strony internetowej, jako jednego z parametrów należy użyć kwerendy","odpowiedz":"INSERT INTO"},{"tresc":"Który modyfikator wskazuje podany opis?","odpowiedz":"private"},{"tresc":"Który ze sposobów wypisania tekstu nie jest zdefiniowany w języku JavaScript?","odpowiedz":"Funkcja MessageBox()"},{"tresc":"Jakie sa nazwy typowych poleceń języka zapytań SQL, związane z wykonywaniem operacji na danych SQL DML (np.: umieszczanie danych w bazie, kasowanie dokonywanie zmian w danych)?","odpowiedz":"DELETE, INSERT, UPDATE"},{"tresc":"Aby witryna internetowa prawidłowo skalowała się w urządzeniach mobilnych, należy wielkość czcionki zdefiniować","odpowiedz":"w procentach"},{"tresc":"W programie INKSCAPE / COREL aby uzyskać przedstawiony efekt napisu, należy","odpowiedz":"skorzystać z funkcji wstaw / dopasuj tekst do ścieżki"},{"tresc":" Wynikiem działania zamieszczonej pętli zapisanej językiem PHP jest wypisanie kolejnych liczb","odpowiedz":"od 10 do 1"},{"tresc":" W bazach danych do prezentacji danych spełniających określone warunki nalezy utworzyć","odpowiedz":"raport."},{"tresc":" Którą czynność należy wykonać podczas obróbki zdjęcia w edytorze grafiki, aby białe tło zamienić na przezroczystość?","odpowiedz":"Dodać kanał alfa."},{"tresc":" Wskaż polecenie SQL dodające pole miesiacSiewu do istniejącej tabeli rosliny","odpowiedz":"ALTER TABLE rosliny ADD miesiacSiewu int"},{"tresc":" Przedstawiony blok reprezentuje czynność","odpowiedz":"podjęcia decyzji"},{"tresc":" Polecenie SQL o treści: UPDATE artykuly SET cena = cena * 0.7 WHERE kod = 2; oznacza","odpowiedz":"w tabeli artykuly obniża wartość każdego pola cena dla którego pole kod jest równe 2"},{"tresc":" Weryfikację kompletności formularza, działającą po stronie przeglądarki, należy zrealizować w języku","odpowiedz":"JavaScript"},{"tresc":" Który z formatów graficznych pozwala na zapis przejrzystego tła?","odpowiedz":"GIF"},{"tresc":" Którego polecenia należy użyć, aby wyraz TEKST został wyświetlony w kolorze czarnym w oknie przeglądarki internetowej?","odpowiedz":"<font color=\"#000000\">TEKST</font>"},{"tresc":" Dana jest tabela o nazwie przedmioty z polami: ocena i uczenID. Aby policzyć średnią ocen ucznia o ID równym 7, należy posłużyć się zapytaniem","odpowiedz":"SELECT AVG(ocena) FROM przedmioty WHERE uczenID = 7;"},{"tresc":" Połączenie dwóch barw leżących po przeciwnych stronach w kole barw jest połączeniem","odpowiedz":"dopełniającym"},{"tresc":" Transformację w stylach CSS, polegającą na zamianie tylko pierwszych liter wszystkich wyrazów na wielkie, otrzymamy stosując polecenie","odpowiedz":"capitalize"},{"tresc":"Odwoływanie funkcji do samej siebie to","odpowiedz":"rekurencja"},{"tresc":"W bazie danych sklepu komputerowego istnieje tabela komputery. Aby zdefiniować raport wyświetlający dla dowolnego zbioru danych tabeli, jedynie pola tabeli dla komputerów, w których jest nie mniej niż 8 GB pamięci, a procesor to Intel, można posłużyć sie kwerendą","odpowiedz":"SELECT * FROM komputery WHERE procesor = \"Intel\" AND pamiec >= 8;"},{"tresc":"Aby prawidłowo udokumentować przedstawioną linię kodu języka JavaScript, należy po znakach // wpisać komentarz","odpowiedz":"wyświetlenie daty i czasu w znaczniku o id = napis"},{"tresc":"Zdefiniowanie klucza obcego jest niezbędne do utworzenia","odpowiedz":"relacji 1..n"},{"tresc":"Przedstawiona linia kodu została zapisana w języku","odpowiedz":"JavaScript"},{"tresc":"O przedstawionym obiekcie języka JavaScript można powiedzieć, że ma","odpowiedz":"dwie właściwości i jedną metodę"},{"tresc":"Wskaż definicję metody, którą należy wstawić w miejscu kropek, aby na stronie WWW wyświetlił się tekst: Jan Kowalski","odpowiedz":"A"},{"tresc":"Aby zdefiniować krój czcionki w stylu CSS, należy użyć właściwości","odpowiedz":"font-family"},{"tresc":" Program zapisany w języku PHP ma za zadanie obliczyć średnią pozytywnych ocen ucznia od 2 do 6. Warunek wybierania ocen w pętli liczącej średnią powinien zawierać wyrażenie logiczne","odpowiedz":"$ocena >= 2 and $ocena <= 6"},{"tresc":" W wyniku połączenia relacją kluczy głównych dwóch tabel otrzymuje się relację typu","odpowiedz":"jeden do jednego"},{"tresc":" Funkcja CONCAT() w języku SQL odpowiada za","odpowiedz":"łączenie wyświetlanego tekstu"},{"tresc":" Jakiego typu specjalizowane oprogramowanie narzędziowe należy zainstalować, aby umożliwić wykonywanie jego użytkownikowi operacji na zgromadzonych danych?","odpowiedz":"System Zarządzania Bazą Danych (SZBD)"},{"tresc":" W języku PHP instrukcja foreach jest instrukcją","odpowiedz":"Pętli, wyłącznie dla elementów tablicy"},{"tresc":" W ramce przedstawiono właściwości pliku graficznego. W celu optymalizacji czasu ładowania rysunku na stronę WWW należy","odpowiedz":"zmniejszyć wymiary rysunku"},{"tresc":" W palecie kolorów RGB kolor żółty jest połączeniem dwóch kolorów: zielonego i czerwonego. Który z kodów szesnastkowych oznacza kolor żółty?","odpowiedz":"#FFFF00"},{"tresc":" W języku JavaScript zapisano fragment kodu. Po wykonaniu skryptu zmienna x","odpowiedz":"Będzie równa 11 i zostanie wypisana w konsoli przeglądarki internetowej"},{"tresc":"W kodzie CSS zdefiniowano cztery klasy formatowania, których następnie użyto do formatowania paragrafów. Efekt widoczny na rysunku powstał po zastosowaniu klasy o nazwie","odpowiedz":"format2"},{"tresc":"Proces tłumaczenia kodu źródłowego pisanego przez programistę na zrozumiały dla komputera kod maszynowy to","odpowiedz":"kompilowanie"},{"tresc":"Co spowoduje fragment skryptu w języku JavaScript?","odpowiedz":"Przypisze zmiennej s wartość odpowiadającą długości napisu ze zmiennej n"},{"tresc":"Integralność encji w bazie danych zostanie zachowana, jeżeli między innymi","odpowiedz":"dla każdej tabeli zostanie utworzony klucz główny."},{"tresc":"Które z pól są umieszczone w formularzu?","odpowiedz":"Input(Text), Select, Input(Radio), Input(Radio), Input(Submit), Input(Reset)"},{"tresc":"W języku PHP przekierowanie użytkownika na inną stronę WWW jest możliwe za pomocą funkcji","odpowiedz":"header();"},{"tresc":"Klucz obcy w tabeli jest tworzony po to, aby","odpowiedz":"zdefiniować relację 1..n wiążącą go z kluczem głównym innej tabeli"},{"tresc":"W celu dodania rekordu do tabeli Pracownicy należy użyć polecenia SQL","odpowiedz":"INSERT INTO Pracownicy VALUES (\"Jan\", \"Kowalski\");"},{"tresc":" Poprawny zapis znacznika <img>, za pomocą którego można umieścić na stronie internetowej obraz rys.jpg przeskalowany do szerokości 120 px i wysokości 80 px z tekstem alternatywnym \"krajobraz\" to","odpowiedz":"<img src=\"rys.jpg\" width=\"120px\" height=\"80px\" alt=\"krajobraz\"/>"},{"tresc":" Poprawne udokumentowanie wzorca weryfikacji pola nazwa w części kodu aplikacji JavaScript to","odpowiedz":"/* Pole nazwa może zawierać dowolny ciąg cyfr (z wyłączeniem 0), następnie musi zawierać dużą literę i ciąg minimum dwóch małych liter. */"},{"tresc":" Formularze do obsługi baz danych tworzy się w celu","odpowiedz":"wygodniejszego wprowadzania, edytowania i usuwania danych"},{"tresc":" Wskaż poprawny składniowo warunek zapisany w języku PHP i sprawdzający brak połączenia z bazą MySQL.","odpowiedz":"if (mysqli_connect_errno()){}"},{"tresc":" Którą wartość będzie przechowywała zmienna a po wykonaniu przedstawionej sekwencji instrukcji języka PHP?","odpowiedz":"11"},{"tresc":" Aby usunąć wszystkie rekordy z tabeli należy zastosować kwerendę","odpowiedz":"TRUNCATE TABLE"},{"tresc":" Przedstawiona w języku C++ definicja typu wyliczeniowego sprawi, że enumerator CZWARTEK będzie równy","odpowiedz":"liczbie 4"},{"tresc":" Który selektor formatuje akapity tekstu o klasie tekst oraz element blokowy o ID obrazki?","odpowiedz":"p.tekst, div#obrazki"},{"tresc":"Do którego pola klasy Dane możliwy będzie dostęp z zewnątrz poprzez nazwę obiektu utworzonego jako instancja tej klasy?","odpowiedz":"Do pola $a."},{"tresc":"Transformację w stylach CSS, polegającą na zamianie tylko pierwszych liter wszystkich wyrazów na wielkie, otrzymamy stosując polecenie","odpowiedz":"capitalize"},{"tresc":"Który z wymienionych systemów nie jest systemem CMS?","odpowiedz":"Adobe Flash"},{"tresc":"Obiekt bazy danych, którego głównym przeznaczeniem jest drukowanie lub wyświetlanie zestawień danych, to","odpowiedz":"raport."},{"tresc":"Wskaż polecenie SQL dodające pole miesiacSiewu do istniejącej tabeli rosliny","odpowiedz":"ALTER TABLE rosliny ADD miesiacSiewu int"},{"tresc":"Do edycji grafiki wektorowej stosuje się program","odpowiedz":"Corel Draw"},{"tresc":" W formularzu dane z pola input o typie number zostały zapisane do zmiennej a, a następnie przetworzone w skrypcie JavaScript w następujący sposób. Zmienna z będzie typu","odpowiedz":"zmiennoprzecinkowego"},{"tresc":" Wskaż prawidłową kolejność tworzenia aplikacji","odpowiedz":"Analiza wymagań klienta, specyfikacja wymagań tworzenie, testy, wdrażanie"},{"tresc":" Który zapis w języku HTML jest deklaracją kodowania znaków w dokumencie?","odpowiedz":"<meta charset=\"UTF-8\">"},{"tresc":" Podane polecenie SQL ma za zadanie","odpowiedz":"zwiększyć o jeden wartość kolumny id_klasy dla wszystkich rekordów tabeli Uczen"},{"tresc":" Włączenie do kodu skryptu zawartości pliku egzamin.php, zawierającego kod PHP, wymaga dodania instrukcji","odpowiedz":"include(\"egzamin.php\");"},{"tresc":" Na stronie internetowej znajduje się formularz, do którego należy zaprogramować następujące funkcje: walidacja: w trakcie wypełniania formularza w czasie rzeczywistym jest sprawdzana poprawność danych przesyłanie danych: po wypełnieniu formularza i jego zatwierdzeniu dane są przesyłane do bazy danych na serwerze Aby zaimplementować tę funkcjonalność w możliwie najprostszy sposób, należy zapisać","odpowiedz":"walidację w języku JavaScript, a przesyłanie danych w skrypcie PHP."},{"tresc":" Na rysunku przedstawiono strukturę bloków strony internetowej. Który z fragmentów formatowania strony pasuje do takiego układu? (Dla uproszczenia pominięto właściwości koloru tła, wysokości i czcionki)","odpowiedz":"#pierwszy {float:left; width:30%;} #drugi {float:left; width:70%;} #trzeci {float:left; width:70%;} #czwarty {clear:both; }"},{"tresc":" Aby za pomocą polecenia SELECT wyświetlić nazwiska osób mieszkających na osiedlu tak, aby te nazwiska nie powtarzały się, należy zapisać zapytanie w postaci","odpowiedz":"SELECT DISTINCT nazwisko FROM mieszkancy;"},{"tresc":" Baza danych zawiera tabelę faktury o polach: numer, data, id_klienta, wartość, status. Każdego dnia generowany jest raport faktur z bieżącego dnia. Wyświetlane są jedynie numery i wartości faktur. Która z kwerend SQL służy do stworzenia tego raportu?","odpowiedz":"SELECT numer, wartosc FROM faktury WHERE data=CURRENT_DATE();"},{"tresc":"Którego polecenia należy użyć, aby wyraz TEKST został wyświetlony w kolorze czarnym w oknie przeglądarki internetowej?","odpowiedz":"<font color=\"#000000\">TEKST</font>"},{"tresc":"W języku CSS wartości underline, overline, blink przyjmują atrybut","odpowiedz":"text-decoration"},{"tresc":"Które zdarzenie pozwala wykonać kod w języku JavaScript w chwili wysyłania formularza HTML i zablokować lub pozwolić na jego wysłanie?","odpowiedz":"onSubmit"},{"tresc":"W celu zmodyfikowania tekstu \"ala ma psa\" na \"ALA MA PSA\" należy użyć funkcji PHP","odpowiedz":"strtoupper(\"ala ma psa\");"},{"tresc":"Który znacznik HTML jest elementem blokowym?","odpowiedz":"p"},{"tresc":"Metoda udostępniania bazy danych w programie Microsoft Access, dotycząca wszystkich obiektów bazy umieszczonych na dysku sieciowym i używanych jednocześnie przez różne osoby nosi nazwę","odpowiedz":"folderu sieciowego"},{"tresc":" W języku HTML, aby utworzyć pole edycyjne do wpisywania hasła, w którym wpisywany tekst jest maskowany (zastępowany kropkami), należy użyć znacznika","odpowiedz":"<input type=\"password\" />"},{"tresc":" W relacyjnym modelu baz danych krotkami nazywa się","odpowiedz":"wiersze tabeli z wyjątkiem wiersza nagłówkowego, w którym umieszcza się nazwy kolumn"},{"tresc":" Podaj wynik działania programu zapisanego w języku JavaScript, znajdującego się w ramce, po podaniu na wejściu wartości 5","odpowiedz":"120"},{"tresc":" Do którego pola klasy Dane możliwy będzie dostęp z zewnątrz poprzez nazwę obiektu utworzonego jako instancja tej klasy?","odpowiedz":"Do pola $a."},{"tresc":" Którym poleceniem można wyświetlić konfigurację serwera PHP, w tym informację m.in. o: wersji PHP, systemie operacyjnym serwera, wartości przedefiniowanych zmiennych?","odpowiedz":"phpinfo();"},{"tresc":" Przedstawiona funkcja zapisana w języku JavaScript ma za zadanie","odpowiedz":"zwrócić wartość bezwzględną z f"},{"tresc":" Kolumna pełniąca rolę klucza głównego w tabeli musi","odpowiedz":"zawierać unikalne wartości."},{"tresc":" W języku HTML zdefiniowano listę, która","odpowiedz":"jest numerowana z zagłębioną listą punktowaną"},{"tresc":" Powstające podczas zapisu pliku graficznego prostokątne zniekształcenia obrazu są charakterystyczne dla formatu","odpowiedz":"JPEG z dużym stopniem kompresji stratnej."},{"tresc":" Funkcją języka PHP tworzącą ciasteczko jest","odpowiedz":"setcookie()"},{"tresc":" Przy użyciu którego znacznika w języku HTML nie można umieścić na stronie grafiki dynamicznej?","odpowiedz":"<strike>"},{"tresc":"Aby zdefiniować łamanie linii tekstu, np. w zmiennej napisowej, należy posłużyć się znakiem","odpowiedz":"n"},{"tresc":"Który z typów relacji wymaga utworzenia tabeli pośredniej łączącej klucze główne obu tabel?","odpowiedz":"n..m"},{"tresc":"W języku CSS, aby uzyskać efekt pochylenia tekstu, należy użyć właściwości","odpowiedz":"font-style"},{"tresc":"Wskaż funkcję PHP, za pomocą której odczytana zawartość pliku jest zapisywana do zmiennej reprezentującej ciąg znaków.","odpowiedz":"file_get_contents();"},{"tresc":"Polecenie w języku SQL ALTER TABLE USA... ma za zadanie","odpowiedz":"modyfikację tabeli USA"},{"tresc":"W języku JavaScript metoda getElementById() odwołuje się do","odpowiedz":"znacznika HTML o podanym id"},{"tresc":" Czynnością zalecaną przed wykonaniem kopii bezpieczeństwa danych w bazie MySQL jest","odpowiedz":"sprawdzenie integralności bazy i ewentualnie jej naprawa."},{"tresc":" Aby zaimportować plik z danymi SQL do bazy danych MySQL można użyć narzędzia","odpowiedz":"phpMyAdmin."},{"tresc":" W języku SQL, aby wstawić wiersz danych do bazy, należy zastosować polecenie","odpowiedz":"INSERT INTO"},{"tresc":" Do zabezpieczeń serwera bazy danych przed atakami hakerów nie należy","odpowiedz":"Defragmentacja dysków"},{"tresc":" Wyszukując z tabeli Pracownicy wyłącznie nazwiska, w których ostatnią literą jest \"i\", można użyć kwerendy SQL","odpowiedz":"SELECT nazwisko FROM Pracownicy WHERE nazwisko LIKE \"%i\";"},{"tresc":" Plik graficzny należy zapisać w formacie GIF, jeżeli","odpowiedz":"jest potrzeba zapisu obrazu lub animacji"},{"tresc":" W języku zapytań SQL, aby dodać do tabeli Towar kolumnę rozmiar typu znakowego o maksymalnej długości 20 znaków, należy wykonać polecenie","odpowiedz":"ALTER TABLE Towar ADD rozmiar varchar(20);"},{"tresc":" Który zapis w dokumencie HTML pozwala na połączenie z zewnętrznym arkuszem stylów o nazwie style.css?","odpowiedz":"<link rel=\"stylesheet\" href=\"style.css\">"},{"tresc":" Które ze znaczników HTML umożliwią wyświetlenie na stronie tekstu w jednym wierszu, jeżeli żadne formatowanie CSS nie zostało zdefiniowane?","odpowiedz":"<span>Dobre strony </span><span style=\"letter-spacing:3px\">mojej strony</span>"},{"tresc":"Kolor zapisany kodem RGB, o wartości rgb(255, 128, 16) w kodzie szesnastkowym będzie miał wartość:","odpowiedz":"#ff8010"},{"tresc":"Tabele Osoby i Adresy są połączone relacją jeden do wielu. Jakie zapytanie SQL należy zapisać, aby korzystając z tej relacji, prawidłowo wyświetlić nazwiska oraz przyporządkowane im miasta?","odpowiedz":"SELECT nazwisko, Miasto FROM Osoby JOIN Adresy ON Osoby.Adresy_id=Adresy.id;"},{"tresc":"Program debugger służy do:","odpowiedz":"analizy wykonywanego programu w celu lokalizacji błędów"},{"tresc":"Element <meta charset=\"utf-8\"> określa metadane strony internetowej dotyczące","odpowiedz":"kodowania znaków."},{"tresc":"Zamieszczony w ramce fragment skryptu w języku JavaScript","odpowiedz":"przypisze zmiennej s długość napisu ze zmiennej t"},{"tresc":"Zgodnie z regułami walidacji HTML5, poprawnym zapisem znacznika hr jest","odpowiedz":"<hr>"},{"tresc":" W kodzie JavaScript pobrano element za pomocą metody getElementById. Aby zmodyfikować zawartość (treść) elementu można użyć właściwości","odpowiedz":"innerHTML"},{"tresc":" Proces organizowania danych w bazie obejmujący tworzenie tabel, ustanawianie relacji między nimi i polegający na wyeliminowaniu z bazy nadmiarowych danych oraz niespójnych zależności nazywa się","odpowiedz":"normalizacją."},{"tresc":" Proces tłumaczenia kodu źródłowego pisanego przez programistę na zrozumiały dla komputera kod maszynowy to","odpowiedz":"kompilowanie"},{"tresc":" Do określenia listy definicji w kodzie HTML używa się znacznika","odpowiedz":"<dl>"},{"tresc":" Aby w języku CSS ustawić czerwony kolor dla tekstu można użyć stylu","odpowiedz":"color: rgb(255,0,0);"},{"tresc":" Aby dołączyć kaskadowy arkusz stylów zapisany w zewnętrznym pliku, należy użyć następującego fragmentu kodu HTML","odpowiedz":"<link rel=\"stylesheet\" type=\"text/css\" href=\"styl.css\" />"},{"tresc":" W wyniku działania pętli zapisanej w języku PHP zostanie wypisany ciąg liczb","odpowiedz":"10 15 20 25 30 35 40 45"},{"tresc":" Działaniem przedstawionego kodu PHP jest wypełnienie tablicy","odpowiedz":"10 losowymi wartościami, a następnie wypisanie wartości ujemnych."},{"tresc":"Fragment kodu języku PHP ma następującą postać. Wynikiem działania pętli będzie wypisanie liczb:","odpowiedz":"0,4,8,12,16,20"},{"tresc":"W kodzie HTML zapisano w bloku tekst formatowany pewnym stylem. Aby wtrącić wewnątrz tekstu kilka słów formatowanych innym stylem, należy zastosować znacznik","odpowiedz":"<span>"},{"tresc":"Który z wymienionych formatów umożliwia zapis dźwięku i obrazu?","odpowiedz":"MP4"},{"tresc":"Przedstawiona w języku CSS definicja stylu dotyczy odsyłacza, który","odpowiedz":"został wcześniej odwiedzony"},{"tresc":"Wskaż złożoność obliczeniową algorytmu naiwnego (zwykłego) wyszukiwania minimum w zbiorze liczb?","odpowiedz":"O(n)"},{"tresc":"Co to jest DBMS?","odpowiedz":"System zarządzania bazą danych"},{"tresc":" Które z poleceń nadaje najniższy poziom uprawnień użytkownikowi uczen pod względem modyfikacji danych i struktury tabel?","odpowiedz":"GRANT SELECT ON szkola.przedmioty TO uczen;"},{"tresc":" W języku SQL wykonano przedstawione w ramce polecenia GRANT. Kto będzie miał prawo do przeglądania danych oraz ich zmiany?","odpowiedz":"Tylko Tomasz"},{"tresc":" W języku CSS zdefiniowano formatowanie paragrafu, które przypisze mu następujące cechy:","odpowiedz":"tło czerwone, kolor tekstu niebieski, marginesy zewnętrzne ustawione na wartość 40px"},{"tresc":" Najprostszą i najmniej pracochłonną metodą przetestowania działania witryny internetowej w wielu przeglądarkach i ich różnych wersjach jest","odpowiedz":"skorzystanie z emulatora przeglądarek internetowych np. Browser Sandbox"},{"tresc":" Jaki program komputerowy przekształca kod źródłowy, napisany w konkretnym języku programowania, na język komputera?","odpowiedz":"Kompilator"},{"tresc":" Wskaż definicję metody, którą należy wstawić w miejscu kropek, aby na stronie WWW wyświetlił się tekst: Jan Kowalski","odpowiedz":"A"},{"tresc":" Funkcja zapisana językiem PHP służy do","odpowiedz":"pobrania danych z bazy danych"},{"tresc":"Aby uzyskać efekt rozstrzelenia liter w selektorze CSS, należy użyć właściwości","odpowiedz":"letter-spacing"},{"tresc":"W kodzie PHP znak \"//\" oznacza","odpowiedz":"początek komentarza jednoliniowego"},{"tresc":"Kolor zapisany kodem heksadecymalnym: #1510FE w kodzie RGB będzie miał wartość","odpowiedz":"rgb(21,16,254)"},{"tresc":"Do utworzenia kopii zapasowej bazy danych w MySQL należy użyć polecenia","odpowiedz":"mysqldump"},{"tresc":"W języku JavaScript zapisano fragment kodu. Po wykonaniu skryptu zmienna x","odpowiedz":"Będzie równa 11 i zostanie wypisana w konsoli przeglądarki internetowej"},{"tresc":" Organizacja zajmująca się ustalaniem standardu dla języka HTML nosi nazwę","odpowiedz":"W3C"},{"tresc":" Które stwierdzenie odnosi się do skalowania obrazu?","odpowiedz":"Powoduje zmianę rozmiaru obrazu bez zmieniania ważnej zawartości wizualnej"},{"tresc":" Który z wymienionych znaczników należy do części <head> dokumentu HTML?","odpowiedz":"<title>"},{"tresc":" Baza danych zawiera tabelę uczniowie z polami: imie, nazwisko, klasa. Aby odnaleźć imiona i nazwiska tych uczniów, których nazwiska rozpoczynają się literą M, należy zastosować polecenie SQL","odpowiedz":"SELECT nazwisko, imie FROM uczniowie WHERE nazwisko LIKE \"M%\";"},{"tresc":" Selektor CSS a:link {color:red} zawarty w kaskadowych arkuszach stylów definiuje","odpowiedz":"pseudoklasę"},{"tresc":"Przedstawione polecenie MySQL ma za zadanie","odpowiedz":"Zmienić typ kolumny w tabeli ksiazki"},{"tresc":"Wysokość dźwięku zależy od","odpowiedz":"częstotliwości drgania fali akustycznej"},{"tresc":"Wartość i typ zmiennej w języku PHP można sprawdzić za pomocą funkcji","odpowiedz":"var_dump()"},{"tresc":"Formularz nadrzędny wykorzystywany do nawigacji w bazie danych pomiędzy dostępnymi w systemie formularzami, kwerendami jest nazywany formularzem","odpowiedz":"sterującym"},{"tresc":"Jak nazywa się podzbiór strukturalnego języka zapytań, związany z formułowaniem zapytań do bazy danych za pomocą polecenia SELECT?","odpowiedz":"SQL DQL (ang. Data Query Language)"},{"tresc":"Znacznik <ins> w języku HTML służy do oznaczenia","odpowiedz":"tekstu, który został dodany"},{"tresc":"Kwerendę SELECT DISTINCT należy zastosować w przypadku, gdy potrzeba wybrać rekordy","odpowiedz":"tak, aby w podanej kolumnie nie powtarzały się wartości."},{"tresc":"W języku JavaScript, aby zmienić wartość atrybutu znacznika HTML, po uzyskaniu obiektu za pomocą metody getElementById należy skorzystać z","odpowiedz":"metody setAttribute"},{"tresc":"Jak nazywa się element bazy danych, za pomocą którego można jedynie odczytać dane z bazy, prezentując je w postaci tekstu lub wykresu?","odpowiedz":"Raport"},{"tresc":" Poziom izolacji transakcji Repeatable Read (tryb powtarzalnego odczytu) stosowany przez MS SQL wiąże się z problemem","odpowiedz":"odczytów widm."},{"tresc":" W języku HTML atrybutem znacznika video, który włącza tryb odtwarzania w kółko, jest","odpowiedz":"loop"},{"tresc":" Testy aplikacji internetowej mające za zadanie sprawdzenie skalowalności aplikacji i bazy danych oraz architektury serwera i konfiguracji noszą nazwę testów","odpowiedz":"kompatybilności"},{"tresc":" Proces walidacji strony internetowej to","odpowiedz":"sprawdzenie jej w celu wyeliminowania błędów"},{"tresc":" Który z podanych formatów można zapisać materiał wideo wraz ze ścieżką dźwiękową?","odpowiedz":"MP4"},{"tresc":" Zadaniem funkcji PHP o nazwie mysql_select_db() jest","odpowiedz":"określić bazę, z której będą pobierane dane"},{"tresc":" W języku XHTML zapisano fragment kodu, który zawiera błąd walidacji. Na czym polega ten błąd?","odpowiedz":"Znacznik <br> powinien być zamknięty"},{"tresc":"Aby naprawić bazę danych w MySQL, należy użyć polecenia","odpowiedz":"REPAIR"},{"tresc":"Aby utworzyć tabelę, należy się posłużyć poleceniem","odpowiedz":"CREATE TABLE"},{"tresc":"Platforma wspierająca programowanie w technologii .NET to","odpowiedz":"framework"},{"tresc":"Które wyrażenie logiczne należy zastosować w języku JavaScript, aby wykonać operacje tylko dla dowolnych liczb ujemnych z przedziału jednostronnie domkniętego <-200,-100)?","odpowiedz":"(liczba >=-200) && (liczba<-100)"},{"tresc":"W folderze www znajdują się podfoldery html i style, w których zapisane są odpowiednio pliki z rozszerzeniem html i pliki z rozszerzeniem css. Chcąc dołączyć styl.css do pliku HTML należy użyć","odpowiedz":"<link rel=\"Stylesheet\" type=\"text/css\" href=\"/../style/styl.css\" />"},{"tresc":" W języku SQL przywilej SELECT polecenia GRANT pozwala użytkownikowi baz danych na","odpowiedz":"odczyt danych z tabeli"},{"tresc":" W algebrze relacji operacja selekcji polega na","odpowiedz":"wybraniu krotek spełniających określone warunki"},{"tresc":" Jak nazywa się metoda dołączania arkusza stylów do dokumentu HTML użyta w przedstawionym kodzie?","odpowiedz":"Styl wpisany, lokalny"},{"tresc":" Której właściwości CSS należy użyć, aby zdefiniować marginesy wewnętrzne dla elementu?","odpowiedz":"padding"},{"tresc":" W języku CSS właściwość font-size przyjmuje, według słów kluczowych, wartości","odpowiedz":"ze zbioru xx-small, x-small, medium, large, x-large, xx-large"},{"tresc":" W języku JavaScript wynik działania instrukcji zmienna++; będzie taki sam jak instrukcji","odpowiedz":"zmienna+=1;"},{"tresc":" Przedstawiona instrukcja zapisana w języku SQL jest przykładem kwerendy","odpowiedz":"aktualizującej."},{"tresc":" Jakiego formatu należy użyć do zapisu obrazu z kompresją stratną?","odpowiedz":"JPEG"},{"tresc":" Który z komentarzy opisuje zadanie zdefiniowanej w języku PHP funkcji?","odpowiedz":"/* Funkcja zwraca wartość wyższą z dwóch podanych, gdy są równe zwraca wartość -1 */"},{"tresc":" Aby zmienić maksymalną długość pola imie w tabeli klienci na 30 znaków, należy użyć w języku SQL następującego kodu","odpowiedz":"ALTER TABLE klienci MODIFY COLUMN imie VARCHAR(30);"},{"tresc":" Przedstawiony kod PHP nawiązuje połączenie z serwerem bazy danych. Jakiego typu operacje powinny się znaleźć w instrukcji warunkowej w miejscu trzech kropek?","odpowiedz":"Obsługa błędu połączenia"},{"tresc":"Którym poleceniem można wyświetlić konfigurację serwera PHP, w tym informację m.in. o: wersji PHP, systemie operacyjnym serwera, wartości przedefiniowanych zmiennych?","odpowiedz":"phpinfo();"},{"tresc":"Kod strony WWW napisanej w języku PHP","odpowiedz":"jest wykonywany po stronie serwera"},{"tresc":"Aby nadać użytkownikowi uprawnienia do tabel w bazie danych, należy zastosować polecenie","odpowiedz":"GRANT"},{"tresc":"W celu przyspieszenia operacji na bazie danych należy do pól często wyszukiwanych lub sortowanych","odpowiedz":"utworzyć indeks"},{"tresc":"Co zostanie wypisane w wyniku wykonania przedstawionych instrukcji?","odpowiedz":"1"},{"tresc":"Interpreter PHP wygeneruje błąd i nie wykona kodu, jeżeli programista:","odpowiedz":"nie postawi średnika po wyrażeniu w instrukcji if, jeśli po nim nastąpiła sekcja else"},{"tresc":" Która z definicji CSS określa formatowanie nagłówka h1: tekst nadkreślony, z odstępami między wyrazami 10 px i czerwonym kolorem tekstu?","odpowiedz":"A"},{"tresc":" Formularz nadrzędny wykorzystywany do nawigacji w bazie danych pomiędzy dostępnymi w systemie formularzami, kwerendami jest nazywany formularzem","odpowiedz":"sterującym"},{"tresc":" Przedstawiony fragment kodu napisano w języku JavaScript. Aby program przypisywał wartość równą 1 co trzeciemu elementowi w tablicy, to w miejscu kropek należy wpisać","odpowiedz":"i += 3"},{"tresc":" Który ze sposobów wypisania tekstu nie jest zdefiniowany w języku JavaScript?","odpowiedz":"Funkcja MessageBox()"},{"tresc":" Po wykonaniu zamieszczonego w ramce skryptu napisanego w języku JavaScript w przeglądarce zostanie wypisana wartość","odpowiedz":"12,5"},{"tresc":"Które z formatowań NIE JEST wyrażone w języku CSS?","odpowiedz":"C"},{"tresc":"Funkcja CONCAT() w języku SQL odpowiada za","odpowiedz":"łączenie wyświetlanego tekstu"},{"tresc":"Wskaż słowo kluczowe w języku C++ dodawane przed wbudowanym typem danych, które przesuwa zakres liczby wyłącznie nieujemne","odpowiedz":"unsigned"},{"tresc":" Systemem zarządzania treścią pozwalającym na łatwe utworzenie i aktualizację serwisu WWW jest","odpowiedz":"CMS"},{"tresc":" CAPTCHA to technika zabezpieczeń na stronach WWW pozwalająca","odpowiedz":"potwierdzić, że dane z formularza są wysyłane przez człowieka."},{"tresc":" Przedstawione w języku CSS formatowanie czcionki będzie obowiązywać dla","odpowiedz":"całego kodu HTML, jako formatowanie domyślne dla wszystkich elementów strony."},{"tresc":" W procesie przygotowywania grafiki na stronę internetową należy wyciąć jedynie jej fragment. Taka operacja to","odpowiedz":"kadrowanie"},{"tresc":" Głównym celem stosowania edytora WYSIWYG jest","odpowiedz":"szybka wizualizacja tworzonej strony."},{"tresc":" Kod JavaScript wywołany zdarzeniem kliknięcia przycisku ma za zadanie","odpowiedz":"zamienić obraz1.gif na obraz2.gif"},{"tresc":" Pierwszym krokiem podczas przetwarzania sygnału analogowego na cyfrowy jest","odpowiedz":"próbkowanie"},{"tresc":"W znaczniku meta w miejsce kropek należy wpisać","odpowiedz":"streszczenie treści strony."},{"tresc":"Jak nazywa się technika umożliwiająca otwarcie połączenia klienta z serwerem i komunikację bez przeładowywania całej strony WWW w sposób asynchroniczny ?","odpowiedz":"AJAX"},{"tresc":"W kodzie JavaScript pętla zostanie wykonana","odpowiedz":"3 razy"},{"tresc":"Baza danych księgarni zawiera tabelę ksiazki z polami: id, idAutor, tytul, ileSprzedanych oraz tabelę autorzy z polami: id, imie, nazwisko. Aby stworzyć raport sprzedanych książek z tytułami i nazwiskami autorów, należy","odpowiedz":"Zdefiniować relację 1..n dla tabel ksiazki i autorzy, a następnie stworzyć kwerendę łączącą obie tabele"},{"tresc":" Który z atrybutów background-attachment w języku CSS należy wybrać, aby tło strony było nieruchome względem okna przeglądarki?","odpowiedz":"Fixed"},{"tresc":" W strukturalnych językach programowania w celu przechowania informacji o 50 uczniach (ich imionach, nazwiskach, średniej ocen) należy użyć","odpowiedz":"tablicy 50 elementów o składowych strukturalnych"},{"tresc":" W języku HTML znacznik <i> nadaje znakom taki sam wizualny efekt jak znacznik","odpowiedz":"<em>"},{"tresc":" Aby stronę WWW można było przesłać do przeglądarki internetowej w postaci zaszyfrowanej, należy użyć protokołu","odpowiedz":"HTTPS"},{"tresc":" Instrukcja for może być zastąpiona instrukcją","odpowiedz":"while"},{"tresc":" W języku HTML atrybut shape znacznika area, określający typ obszaru, może przyjąć wartość","odpowiedz":"rect, poly, circle"},{"tresc":" W stylach CSS, aby ustalić styl linii obramowania jako linię kreskową, należy zastosować wartość","odpowiedz":"dashed"},{"tresc":" W języku CSS przypisano regułę: float:left; dla bloku. Reguła ta zostanie wykorzystana do","odpowiedz":"ustawienia bloku na lewo względem innych"},{"tresc":"Zakładając, że użytkownik wcześniej nie miał żadnych praw, polecenie SQL nada użytkownikowi anna prawa jedynie do","odpowiedz":"wybierania, wstawiania oraz aktualizacji danych tabeli o nazwie klienci."},{"tresc":"Formularz, którego fragment przedstawiono, został obsłużony w skrypcie PHP. Wskaż prawidłowo zapisane pobranie wartości wprowadzonej do pola edycyjnego.","odpowiedz":"$name = $_POST['imie'];"},{"tresc":"Fragment kodu w języku PHP wypisze","odpowiedz":"samą nazwę konta, czyli \"adres\""},{"tresc":"Który styl CSS pozwoli zdefiniować wyrównanie tekstu do prawej strony?","odpowiedz":"<p style=\"text-align: right\">tekst</p>"},{"tresc":"W celu określenia wysokości obrazka wyświetlonego na stronie WWW należy wykorzystać właściwość CSS o nazwie","odpowiedz":"height"},{"tresc":" Znaczniki HTML <strong> oraz <em> służące do podkreślenia ważności tekstu, pod względem formatowania są odpowiednikami znaczników","odpowiedz":"<b> oraz <i>"},{"tresc":" Aby edytować dane w bazie danych można posłużyć się","odpowiedz":"formularzem."},{"tresc":" Wskaż kod CSS odpowiadający układowi bloków 2 - 5, zakładając, że są one zbudowane w oparciu o przedstawiony kod HTML.","odpowiedz":"B"},{"tresc":" Wskaż złożoność obliczeniową algorytmu naiwnego (zwykłego) wyszukiwania minimum w zbiorze liczb?","odpowiedz":"O(n)"},{"tresc":" Komentarz w języku JavaScript rozpoczyna się od znaku lub znaków","odpowiedz":"//"},{"tresc":"Projektowanie logicznego układu witryny polega na","odpowiedz":"rozmieszczeniu elementów w konkretnych miejscach witryny"},{"tresc":"Pogrubienie tekstu za pomocą znacznika <b> można uzyskać także przy wykorzystaniu właściwości CSS","odpowiedz":"font-weight"},{"tresc":"Jakie wartości muszą przyjmować zmienne w funkcji biblioteki mysqli, aby połączyć się z serwerem i bazą danych?","odpowiedz":"adres serwera - $a, nazwa bazy danych - $d, login - $b, hasło - $c"},{"tresc":"Który zapis znacznika <div> może wystąpić w dokumencie HTML tylko jeden raz, a ponowne użycie tego zapisu spowoduje wygenerowanie błędów podczas walidacji dokumentu?","odpowiedz":"<div id=\"identyfikator\">"},{"tresc":"Aby zmienić maksymalną długość pola imie w tabeli klienci na 30 znaków, należy użyć w języku SQL następującego kodu","odpowiedz":"ALTER TABLE klienci MODIFY COLUMN imie VARCHAR(30);"},{"tresc":" Która pętla w języku PHP pozwala wykonać operacje na wszystkich elementach tablicy z automatycznym indeksowaniem jej elementów?","odpowiedz":"foreach"},{"tresc":" W języku JavaScript, funkcja matematyczna Math.pow() służy do wyznaczenia","odpowiedz":"potęgi liczby"},{"tresc":" W celu uzyskania efektu widocznego na rysunku, w kodzie HTML, należy umieścić znacznik skrótu <abbr> z atrybutem","odpowiedz":"title"},{"tresc":" Przedstawiona instrukcja warunkowa zapisana w języku JavaScript jest spełniona dla zmiennej x równej","odpowiedz":"3"},{"tresc":" Aby zobaczyć wyniki działania skryptu napisanego w języku PHP, będącego elementem strony WWW, musi być on","odpowiedz":"zinterpretowany po stronie serwera"},{"tresc":"W poleceniach, których celem jest odtwarzanie na stronie internetowej dźwięku jako podkładu muzycznego NIE wykorzystuje się atrybutu","odpowiedz":"href=\"C:/100.wav\">"},{"tresc":"Struktura prostych baz danych, w których wszystkie dane są przechowywane w jednej tabeli, nazywana jest modelem","odpowiedz":"jednorodnym"},{"tresc":"W języku PHP funkcja trim ma za zadanie","odpowiedz":"Usuwać białe znaki lub inne znaki podane w parametrze, z obu końców napisu"},{"tresc":"W języku HTML, aby wstawić na stronę obraz zapisany w formacie JPG, należy zastosować znacznik","odpowiedz":"<img>"},{"tresc":"Wstawki kodu JavaScript w dokumencie HTML mogą się znaleźć","odpowiedz":"zarówno w cześci <head>, jak i <body>, w znaczniku <script>"},{"tresc":" Aby usunąć tabelę należy zastosować kwerendę","odpowiedz":"DROP TABLE"},{"tresc":" Który z poniższych przykładów kodu HTML5 zostanie zakwalifikowany przez walidator HTML jako błędny?","odpowiedz":"<p class= \"stl\"><style>.a{color:#F00}</style>tekst</p>"},{"tresc":" Aby uprościć wprowadzenie i edytowanie danych w tabeli, należy zdefiniować","odpowiedz":"formularz"},{"tresc":" Pętla zapisana w języku PHP wstawi do tablicy liczby","odpowiedz":"0, 10, 20, 30, 40, 50, 60, 70, 80, 90"},{"tresc":" W jakim formacie będzie wyświetlana data po uruchomieniu przedstawionego kodu?","odpowiedz":"Monday, 10th July 2017"},{"tresc":" Które dane z 8 rekordów wpisanych do tabeli zwierzeta zostaną wyświetlone w wyniku podanego zapytania SQL?","odpowiedz":"Dika, Fuks"},{"tresc":" Który z rysunków obrazuje efekt działania przedstawionego fragmentu kodu HTML?","odpowiedz":"C"},{"tresc":" Chcąc zdefiniować formatowanie tabeli w języku CSS w taki sposób, aby wiersz, który jest aktualnie wskazywany kursorem myszy, został wyróżniony np. innym kolorem, należy zastosować","odpowiedz":"pseudoklasę :hover"},{"tresc":" Poprzez deklarację var x=\"true\"; w języku JavieScript tworzy się zmienną typu","odpowiedz":"String (ciąg znaków)"},{"tresc":"Aby zweryfikować poprawność składni kodu CSS można użyć","odpowiedz":"walidatora."},{"tresc":"Aby pozbyć się nienaturalnego odwzorowania ukośnych krawędzi linii w grafice rastrowej, czyli tak zwanego schodkowania, należy zastosować filtr","odpowiedz":"antyaliasingu"},{"tresc":"Na stronie internetowej znajduje się formularz, do którego należy zaprogramować następujące funkcje: walidacja: w trakcie wypełniania formularza w czasie rzeczywistym jest sprawdzana poprawność danych przesyłanie danych: po wypełnieniu formularza i jego zatwierdzeniu dane są przesyłane do bazy danych na serwerze Aby zaimplementować tę funkcjonalność w możliwie najprostszy sposób, należy zapisać","odpowiedz":"walidację w języku JavaScript, a przesyłanie danych w skrypcie PHP."},{"tresc":"Które z poleceń umożliwia dodanie kolumny zadaniekompletne do tabeli zadania?","odpowiedz":"ALTER TABLE zadania ADD COLUMN zadaniekompletne int"},{"tresc":" Aby utworzyć tabelę, należy się posłużyć poleceniem","odpowiedz":"CREATE TABLE"},{"tresc":" Język HTML dysponuje nagłówkami do budowania hierarchii treści. Nagłówki te występują jedynie w zakresie","odpowiedz":"h1 - h6"},{"tresc":" Co spowoduje fragment skryptu w języku JavaScript?","odpowiedz":"Przypisze zmiennej s wartość odpowiadającą długości napisu ze zmiennej n"},{"tresc":" Program debugger służy do:","odpowiedz":"analizy wykonywanego programu w celu lokalizacji błędów"},{"tresc":" Podczas strumieniowego przesyłania cyfrowego materiału wideo parametrem wpływającym na jakość obrazu i dźwięku jest przepływność. Wielkość ta opisuje liczbę","odpowiedz":"bitów transmitowanych w jednostce czasu."},{"tresc":" CMYK to zestaw czterech podstawowych kolorów farb drukarskich:","odpowiedz":"turkusowego, purpurowego, żółtego, czarnego"},{"tresc":" Wskaż dwa sposoby zabezpieczenia bazy danych Microsoft Access","odpowiedz":"Ustalanie hasła do otwarcia bazy danych oraz zabezpieczeń na poziomie użytkownika"},{"tresc":" W języku HTML, aby zapisać sekcję cytatu, która może zawierać kilka paragrafów tak, by przeglądarka dodała wspólne wcięcie, należy zastosować znacznik","odpowiedz":"<blockquote>"},{"tresc":" W celu stworzenia relacji wiele do wielu łączącej tabele A i B wystarczy, że","odpowiedz":"zdefiniuje się trzecią tabelę z kluczami obcymi do tabel A i B"},{"tresc":"Aby stronę WWW można było przesłać do przeglądarki internetowej w postaci zaszyfrowanej, należy użyć protokołu","odpowiedz":"HTTPS"},{"tresc":"Powstające podczas zapisu pliku graficznego prostokątne zniekształcenia obrazu są charakterystyczne dla formatu","odpowiedz":"JPEG z dużym stopniem kompresji stratnej."},{"tresc":"Który z typów wspieranych przez język PHP służy do obsługi zmiennych logicznych?","odpowiedz":"Boolean"},{"tresc":"Przedstawiony kod PHP nawiązuje połączenie z serwerem bazy danych. Jakiego typu operacje powinny się znaleźć w instrukcji warunkowej w miejscu trzech kropek?","odpowiedz":"Obsługa błędu połączenia"},{"tresc":"W języku SQL w wyniku wykonania zapytania ALTER TABLE osoba DROP COLUMN grupa; zostanie","odpowiedz":"usunięta kolumna grupa"},{"tresc":"Aby podczas tworzenia tabeli utworzyć klucz obcy na wielu kolumnach, należy użyć polecenia","odpowiedz":"CONSTRAINT fk_osoba_uczen FOREIGN KEY (nazwisko, imie) REFERENCES osoby (nazwisko,imie)"},{"tresc":"W bazie danych wykonano następujące polecenie dotyczące praw użytkownika adam. Po wykonaniu poleceń użytkownik adam będzie miał prawa do","odpowiedz":"usunięcia tabeli lub jej rekordów"},{"tresc":" Certyfikat SSL jest stosowany do","odpowiedz":"zidentyfikowania właściciela domeny"},{"tresc":" W języku JavaScript zapisano definicję obiektu. Aby odwołać się do własności nazwisko należy zapisać","odpowiedz":"osoba.nazwisko"},{"tresc":" Na obrazie przedstawiono wybór formatu pliku importującego bazę danych. Którego formatu należy użyć, jeżeli dane są wyeksportowane z programu Excel i zapisane tekstowo z zastosowaniem przecinka do rozdzielenia wartości pól?","odpowiedz":"CSV"},{"tresc":" Algorytm przedstawiony na rysunku można zapisać w języku JavaScript za pomocą instrukcji","odpowiedz":"var i = 0; while(i <= 10) i += 2;"},{"tresc":"W jaki sposób, stosując język PHP, zapisać w ciasteczku napis znajdujący się w zmiennej dane na czas jednego dnia?","odpowiedz":"setcookie(\"dane\", $dane, time() + (3600*24));"},{"tresc":"Wartość pola tabeli pełniącego rolę klucza podstawowego","odpowiedz":"musi być unikalna"},{"tresc":"Jak nazywa się edytor wspomagający tworzenie stron internetowych, którego sposób działania można w polskim tłumaczeniu określić jako: otrzymujesz to, co widzisz?","odpowiedz":"WYSIWYG"},{"tresc":"W celu zapewnienia spójności danych w bazie programu Microsoft Access należy skorzystać","odpowiedz":"z więzów integralności"},{"tresc":"Które z wymienionych osób odpowiadają za przygotowanie systemu bazy danych do pracy produkcyjnej w sposób ciągły, zarządzanie użytkownikami i instalowanie nowych wersji systemu bazodanowego?","odpowiedz":"Administratorzy systemu bazy danych"},{"tresc":" W języku CSS zdefiniowano formatowanie dla pola edycyjnego. Tak formatowane pole edycyjne będzie miało jasnozielone tło","odpowiedz":"po kliknięciu myszą w celu zapisania w nim tekstu."},{"tresc":" Wskaż typ złożony.","odpowiedz":"class"},{"tresc":" Który znacznik HTML jest elementem blokowym?","odpowiedz":"p"},{"tresc":" Zgodnie z regułami walidacji HTML5, poprawnym zapisem znacznika hr jest","odpowiedz":"<hr>"},{"tresc":" Atrybut kolumny NOT NULL jest wymagany w przypadku","odpowiedz":"klucza podstawowego."},{"tresc":" Co to jest DBMS?","odpowiedz":"System zarządzania bazą danych"},{"tresc":"Dana jest tabela ksiazki z polami: tytul, autor (typu tekstowego), cena (typu liczbowego). Aby kwerenda SELECT zwróciła tylko tytuły, dla których cena jest mniejsza od 50zł, należy zapisać:","odpowiedz":"SELECT tytul FROM ksiazki WHERE cena < 50;"},{"tresc":"Efektem wykonania przedstawionego kodu PHP jest wyświetlenie komunikatu","odpowiedz":"warunek2"},{"tresc":"Według którego parametru oraz dla ilu tabel zostaną zwrócone wiersze na liście w wyniku przedstawionego zapytania?","odpowiedz":"Według parametru nr_id dla wszystkich tabel"},{"tresc":"Debugger to program służący do","odpowiedz":"wyszukiwania błędów w kodzie programu"},{"tresc":"Aby naprawić uszkodzoną tabelę w MySQL, należy wydać polecenie","odpowiedz":"REPAIR TABLE"},{"tresc":" W języku JavaScript należy odwołać się do elementu zawartego w pierwszym paragrafie przedstawionego fragmentu strony HTML. Można to wykonać za pomocą funkcji","odpowiedz":"getElementByTagName(\"p\")[0];"},{"tresc":" Zgodnie z właściwościami ACID, dotyczącym wykonania transakcji, wymaganie trwałości (ang. durability) oznacza, że","odpowiedz":"dane zatwierdzone przez transakcję powinny być dostępne niezależnie od tego, co się będzie działo po jej zakończeniu"},{"tresc":" W języku PHP zapisano instrukcję pętli przedstawioną w ramce. Ile powtórzeń będzie miała podana pętla, jeśli zmienna sterująca nie jest modyfikowana w jej wnętrzu, oraz nie wprowadzono instrukcji modyfikacji pętli typu break?","odpowiedz":"10 powtórzeń"},{"tresc":"Jak nazywa się metoda sortowania polegająca na podziale na n przedziałów jednakowej długości, w których następuje sortowanie, po czym posortowane zawartości przedziałów są poddawane analizie i prezentacji?","odpowiedz":"Sortowanie kubełkowe."},{"tresc":"Przedstawiony kod źródłowy ma za zadanie wyświetlić","odpowiedz":"losowe liczby od 0 do 100 tak długo, aż nie zostanie wylosowana wartość 0"},{"tresc":"Który z wymienionych formatów plików NIE JEST wykorzystywany do publikacji grafiki lub animacji na stronach internetowych?","odpowiedz":"AIFF"},{"tresc":"Przedstawiony fragment dokumentu HTML z kodem JavaScript spowoduje, że po wciśnięciu przycisku","odpowiedz":"obraz2.png zostanie ukryty"},{"tresc":"Zastosowanie kwerendy SQL: DELETE FROM mieszkania WHERE status=1; spowoduje usunięcie","odpowiedz":"rekordów, w których pole status jest równe 1, z tabeli mieszkania"},{"tresc":"W języku PHP zastosowano funkcję is_int(). Które z podanych wywołań tej funkcji zwróci wartość TRUE?","odpowiedz":"is_int(135)"},{"tresc":" Które polecenie SQL zamieni w tabeli tab w kolumnie kol wartość Ania na Zosia?","odpowiedz":"UPDATE tab SET kol='Zosia' WHERE kol='Ania';"},{"tresc":" Relacja opisana w sposób: \"Rekordowi z tabeli A odpowiada dowolna liczba rekordów z tabeli B. Jednemu rekordowi z tabeli B odpowiada dokładnie jeden rekord z tabeli A\" jest relacją","odpowiedz":"jeden do wielu."},{"tresc":" W języku CSS zdefiniowano styl. Sformatowana stylem sekcja będzie zawierała obramowanie o szerokości","odpowiedz":"2 px oraz marginesy na zewnątrz tego obramowania"},{"tresc":" W prezentowanym kodzie PHP w miejscu kropek powinno znaleźć się polecenie","odpowiedz":"mysqli_fetch_row($zapytanie);"},{"tresc":" Za pomocą, którego znacznika można wstawić listę numerowaną (uporządkowaną) w dokumencie HTML?","odpowiedz":"<ol>"},{"tresc":" Wskaż wynik wykonania skryptu PHP.","odpowiedz":"zielony, niebieski, czarny, biały,"},{"tresc":" Działaniem przedstawionego kodu PHP będzie wypełnienie tablicy","odpowiedz":"10 losowymi wartościami, a następnie wypisanie wartości ujemnych"},{"tresc":" Jaką wartość zwróci funkcja empty($a); zapisana w języku PHP, gdy zmienna $a przyjmie wartość liczbową równą 0?","odpowiedz":"TRUE"},{"tresc":" Którą z właściwości pola tabeli należy zdefiniować, aby pole przyjmowało dane składające się wyłącznie z cyfr?","odpowiedz":"Maskę wprowadzania"},{"tresc":"Jak działa instrukcja łącząca wyniki zapytań INTERSECT w języku SQL?","odpowiedz":"Zwraca część wspólną wyników dwóch zapytań."},{"tresc":"W czasie przetwarzania dźwięku, aby pozbyć się niechcianych odgłosów spowodowanych złą jakością mikrofonu, należy zastosować narzędzie","odpowiedz":"usuwania szumów"},{"tresc":" Który z wymienionych formatów plików graficznych obsługuje przezroczystość?","odpowiedz":"PNG"},{"tresc":" Aby przygotować szablon strony z trzema kolumnami ustawionymi obok siebie, można posłużyć się stylem CSS","odpowiedz":"A"},{"tresc":" Zdefiniowano bazę danych z tabelą sklepy o polach: nazwa, ulica, miasto, branza. Aby wyszukać wszystkie nazwy sklepów spożywczych zlokalizowanych wyłącznie we Wrocławiu, należy posłużyć się kwerendą:","odpowiedz":"SELECT nazwa FROM sklepy WHERE branza=\"spozywczy\" AND miasto=\"Wrocław\";"},{"tresc":" Który z obiektów relacyjnej bazy danych, będący kodem języka SQL, może być wywoływany w zapytaniach modyfikujących kolumny danych widoczne jako tabela, bez względu na to czy jest tworzony programowo, czy dynamicznie?","odpowiedz":"Funkcja zdefiniowana"},{"tresc":"Które stwierdzenie najlepiej opisuje klasę Owoc zdefiniowaną w języku PHP i przedstawioną na listingu?","odpowiedz":"Ma dwa pola i jedną metodę, pole kolor ma zakres widzialności ograniczony tylko do metod klasy."},{"tresc":"W języku HTML, aby scalić w pionie dwie sąsiednie komórki w kolumnie tabeli, należy zastosować atrybut","odpowiedz":"rowspan"},{"tresc":"Przedstawiony fragment kodu PHP ma za zadanie umieścić dane znajdujące się w zmiennych $a, $b, $c w bazie danych, w tabeli dane. Tabela dane zawiera cztery pola, z czego pierwsze to autoinkrementowany klucz główny. Które z poleceń powinno być przypisane do zmiennej $zapytanie?","odpowiedz":"INSERT INTO dane VALUES (NULL, '$a', '$b', '$c');"},{"tresc":"W programie do obróbki grafiki rastrowej zmodyfikowano krzywe kolorów tak, jak zaznaczono ramką na przedstawionym obrazie. Ma to na celu","odpowiedz":"modyfikację najjaśniejszych i najciemniejszych kolorów obrazu."},{"tresc":"Polecenie DBCC CHECKDB(\"sklepAGD\", Repair_fast) w MS SQL Server","odpowiedz":"sprawdzi spójność bazy danych i naprawi uszkodzone indeksy"},{"tresc":"W języku HTML informacje dotyczące autora, streszczenia i słów kluczowych strony należy umieścić","odpowiedz":"pomiędzy znacznikami <head> i </head>, w znaczniku <meta>"},{"tresc":"W tabeli produkt znajdują się przedmioty wyprodukowane po 2000 roku, z polami nazwa i rok_produkcji. Klauzula SQL wyświetli listę przedmiotów wyprodukowanych","odpowiedz":"w roku 2017"},{"tresc":" Przedstawiony zapis w języku JavaScript oznacza, że","odpowiedz":"zmienna x będzie przechowywać wynik działania metody nazwa."},{"tresc":" Globalne tablice do przechowywania danych o ciastkach i sesjach: $_COOKIE oraz $_SESSION są częścią języka","odpowiedz":"PHP"},{"tresc":" W bazie danych sklepu spożywczego pod koniec dnia jest tworzony raport wyświetlający te produkty wraz z ich dostawcami, dla których stan magazynowy jest mniejszy niż 10 sztuk. Do zdefiniowania tego raportu posłużono się kwerendą","odpowiedz":"SELECT"},{"tresc":" Przedstawiona linia kreskowana w stylu obramowania CSS jest określona właściwością","odpowiedz":"dashed"},{"tresc":"Formatem o najwyższej rozpiętości tonalnej wśród wymienionych jest","odpowiedz":"RAW"},{"tresc":"Najprostszą i najmniej pracochłonną metodą przetestowania działania witryny internetowej w wielu przeglądarkach i ich różnych wersjach jest","odpowiedz":"skorzystanie z emulatora przeglądarek internetowych np. Browser Sandbox"},{"tresc":"Na przedstawionej tabeli samochody wykonano zapytanie SQL: SELECT model FROM samochody WHERE rocznik=2016; W wyniku podanego zapytania zostaną zwrócone następujące wartości:","odpowiedz":"Punto, Corsa, Corolla"},{"tresc":"W języku SQL, wykorzystywanym przez bazę danych MySQL w tabeli samochody, aby nadać wartość równą 0 dla kolumny przebieg, należy posłużyć się kwerendą","odpowiedz":"UPDATE samochody SET przebieg = 0;"},{"tresc":" Które wartości będą kolejno wypisane w wyniku działania przedstawionego skryptu","odpowiedz":"2 2 1"},{"tresc":" Wynikiem uruchomienia zapytania SQL jest","odpowiedz":"liczba uczniów, których średnia ocen wynosi 5"},{"tresc":" W języku JavaScript zapisano następującą funkcję. Ma ona za zadanie","odpowiedz":"Zwrócić wartość bezwzględną z f"},{"tresc":" Odwoływanie funkcji do samej siebie to","odpowiedz":"rekurencja"},{"tresc":" Warunek zapisany w JavaScript jest prawdziwy, gdy zmienna x przechowuje","odpowiedz":"dowolną dodatnią wartość liczbową"},{"tresc":" Przedstawiona linia kodu zapisana językiem PHP ma za zadanie","odpowiedz":"zdefiniować stałą o nazwie OSOBA."},{"tresc":" Zapis CSS w takiej postaci sprawi, że na stronie internetowej","odpowiedz":"punktorem listy nienumerowanej będzie rys.gif"},{"tresc":"Przeglądarka internetowa wyświetliła stronę w następujący sposób. Wskaż kod HTML, który poprawnie definiuje przedstawioną hierarchiczną strukturę tekstu:","odpowiedz":"<h1>Rozdział 1</h1> <p>tekst</p> <h2>Podrozdział 1.1</h2> <p>tekst</p> <h2>Podrozdział 1.2</h2>"},{"tresc":"Dana jest tabela uczniowie o polach id, nazwisko, imie, klasa. Które zapytanie SQL wyświetli liczbę osób w poszczególnych klasach oraz nazwę klasy?","odpowiedz":"SELECT COUNT(id), klasa FROM uczniowie GROUP BY klasa;"},{"tresc":"W formularzu dane z pola input o typie number zostały zapisane do zmiennej a, a następnie przetworzone w skrypcie JavaScript w następujący sposób. Zmienna z będzie typu","odpowiedz":"zmiennoprzecinkowego"},{"tresc":"Która z definicji CSS określa formatowanie nagłówka h1: tekst nadkreślony, z odstępami między wyrazami 10 px i czerwonym kolorem tekstu?","odpowiedz":"A"},{"tresc":"Funkcja zapisana językiem PHP służy do","odpowiedz":"pobrania danych z bazy danych"},{"tresc":" Chcąc zdefiniować marginesy wewnętrzne dla danych: margines górny 50px, dolny 40px, prawy 20px i lewy 30px należy użyć składni CSS","odpowiedz":"padding: 50px, 20px, 40px, 30px;"},{"tresc":" Który z przedstawionych kodów XHTML sformatuje tekst według podanego wzoru?","odpowiedz":"D"},{"tresc":" Zapisano kod HTML wstawiający grafikę na stronę internetową. Jeżeli rysunek.png nie zostanie odnaleziony, przeglądarka","odpowiedz":"w miejscu grafiki wypisze tekst \"pejzaż\""},{"tresc":" W jaki sposób, stosując język PHP, zapisać w ciasteczku napis znajdujący się w zmiennej dane na czas jednego dnia?","odpowiedz":"setcookie(\"dane\", $dane, time() + (3600*24));"},{"tresc":" Kwerendę SELECT DISTINCT należy zastosować w przypadku, gdy potrzeba wybrać rekordy","odpowiedz":"tak, aby w podanej kolumnie nie powtarzały się wartości."},{"tresc":"Wskaż BŁĘDNY opis optymalizacji kodu wynikowego programu","odpowiedz":"Jej celem jest sprawdzenie zgodności z wymogami formalnymi"},{"tresc":"Ustalenie relacji pomiędzy tabelami w systemie bazodanowym MySQL umożliwia klauzula","odpowiedz":"REFERENCES"},{"tresc":"Która z deklaracji funkcji w języku C++ ma parametr wejściowy typu rzeczywistego, a zwraca wartość całkowitą?","odpowiedz":"int fun1(float a);"},{"tresc":" W języku JavaScript poprawnie nadana zmienna to","odpowiedz":"imie2"},{"tresc":" Który zapis definiuje w języku PHP komentarz wieloliniowy?","odpowiedz":"/* */"},{"tresc":" Który typ języka PHP umożliwia przechowywanie wielu wartości z możliwością ich indeksowania?","odpowiedz":"array"},{"tresc":" Aby zweryfikować poprawność składni kodu CSS można użyć","odpowiedz":"walidatora."},{"tresc":"Polecenie REVOKE SELECT ON nazwa1 FROM nazwa2 w języku SQL umożliwia","odpowiedz":"odbieranie uprawnień użytkownikowi"},{"tresc":"Polecenie pg_connect języka PHP służy do połączenia z bazą","odpowiedz":"PostgreSQL"},{"tresc":"Który kod jest alternatywny do kodu zamieszczonego w ramce?","odpowiedz":"A"},{"tresc":"Który z poniższych przykładów kodu HTML5 zostanie zakwalifikowany przez walidator HTML jako błędny?","odpowiedz":"<p class= \"stl\"><style>.a{color:#F00}</style>tekst</p>"},{"tresc":"Wynikiem działania przedstawionego fragmentu programu JavaScript jest wartość zmiennej w równa","odpowiedz":"sumie naturalnych liczb parzystych mniejszych od 50."},{"tresc":"Przedstawiona definicja formularza została zastosowana na stronie internetowej, która wysyła dane do pliku zapisanego w języku PHP. W której tablicy będą dostępne dane z formularza?","odpowiedz":"$_POST"},{"tresc":"Przedstawiona linia kodu zapisana językiem PHP ma za zadanie","odpowiedz":"zdefiniować stałą o nazwie OSOBA."},{"tresc":"W języku PHP zapisywanie danych do pliku realizuje funkcja","odpowiedz":"fputs()"},{"tresc":" W języku CSS poniższy zapis sprawi, że koloru zielonego będzie","odpowiedz":"tło tekstu nagłówka drugiego stopnia"},{"tresc":" Kolor zapisany w postaci szesnastkowej o wartości #11FE07 w kodzie RGB ma postać","odpowiedz":"rgb(17,254,7)"},{"tresc":" Aby zadeklarować pole klasy, do którego mają dostęp jedynie metody tej klasy i pole to nie jest dostępne dla klas pochodnych, należy użyć kwalifikatora dostępu","odpowiedz":"private"},{"tresc":"W języku PHP zmiennej a przypisano tekst, w którym kilkukrotnie występuje słowo Kowalski. Aby jednym pleceniem zmienić w zmiennej a wszystkie wystąpienia słowa Kowalski na słowo Nowak, należy zastosować polecenie","odpowiedz":"$a = str_replace('Kowalski', 'Nowak', $a);"},{"tresc":"Zapis CSS w takiej postaci sprawi, że na stronie internetowej","odpowiedz":"punktorem listy nienumerowanej będzie rys.gif"},{"tresc":"Kolor zapisany w notacji heksadecymalnej #0000FF to","odpowiedz":"niebieski"},{"tresc":"Który selektor formatuje akapity tekstu o klasie tekst oraz element blokowy o ID obrazki?","odpowiedz":"p.tekst, div#obrazki"},{"tresc":"Który z zapisów znacznika <meta> jest prawidłowy ze względu na wykorzystane atrybuty?","odpowiedz":"<meta name = \"description\" content = \"Masz jakieś hobby? To jest strona dla Ciebie!\">"},{"tresc":"Instrukcja DROP języka SQL ma za zadanie","odpowiedz":"usunąć istniejący obiekt"},{"tresc":" W MS SQL Server predefiniowana rola o nazwie dbcreator pozwala użytkownikowi na","odpowiedz":"tworzenie, modyfikowanie, usuwanie i odzyskiwanie bazy danych"},{"tresc":" Które zapytanie SQL posłuży do wyszukania z przedstawionej tabeli wyłącznie wszystkich imion i nazwisk pacjentów urodzonych przed rokiem 2002?","odpowiedz":"SELECT imie, nazwisko FROM Pacjenci WHERE rok_urodzenia < 2002;"},{"tresc":" Aby przenieść witrynę na serwer, można skorzystać z oprogramowania","odpowiedz":"FileZilla"},{"tresc":"Na potrzeby strony internetowej przygotowano grafikę rysunek.jpg o rozmiarze: szerokość 200 px, wysokość 100 px. Aby wyświetlić tę grafikę jako miniaturę – pomniejszoną z zachowaniem proporcji, można zastosować znacznik","odpowiedz":"<img src=\"rysunek.png\" style=\"width: 50px\">"},{"tresc":"Które ze stwierdzeń prawidłowo charakteryzuje zdefiniowaną tabelę: CREATE TABLE dane (kolumna INTEGER(3));","odpowiedz":"Tabela o nazwie dane posiada jedną kolumnę liczb całkowitych"},{"tresc":"Zdefiniowano bazę danych z tabelą mieszkancy o polach: nazwisko, imie, miasto. Następnie stworzono następujące zapytanie do bazy: SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Poznań\" UNION ALL SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Kraków\"; Wskaż zapytanie, które zwróci identyczne dane:","odpowiedz":"SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Poznań\" OR miasto=\"Kraków\";"},{"tresc":"Przy użyciu jakiego znacznika HTML otrzymamy tekst napisany czcionką o stałej szerokości znaku, który uwzględnia dodatkowe spacje, tabulacje i znaki końca linii?","odpowiedz":"<pre> ... </pre>"},{"tresc":"Kompresja bezstratna pliku graficznego gwarantuje","odpowiedz":"pierwotną jakość grafiki."},{"tresc":"Wskaż zapytanie SQL tworzące użytkownika sekretarka na localhost z hasłem zaq123","odpowiedz":"CREATE USER `sekretarka`@`localhost` IDENTIFIED BY 'zaq123';"},{"tresc":" W tabeli produkt znajdują się przedmioty wyprodukowane po 2000 roku, z polami nazwa i rok_produkcji. Klauzula SQL wyświetli listę przedmiotów wyprodukowanych","odpowiedz":"w roku 2017"},{"tresc":" W języku HTML dla hiperłącza wartość atrybutu target, która odpowiada za załadowanie strony do nowego okna lub karty, to","odpowiedz":"_blank"},{"tresc":" Dana jest tabela o nazwie wycieczki z polami: nazwa, cena, miejsca (jako liczba wolnych miejsc). Aby dla dowolnego zbioru danych tabeli wyświetlić jedynie nazwy tych wycieczek, dla których cena jest niższa niż 2000 zł i mają przynajmniej cztery wolne miejsca, należy posłużyć się zapytaniem","odpowiedz":"SELECT nazwa FROM wycieczki WHERE cena < 2000 AND miejsca > 3;"},{"tresc":" Aby w systemie MySQL nadać użytkownikowi prawo do nadawania i zmiany uprawnień innym użytkownikom należy zastosować klauzulę","odpowiedz":"GRANT OPTION"},{"tresc":"Wyszukując z tabeli Pracownicy wyłącznie nazwiska, w których ostatnią literą jest \"i\", można użyć kwerendy SQL","odpowiedz":"SELECT nazwisko FROM Pracownicy WHERE nazwisko LIKE \"%i\";"},{"tresc":"Który z formatów NIE pozwala na zapis plików animowanych?","odpowiedz":"ACE"},{"tresc":"Kod JavaScript wywołany zdarzeniem kliknięcia przycisku ma za zadanie","odpowiedz":"zamienić obraz1.gif na obraz2.gif"},{"tresc":"Która z instrukcji języka JavaScript dokona zmiany koloru tekstu na niebieski w akapicie zdefiniowanym w dokumencie HTML?","odpowiedz":"document.getElementById(\"jeden\").style.color = \"blue\";"},{"tresc":"Atrybut value w polu formularza XHTML","odpowiedz":"wskazuje odpowiedź domyślną"},{"tresc":"W języku PHP zapisano fragment kodu. Plik cookie stworzony tym poleceniem","odpowiedz":"zostanie usunięty po jednym dniu od jego utworzenia"},{"tresc":" Baza danych ma dwie tabele połączone relacją 1..n. Którą klauzulą SQL należy połączyć tabele, aby wybrać korespondujące ze sobą wartości z pól obu tabel?","odpowiedz":"JOIN"},{"tresc":" Za pomocą polecenia BACKUP LOG w MS SQL Server można","odpowiedz":"wykonać kopię bezpieczeństwa dziennika transakcyjnego"},{"tresc":" W tabeli pracownicy zdefiniowano klucz główny typu INTEGER z atrybutami NOT NULL oraz AUTO_INCREMENT. Ponadto zdefiniowano pola imie oraz nazwisko. W przypadku zastosowania przedstawionej kwerendy SQL wprowadzającej dane, w której zostało pominięte pole klucza, w bazie danych MySQL nastąpi","odpowiedz":"wpisanie rekordu do tabeli, dla klucza głównego zostanie przydzielona kolejna wartość naturalna"},{"tresc":" Liczba 0x142, zapisana w kodzie skryptu JavaScript, ma postać","odpowiedz":"szesnastkową"},{"tresc":" Dana jest tabela ksiazki z polami: tytul, autor (typu tekstowego), cena (typu liczbowego). Aby kwerenda SELECT zwróciła tylko tytuły, dla których cena jest mniejsza od 50zł, należy zapisać:","odpowiedz":"SELECT tytul FROM ksiazki WHERE cena < 50;"},{"tresc":" Przedstawiona funkcja zapisana kodem JavaScript ma za zadanie:","odpowiedz":"zwrócić wynik potęgowania a^n"},{"tresc":" Wynikiem działania pętli for w przedstawionym kodzie PHP jest wyświetlenie liczb","odpowiedz":"1 1"},{"tresc":"W języku CSS poniższy zapis sprawi, że koloru zielonego będzie","odpowiedz":"tło tekstu nagłówka drugiego stopnia"},{"tresc":"Aby za pomocą polecenia SELECT wyświetlić nazwiska osób mieszkających na osiedlu tak, aby te nazwiska nie powtarzały się, należy zapisać zapytanie w postaci","odpowiedz":"SELECT DISTINCT nazwisko FROM mieszkancy;"},{"tresc":"W języku HTML znacznik <i> nadaje znakom taki sam wizualny efekt jak znacznik","odpowiedz":"<em>"},{"tresc":"Wskaż nazwę Systemu Zarządzania Treścią, którego logo zostało przedstawione na rysunku.","odpowiedz":"Joomla!"},{"tresc":" Który zapis stylu CSS ustawi tło bloku na kolor niebieski?","odpowiedz":"div {background-color: blue;}"},{"tresc":" Dla których imion zastosowana w zapytaniu klauzula LIKE jest prawdziwa?","odpowiedz":"Arleta, Krzysztof, Krystyna, Tristan."},{"tresc":"Rozmycie Gaussa, wygładzanie, szum RGB są funkcjami programu do obróbki","odpowiedz":"Grafiki rastrowej"},{"tresc":"Liczba 0x142, zapisana w kodzie skryptu JavaScript, ma postać","odpowiedz":"szesnastkową"},{"tresc":"Funkcją agregującą zwracającą liczbę rekordów jest","odpowiedz":"COUNT"},{"tresc":"W języku CSS, należy zdefiniować tło dokumentu jako obraz rys.png. Obraz ma powtarzać się jedynie w poziomie. Którą definicję należy przypisać selektorowi body?","odpowiedz":"{background-image: url(\"rys.png\"); background-repeat: repeat-x;}"},{"tresc":" Którego ze słów kluczowych języka SQL należy użyć, aby wyeliminować duplikaty?","odpowiedz":"DISTINCT"},{"tresc":" Który z przedstawionych kodów HTML sformatuje tekst według wzoru? (uwaga: słowo \"stacji\" jest zapisane większą czcionką niż reszta słów w tej linii)","odpowiedz":"B"},{"tresc":" Do poprawnego i spójnego działania bazy danych niezbędne jest umieszczenie w każdej tabeli","odpowiedz":"klucza PRIMARY KEY z wartością NOT NULL i UNIQUE"},{"tresc":" Efektem wykonania przedstawionego kodu PHP jest wyświetlenie komunikatu","odpowiedz":"warunek2"},{"tresc":"Proces, w którym wykrywa się i usuwa błędy w kodzie źródłowym programów, to","odpowiedz":"Debugowanie"},{"tresc":"Który zapis w języku HTML jest deklaracją kodowania znaków w dokumencie?","odpowiedz":"<meta charset=\"UTF-8\">"},{"tresc":"Formatem bezstratnej kompresji dźwięku jest","odpowiedz":"FLAC"},{"tresc":"W jakim formacie należy zapisać obraz, aby mógł być wyświetlony na stronie internetowej z zachowaniem przezroczystości?","odpowiedz":"PNG"},{"tresc":"Edytując grafikę w edytorze grafiki rastrowej należy pozbyć się kolorów z rysunku tak, aby obraz był w odcieniach szarości. Można do tego efektu wykorzystać funkcję","odpowiedz":"desaturacji"},{"tresc":"Polecenie wysyłane do serwera bazy danych, polegające na zbieraniu, poszukiwaniu lub modyfikowaniu danych w bazie jest nazywane","odpowiedz":"kwerendą."},{"tresc":"Testy dotyczące skalowalności oprogramowania mają za zadanie sprawdzić, czy aplikacja","odpowiedz":"potrafi działać przy zakładanym i większym obciążeniu"},{"tresc":"Wskaż poprawną definicję kodowania polskich znaków w dokumencie HTML.","odpowiedz":"<meta charset=\"UTF-8\">"},{"tresc":" Który z paragrafów został sformatowany przedstawionym stylem zakładając, że pozostałe własności paragrafu przyjmują wartości domyślne?","odpowiedz":"C"},{"tresc":" Przedstawiony fragment dokumentu HTML z kodem JavaScript spowoduje, że po wciśnięciu przycisku","odpowiedz":"obraz2.png zostanie ukryty"},{"tresc":"Które polecenie wydane z konsoli systemowej dokona przywrócenia bazy danych?","odpowiedz":"mysql -u root -p baza < kopia.sql"},{"tresc":"Wskaż poprawną zasadę dotyczącą spójności danych w bazie danych","odpowiedz":"pole klucza podstawowego nie może być puste"},{"tresc":"Za pomocą której funkcji języka PHP można ustanowić połączenie z bazą danych o nazwie zwierzaki?","odpowiedz":"$polacz = mysqli_connect('localhost', 'root','','zwierzaki');"},{"tresc":"Obiekt typu array w języku Javascript służy do przechowywania","odpowiedz":"wielu wartości dowolnego typu"},{"tresc":"W języku HTML dla hiperłącza wartość atrybutu target, która odpowiada za załadowanie strony do nowego okna lub karty, to","odpowiedz":"_blank"},{"tresc":"Do reprezentacji liczb zmiennoprzecinkowych w języku C stosowany jest typ","odpowiedz":"double"},{"tresc":" Typ stało-znakowy w języku SQL to","odpowiedz":"char"},{"tresc":"Której funkcji edytora grafiki rastrowej należy użyć, aby przygotować rysunek do wyświetlenia na stronie w ten sposób, żeby było widoczne tylko to, co znajduje się w ramce?","odpowiedz":"Kadrowanie"},{"tresc":"Po uszkodzeniu serwera bazy danych, aby możliwie najsprawniej przywrócić działanie kompletnej bazy należy użyć","odpowiedz":"aktualnej wersji kopii zapasowej."},{"tresc":"Tworząc tabelę w języku SQL, zdefiniowano dla kolumny klucz główny. Aby zabezpieczyć ją przed wstawieniem wartości pustej, należy zastosować atrybut","odpowiedz":"NOT NULL"},{"tresc":"Kanał alfa służy do zdefiniowania","odpowiedz":"przezroczystość obiektu graficznego"},{"tresc":"Co można powiedzieć o normalizacji przedstawionej tabeli?","odpowiedz":"Tabela nie jest znormalizowana"},{"tresc":"Wskaż instrukcję równoważną do instrukcji switch zapisanej językiem PHP.","odpowiedz":"B"},{"tresc":" Wskaż sposób, w jaki należy odwołać się do pliku default.css, jeśli index.html znajduje się bezpośrednio w katalogu Strona?","odpowiedz":"<link rel=\"stylesheet\" type=\"text/css\" href=\"./style/default.css\" />"},{"tresc":" Kwerenda ma za zadanie w tabeli artykuly","odpowiedz":"zmienić typ na float dla kolumny cena."},{"tresc":" Aby podczas tworzenia tabeli utworzyć klucz obcy na wielu kolumnach, należy użyć polecenia","odpowiedz":"CONSTRAINT fk_osoba_uczen FOREIGN KEY (nazwisko, imie) REFERENCES osoby (nazwisko,imie)"},{"tresc":" Kolor zapisany w notacji heksadecymalnej #0000FF to","odpowiedz":"niebieski"},{"tresc":"Cechą formatu PNG jest","odpowiedz":"bezstratna kompresja"},{"tresc":"Funkcja JavaScript powinna być wywołana za każdym razem, gdy użytkownik wpisze dowolny znak do pola edycji. Którego zdarzenia należy użyć?","odpowiedz":"onkeydown"},{"tresc":"Które z poleceń naprawi uszkodzoną tabelę w języku SQL?","odpowiedz":"REPAIR TABLE tblname"},{"tresc":"W języku SQL klauzula DISTINCT instrukcji SELECT sprawi, że zwrócone dane","odpowiedz":"nie będą zawierały powtórzeń"},{"tresc":"Które ze stwierdzeń, w odniesieniu do zamieszczonej w ramce definicji funkcji, jest poprawne?","odpowiedz":"Wczytanie tekstu zakończy się, gdy tekst będzie się składał przynajmniej z 3 znaków"},{"tresc":" Aby strona WWW była responsywna, należy między innymi definiować","odpowiedz":"rozmiary obrazów w procentach"},{"tresc":" Wstawki kodu JavaScript w dokumencie HTML mogą się znaleźć","odpowiedz":"zarówno w cześci <head>, jak i <body>, w znaczniku <script>"},{"tresc":"Przedstawiony kod został zapisany w języku JavaScript. W podanej definicji obiektu metodą jest element o nazwie","odpowiedz":"oblicz"},{"tresc":"Na tabeli muzyka, przedstawionej na rysunku, zostało wykonane następujące zapytanie SQL. Jaki wynik zwróci ta kwerenda?","odpowiedz":"pusty wynik"},{"tresc":"Przedstawiono fragment kodu HTML, który nie waliduje się poprawnie. Błąd walidacji tego fragmentu kodu będzie dotyczył","odpowiedz":"Braku cudzysłowu"},{"tresc":"Dla każdej iteracji pętli wartość bieżącego elementu tablicy jest przypisywana do zmiennej, a wskaźnik tablicy jest przesuwany o jeden, aż do ostatniego elementu tablicy. Zdanie to jest prawdziwe dla instrukcji","odpowiedz":"foreach"},{"tresc":" W języku HTML, aby dodać animację FLASH (z rozszerzeniem .swf) na stronę internetową, należy użyć znacznika","odpowiedz":"<object>"},{"tresc":" Funkcja drzewo kontekstowe edytor WYSIWYG Adobe Dreamweaver służy do","odpowiedz":"wyświetlania interaktywnego drzewa struktury HTML dla zawartości statycznej i dynamicznej"},{"tresc":" Dana jest tabela uczniowie o polach id, nazwisko, imie, klasa. Które zapytanie SQL wyświetli liczbę osób w poszczególnych klasach oraz nazwę klasy?","odpowiedz":"SELECT COUNT(id), klasa FROM uczniowie GROUP BY klasa;"},{"tresc":" Dany jest fragment kodu PHP z zdeklarowaną zmienną typu tablicowego. W wyniku wykonania kodu zostanie wpisane imię","odpowiedz":"Krzysztof"},{"tresc":"Aby obsłużyć połączenie z bazą MySQL podczas tworzenia aplikacji internetowej, można wykorzystać język","odpowiedz":"PHP"},{"tresc":"Warunek zapisany językiem PHP wypisze liczbę, gdy","odpowiedz":"jest ona parzysta"},{"tresc":"W języku SQL, aby zmienić strukturę tabeli, np. poprzez dodanie lub usunięcie kolumny, należy zastosować polecenie","odpowiedz":"ALTER TABLE"},{"tresc":"W języku PHP, wykonując operacje na bazie danych MySQL, aby zakończyć pracę z bazą, należy wywołać","odpowiedz":"mysqli_close();"},{"tresc":" Znacznik <ins> w języku HTML służy do oznaczenia","odpowiedz":"tekstu, który został dodany"},{"tresc":" Dana jest tabela pracownicy. Polecenie MySQL usuwające wszystkie rekordy z tabeli, dla których nie wypełniono pola rodzaj_umowy, ma postać","odpowiedz":"DELETE FROM pracownicy WHERE rodzaj_umowy IS NULL;"},{"tresc":" W języku PHP, aby usunąć spacje z początku i końca ciągu znaków, można użyć funkcji","odpowiedz":"trim()"},{"tresc":"W języku SQL wykonano przedstawione w ramce polecenia GRANT. Kto będzie miał prawo do przeglądania danych oraz ich zmiany?","odpowiedz":"Tylko Tomasz"},{"tresc":"W JavaScript wywołanie zdarzenia onKeydown nastąpi wtedy, gdy klawisz","odpowiedz":"klawiatury został naciśnięty"},{"tresc":"Podane polecenie SQL ma za zadanie","odpowiedz":"zwiększyć o jeden wartość kolumny id_klasy dla wszystkich rekordów tabeli Uczen"},{"tresc":"Dana jest tabela o nazwie przedmioty z polami: ocena i uczenID. Aby policzyć średnią ocen ucznia o ID równym 7, należy posłużyć się zapytaniem","odpowiedz":"SELECT AVG(ocena) FROM przedmioty WHERE uczenID = 7;"},{"tresc":" W bazie danych hurtowni zdefiniowano tabelę sprzedaz o polach: id, kontrahent, grupa_cenowa, obrot. Aby wyszukać wyłącznie kontrahentów z drugiej grupy cenowej, których obrót jest większy niż 4000zł, należy zastosować polecenie","odpowiedz":"SELECT kontrahent FROM sprzedaz WHERE grupa_cenowa = 2 AND obrot > 4000;"},{"tresc":"Wskaż FAŁSZYWE stwierdzenie dotyczące normalizacji sygnału dźwiękowego","odpowiedz":"Jeśli najgłośniejszy fragment dźwięku osiąga połowę skali, wszystko zostanie pogłośnione razy dwa - czyli tak, aby najgłośniejszy fragment osiągnął maksimum na skali"},{"tresc":"Tabele: Klienci i Zgloszenia są powiązane relacją jeden do wielu. Aby wybrać jedynie opis zgłoszenia oraz odpowiadające mu nazwisko klienta dla zgłoszenia numer 5, należy wydać polecenie","odpowiedz":"SELECT opis, nazwisko FROM Zgloszenia JOIN Klienci ON Klienci.id = Zgloszenia.Klienci_id WHERE Zgloszenia.id = 5;"},{"tresc":"Na rysunku przedstawiono strukturę bloków strony internetowej. Który z fragmentów formatowania strony pasuje do takiego układu? (Dla uproszczenia pominięto właściwości koloru tła, wysokości i czcionki)","odpowiedz":"#pierwszy {float:left; width:30%;} #drugi {float:left; width:70%;} #trzeci {float:left; width:70%;} #czwarty {clear:both; }"},{"tresc":"Aby wskazać błędy składniowe w kodzie HTML, należy zastosować","odpowiedz":"walidator."},{"tresc":"Pętla zapisana w języku PHP wstawi do tablicy liczby","odpowiedz":"0, 10, 20, 30, 40, 50, 60, 70, 80, 90"},{"tresc":" W bazie danych MySQL polecenie CREATE USER umożliwia","odpowiedz":"utworzenie użytkownika"},{"tresc":"DOM dostarcza metod i własności, które w języku JavaScript pozwalają na","odpowiedz":"pobieranie i modyfikowanie elementów strony wyświetlonej przez przeglądarkę"},{"tresc":"Który z przedstawionych kodów XHTML sformatuje tekst według podanego wzoru?","odpowiedz":"D"},{"tresc":"Który z wymienionych znaczników języka HTML może posłużyć do budowy struktury strony internetowej?","odpowiedz":"<aside>"},{"tresc":"Przedstawiono fragment JavaScript. Po jego wykonaniu zmienna str2 będzie przechowywać","odpowiedz":"vaSc"},{"tresc":"Poprzez deklarację var x=\"true\"; w języku JavieScript tworzy się zmienną typu","odpowiedz":"String (ciąg znaków)"},{"tresc":" Tworząc tabelę w języku SQL, zdefiniowano dla kolumny klucz główny. Aby zabezpieczyć ją przed wstawieniem wartości pustej, należy zastosować atrybut","odpowiedz":"NOT NULL"},{"tresc":" Podany styl tworzy obramowanie pojedyncze, o następujących cechach:","odpowiedz":"krawędź górna jest koloru czerwonego, krawędź prawa koloru niebieskiego, krawędź dolna koloru zielonego, krawędź lewa koloru żółtego"},{"tresc":" Odpowiednia kolejność procesów przetwarzania analogowo-cyfrowego dźwięku to:","odpowiedz":"próbkowanie, kwantyzacja, kodowanie."},{"tresc":" W bazie danych samochodów pole kolor z tabeli samochody przyjmuje wartości kolorów jedynie ze słownika lakier. Aby połączyć tabele samochody i lakier relacją należy, zastosować kwerendę","odpowiedz":"ALTER TABLE samochody ADD FOREIGN KEY (kolor) REFERENCES lakier(lakierId);"},{"tresc":"Chcąc sformatować w stylach CSS wszystkie obrazy zawarte w akapicie, powinno się użyć selektora","odpowiedz":"p img"},{"tresc":"Walidacja pól formularza polega na sprawdzeniu","odpowiedz":"czy wprowadzone dane spełniają określone reguły."},{"tresc":"Komentarz w języku JavaScript rozpoczyna się od znaku lub znaków","odpowiedz":"//"},{"tresc":"W bazie danych samochodów pole kolor z tabeli samochody przyjmuje wartości kolorów jedynie ze słownika lakier. Aby połączyć tabele samochody i lakier relacją należy, zastosować kwerendę","odpowiedz":"ALTER TABLE samochody ADD FOREIGN KEY (kolor) REFERENCES lakier(lakierId);"},{"tresc":"W języku PHP zapisano fragment kodu działającego na bazie MySQL. Jego zadaniem jest wypisanie","odpowiedz":"miasta i kodu pocztowego z pierwszego zwróconego rekordu"},{"tresc":" W języku CSS, przedstawiony zapis sprawi, że plik rysunek.png będzie","odpowiedz":"tłem każdego paragrafu"},{"tresc":" Jakie należy posiadać uprawnienia, aby wykonać i odtworzyć kopię zapasową bazy danych Microsoft SQL Server 2005 Express?","odpowiedz":"Administrator systemu"},{"tresc":" Przedstawiono fragment kodu HTML, który nie waliduje się poprawnie. Błąd walidacji tego fragmentu kodu będzie dotyczył","odpowiedz":"Braku cudzysłowu"},{"tresc":"W języku C, aby zadeklarować stałą, należy użyć","odpowiedz":"const"},{"tresc":"Z jakimi mechanizmami nadawania zabezpieczeń, dającymi możliwości wykonywania operacji na bazie danych, związane są zagadnienia zarządzania kontami, użytkownikami i uprawnieniami?","odpowiedz":"Z przywilejami systemowymi"},{"tresc":"W tabeli personel znajdują się pola: imie, nazwisko, pensja, staz. Aby otrzymać średnią pensję pracowników, dla których staż wynosi od 10 do 20 lat pracy włącznie, należy wykonać kwerendę:","odpowiedz":"SELECT AVG(pensja) FROM personel WHERE staz >= 10 AND staz <= 20;"},{"tresc":"Tabela filmy zawiera klucz główny id oraz klucz obcy rezyserID. Tabela rezyserzy zawiera klucz główny id. Obydwie tabele połączone są relacją jeden po stronie rezyserzy do wielu po stronie filmy. Aby w kwerendzie SELECT połączyć tabele filmy i rezyserzy, należy zapisać","odpowiedz":"... filmy JOIN rezyserzy ON filmy.rezyserID = rezyserzy.id ..."},{"tresc":" Która z reguł walidacji strony internetowej jest błędna?","odpowiedz":"Jeżeli w instrukcji używa się kilku atrybutów, ich kolejność powinna być zgodna z alfabetem, np. <img alt=\"....\" src=\"....\" />"},{"tresc":" W kodzie HTML kolor biały można zapisać za pomocą wartości","odpowiedz":"rgb(255,255,255)"},{"tresc":" W języku CSS wcięcie pierwszej linii akapitu na 30 pikseli uzyska się za pomocą zapisu","odpowiedz":"p { text-indent: 30px; }"},{"tresc":"Przekierowanie 301 służące przekierowaniu użytkownika z jednego adresu URL na inny można ustawić w pliku konfiguracji serwera Apache o nazwie","odpowiedz":".htaccess"},{"tresc":"Które polecenie SQL zamieni w tabeli tab w kolumnie kol wartość Ania na Zosia?","odpowiedz":"UPDATE tab SET kol='Zosia' WHERE kol='Ania';"},{"tresc":"Po wykonaniu zamieszczonego w ramce skryptu napisanego w języku JavaScript w przeglądarce zostanie wypisana wartość","odpowiedz":"12,5"},{"tresc":"W języku PHP instrukcja foreach jest instrukcją","odpowiedz":"Pętli, wyłącznie dla elementów tablicy"},{"tresc":" Instrukcja przypisania elementu do tablicy w języku JavaScript dotyczy tablicy","odpowiedz":"asocjacyjnej"},{"tresc":" Jeśli rozmiar pliku graficznego jest zbyt duży do publikacji w Internecie, należy","odpowiedz":"zmniejszyć jego rozdzielczość"},{"tresc":"Systemem zarządzania treścią pozwalającym na łatwe utworzenie i aktualizację serwisu WWW jest","odpowiedz":"CMS"},{"tresc":"Aby strona WWW była responsywna, należy między innymi definiować","odpowiedz":"rozmiary obrazów w procentach"},{"tresc":"Jaki rezultat zostanie wyświetlony po wykonaniu przedstawionego kodu HTML?","odpowiedz":"D"},{"tresc":"Jaka wartość zostanie wypisana na standardowym wyjściu dla zamieszczonego w ramce fragmentu programu napisanego w języku C++","odpowiedz":"3"},{"tresc":"Przedstawiony zapis w języku JavaScript oznacza, że","odpowiedz":"zmienna x będzie przechowywać wynik działania metody nazwa."},{"tresc":"W języku PHP wykonano operację przedstawioną w ramce. Aby wyświetlić wszystkie wyniki tego zapytania należy","odpowiedz":"zastosować pętlę z poleceniem mysqli_fetch_row"},{"tresc":" Które z poniższych zdań dotyczących zasad programowania w języku PHP jest prawdziwe?","odpowiedz":"Jest to język o słabej kontroli typów"},{"tresc":" Który z wymienionych znaczników języka HTML może posłużyć do budowy struktury strony internetowej?","odpowiedz":"<aside>"},{"tresc":"Które ze stwierdzeń dotyczących klucza podstawowego jest prawdziwe?","odpowiedz":"Jest unikalny w obrębie tabeli"},{"tresc":"Którą klauzulę powinno się zastosować w poleceniu CREATE TABLE języka SQL, aby dane pole rekordu nie było puste?","odpowiedz":"NOT NULL"},{"tresc":"W poleceniu CREATE TABLE języku SQL atrybut określający, która kolumna tabeli jest kluczem podstawowym, to","odpowiedz":"PRIMARY KEY"},{"tresc":"W języku HTML aby zdefiniować słowa kluczowe strony, należy użyć zapisu","odpowiedz":"<meta name=\"keywords\" content=\"psy, koty, gryzonie\">"},{"tresc":"Zmienne typu int odnoszą się do liczb","odpowiedz":"całkowitych"},{"tresc":" Jak nazywa się proces przedstawienia, we właściwej dla danego środowiska formie, informacji zawartej w dokumencie elektronicznym?","odpowiedz":"Renderowanie"},{"tresc":" Która z deklaracji funkcji w języku C++ ma parametr wejściowy typu rzeczywistego, a zwraca wartość całkowitą?","odpowiedz":"int fun1(float a);"},{"tresc":"W języku CSS, zapis w następującej postaci sprawi, iż koloru czerwonego będzie","odpowiedz":"pierwsza litera nagłówka pierwszego stopnia"},{"tresc":"Który z formatów zapewnia największa redukcję rozmiaru pliku dźwiękowego?","odpowiedz":"MP3"},{"tresc":"W celu uzyskania efektu widocznego na rysunku, w kodzie HTML, należy umieścić znacznik skrótu <abbr> z atrybutem","odpowiedz":"title"},{"tresc":" Składowymi modelu barw CMYK są kolory:","odpowiedz":"cyjan, magenta, żółty i czarny."},{"tresc":"W języku HTML, aby utworzyć pole edycyjne do wpisywania hasła, w którym wpisywany tekst jest maskowany (zastępowany kropkami), należy użyć znacznika","odpowiedz":"<input type=\"password\" />"},{"tresc":"Zakładając, że zmienna tablicowa $tab jest wypełniona liczbami naturalnymi, wynikiem programu będzie wypisanie","odpowiedz":"największego elementu tablicy"},{"tresc":"Bitmapa jest obrazem","odpowiedz":"rastrowym"},{"tresc":" Aby skorzystać ze skryptu zapisanego w pliku przyklad.js, należy połączyć go ze stroną za pomocą kodu","odpowiedz":"<script src=\"przyklad.js\"></script>"},{"tresc":"Pole insert_id zdefiniowane w bibliotece MySQLi języka PHP może być wykorzystane do","odpowiedz":"otrzymania id ostatnio wstawionego wiersza."},{"tresc":"Tabela o nazwie naprawy zawiera pola: klient, czyNaprawione. Aby usunąć te rekordy, w których pole czyNaprawione jest prawdą, należy posłużyć się poleceniem","odpowiedz":"DELETE FROM naprawy WHERE czyNaprawione = TRUE;"},{"tresc":"Wśród czterech podstawowych kolorów modelu barw CMYK jest","odpowiedz":"czarny."},{"tresc":"Jaką wartość przyjmie zmienna x po wykonaniu kodu PHP przedstawionego w ramce?","odpowiedz":"Liczby wierszy przetworzonych zapytaniem DELETE FROM"},{"tresc":" Obiektem służącym w bazie danych do podsumowywania, wyświetlania i wydruków danych jest","odpowiedz":"raport"},{"tresc":" Wskaż zapytanie SQL tworzące użytkownika sekretarka na localhost z hasłem zaq123","odpowiedz":"CREATE USER `sekretarka`@`localhost` IDENTIFIED BY 'zaq123';"},{"tresc":"Który kod języka HTML da efekt formatowania jak na przedstawionym rysunku?","odpowiedz":"<p>W tym <i>paragrafie <b>zobaczysz</b> sposoby formatowania</ i> tekstu w HTML</p>"},{"tresc":"Które metody odnoszą się do predefiniowanego obiektu Date w języku JavaScript?","odpowiedz":"getMonth() oraz getDay()"},{"tresc":"Weryfikację kompletności formularza, działającą po stronie przeglądarki, należy zrealizować w języku","odpowiedz":"JavaScript"},{"tresc":"Jakiego rodzaju mechanizm kontroli bezpieczeństwa wykonywania aplikacji zawiera środowisko uruchomieniowe platformy .NET Framework?","odpowiedz":"Mechanizm wykonywania aplikacji oparty na uprawnieniach kodu (CAS - Code Access Security) i na rolach (RBS - Role-Based Security)"},{"tresc":"W bazie danych zdefiniowano tabelę Mieszkancy wypełnioną danymi. Aby usunąć tę tabelę wraz z zawartością, należy posłużyć się poleceniem","odpowiedz":"DROP TABLE Mieszkancy;"},{"tresc":" Które wyrażenie logiczne w języku PHP sprawdza, czy zmienna1 należy do przedziału jednostronnie domkniętego <-5, 10)?","odpowiedz":"$zmienna1 >= -5 && $zmienna1 < 10"},{"tresc":" Za pomocą którego polecenia SQL można usunąć z tabeli artykuly wiersze zawierające słowo \"sto\" znajdujące się w dowolnym miejscu pola tresc?","odpowiedz":"DELETE FROM artykuly WHERE tresc LIKE \"%sto%\";"},{"tresc":" Tworzenie i przypisanie do zmiennej tablicy asocjacyjnej zrealizuje się w PHP zapisem","odpowiedz":"$tab = array (\"a\" => 1, \"b\" => 2, \"c\" => 3);"},{"tresc":" Wskaż FAŁSZYWE stwierdzenie dotyczące normalizacji sygnału dźwiękowego","odpowiedz":"Jeśli najgłośniejszy fragment dźwięku osiąga połowę skali, wszystko zostanie pogłośnione razy dwa - czyli tak, aby najgłośniejszy fragment osiągnął maksimum na skali"},{"tresc":"Aby dostosować stronę internetową dla niewidomych, należy nadać wyświetlanym za pomocą znacznika img obrazom atrybut","odpowiedz":"alt"},{"tresc":"Dana jest tabela psy o polach: imie, rasa, telefon_wlasciciela, rok_szczepienia. Aby wyszukać telefony właścicieli, których psy były szczepione przed 2015 rokiem, należy użyć polecenia SQL","odpowiedz":"SELECT telefon_wlasciciela FROM psy WHERE rok_szczepienia < 2015"},{"tresc":" Aby prawidłowo udokumentować przedstawioną linię kodu języka JavaScript, należy po znakach // wpisać komentarz","odpowiedz":"wyświetlenie daty i czasu w znaczniku o id = napis"},{"tresc":" Poniżej przedstawiono fragment kodu języka HTML. Jest on definicją listy:","odpowiedz":"C"},{"tresc":"W języku PHP operatorem reszty z dzielenia jest:","odpowiedz":"%"},{"tresc":"Wskaż dwa sposoby zabezpieczenia bazy danych Microsoft Access","odpowiedz":"Ustalanie hasła do otwarcia bazy danych oraz zabezpieczeń na poziomie użytkownika"},{"tresc":"W języku SQL, aby stworzyć tabelę, należy zastosować polecenie","odpowiedz":"CREATE TABLE"},{"tresc":" Wskaż wynik wykonania przedstawionego kodu PHP, jeżeli zmienna tab jest tablicą.","odpowiedz":"sarny dziki"},{"tresc":"Znacznik języka HTML, który służy do dynamicznego tworzenia grafiki na stronie internetowej bez osadzania dodatkowych plików, to","odpowiedz":"<canvas>"},{"tresc":"W JavaScript wynik operacji jest równy wartości NaN, jeśli skrypt próbował wykonać","odpowiedz":"działanie arytmetyczne, a zawartość zmiennej była napisem"},{"tresc":"Aby w języku CSS ustawić czerwony kolor dla tekstu można użyć stylu","odpowiedz":"color: rgb(255,0,0);"},{"tresc":" Przekierowanie 301 służące przekierowaniu użytkownika z jednego adresu URL na inny można ustawić w pliku konfiguracji serwera Apache o nazwie","odpowiedz":".htaccess"},{"tresc":" Aby odebrać prawa dostępu do serwera MySQL, należy posłużyć się instrukcją","odpowiedz":"REVOKE"},{"tresc":" Przedstawione polecenie SQL, użytkownikowi adam@localhost nadaje prawa","odpowiedz":"manipulowania danymi w tabeli klienci"},{"tresc":" Platforma wspierająca programowanie w technologii .NET to","odpowiedz":"framework"},{"tresc":"Jaki wynik zwróci zapytanie z ramki wykonane na przedstawionej tabeli?","odpowiedz":"3"},{"tresc":"W języku JavaScript zapisano kod, którego wynikiem działania jest","odpowiedz":"wyświetlenie okna z polem edycyjnym, w którym jest wpisany domyślny tekst \"Adam\""},{"tresc":" Użytkownik wprowadził adres nieistniejącego zasobu na serwerze. Próba połączenia wygeneruje błąd","odpowiedz":"404"},{"tresc":" Formularz, którego fragment przedstawiono, został obsłużony w skrypcie PHP. Wskaż prawidłowo zapisane pobranie wartości wprowadzonej do pola edycyjnego.","odpowiedz":"$name = $_POST['imie'];"},{"tresc":" Zapis w języku JavaScript ma za zadanie","odpowiedz":"utworzenie obiektu napis1 klasy napisy"},{"tresc":" Projektowanie logicznego układu witryny polega na","odpowiedz":"rozmieszczeniu elementów w konkretnych miejscach witryny"},{"tresc":" Dla dowolnego a z przedziału (0,99) zadaniem funkcji zapisanej w języku Java Script jest:","odpowiedz":"wypisanie liczb z przedziału a...100 i zwrócenie wartości zmiennej n"},{"tresc":"Dana jest tabela programiści o polach: id, nick, ilosc_kodu, ocena. Pole ilosc_kodu zawiera liczbę linii kodu napisanych przez programistę w danym miesiącu. Aby policzyć sumę linii kodu, który napisali wszyscy programiści, należy użyć polecenia","odpowiedz":"SELECT SUM(ilosc_kodu) FROM programisci;"},{"tresc":"W języku PHP sumę logiczną oznacza operator","odpowiedz":"||"},{"tresc":" Zapis znacznika HTML w postaci","odpowiedz":"jest poprawny, po wybraniu odnośnika aktualna strona zostanie przewinięta do elementu o nazwie \"hobby\""},{"tresc":"Zamieszczony kod HTML formularza zostanie wyświetlony przez przeglądarkę w sposób:","odpowiedz":"D"},{"tresc":"W części nagłówkowej kodu HTML zapisano tekst przedstawiony na obrazku. Zapisany tekst zostanie wyświetlony","odpowiedz":"na pasku tytułu przeglądarki"},{"tresc":"Przedstawione formatowanie CSS sprawi, że dla prezentowanego nagłówka trzeciego stopnia","odpowiedz":"tło będzie pomarańczowe"},{"tresc":" Ile iteracji będzie miała przedstawiona pętla zapisana w języku PHP, zakładając, że zmienna sterująca nie jest modyfikowana we wnętrzu pętli?","odpowiedz":"11"},{"tresc":" Wskaż poprawną definicję kodowania polskich znaków w dokumencie HTML.","odpowiedz":"<meta charset=\"UTF-8\">"},{"tresc":"W skład typowego frameworka wchodzą","odpowiedz":"zarządzanie komunikacją z bazą danych, mechanizm uruchamiania i przetwarzania akcji"},{"tresc":"W którym z przypadków walidacja fragmentu kodu CSS przebiegnie pomyślnie?","odpowiedz":"p { font-weight:bold; }"},{"tresc":"Przedstawiona funkcja zapisana kodem JavaScript ma za zadanie:","odpowiedz":"zwrócić wynik potęgowania a^n"},{"tresc":"Zadaniem przedstawionej pętli jest","odpowiedz":"utworzenie dziesięciu obiektów typu Ksiazka."},{"tresc":" W języku JavaScript metoda document.getElementById(id) ma za zadanie","odpowiedz":"zwrócić odniesienie do pierwszego elementu HTML o podanym id"},{"tresc":" Aby wykonać kod zapisany językiem PHP wystarczy, że w systemie zainstalowano","odpowiedz":"serwer WWW z interpreterem PHP"},{"tresc":"Za pomocą którego zapisu zostanie utworzony w dokumencie HTML element wyświetlający obraz kotek.jpg z tekstem alternatywnym \"obrazek kotka\"?","odpowiedz":"<img src=\"kotek.jpg\" alt=\"obrazek kotka\">"},{"tresc":" Które polecenie wydane z konsoli systemu operacyjnego, zawierające w swojej składni opcję --repair, umożliwia naprawę bazy danych?","odpowiedz":"mysqlcheck"},{"tresc":" Który znacznik należy do znaczników definiujących listy w języku HTML?","odpowiedz":"<ul>"},{"tresc":" Wskaż poprawną zasadę dotyczącą spójności danych w bazie danych","odpowiedz":"pole klucza podstawowego nie może być puste"},{"tresc":"Który z formatów graficznych pozwala na zapis przejrzystego tła?","odpowiedz":"GIF"},{"tresc":"Podstawowym zadaniem systemu CMS jest oddzielenie treści serwisu informacyjnego od jego wyglądu. Efekt ten jest uzyskany poprzez generowanie zawartości","odpowiedz":"z bazy danych oraz wyglądu ze zdefiniowanego szablonu"},{"tresc":"Zadaniem przedstawionej funkcji zapisanej w języku JavaScript jest","odpowiedz":"wypisanie liczb parzystych z przedziału od a do b"},{"tresc":" W którym standardzie języka hipertekstowego zostały wprowadzone do składni znaczniki sekcji <footer>, <header>, <nav>?","odpowiedz":"HTML5"},{"tresc":"W języku HTML, aby zapisać sekcję cytatu, która może zawierać kilka paragrafów tak, by przeglądarka dodała wspólne wcięcie, należy zastosować znacznik","odpowiedz":"<blockquote>"},{"tresc":"W ramce przedstawiono właściwości pliku graficznego. W celu optymalizacji czasu ładowania rysunku na stronę WWW należy","odpowiedz":"zmniejszyć wymiary rysunku"},{"tresc":"Jakie uprawnienia będzie miał użytkownik jan po wykonaniu na bazie danych przedstawionych poleceń?","odpowiedz":"Będzie mógł zmienić strukturę tabeli klienci"},{"tresc":"Pojęcie \"front-end\" stosowane w kontekście tworzenia stron WWW odnosi się do","odpowiedz":"interfejsu strony internetowej związanego z technologiami działającymi po stronie przeglądarki internetowej."},{"tresc":"W języku CSS zdefiniowano następujące formatowanie. Kolorem czerwonym zostanie zapisany","odpowiedz":"tylko tekst pochylony nagłówka pierwszego stopnia"},{"tresc":"Jeśli rozmiar pliku graficznego jest zbyt duży do publikacji w Internecie, należy","odpowiedz":"zmniejszyć jego rozdzielczość"},{"tresc":" W języku SQL, aby stworzyć tabelę, należy zastosować polecenie","odpowiedz":"CREATE TABLE"},{"tresc":"Na rysunku pokazano schemat rozmieszczenia bloków na stronie WWW, w której jego części umieszcza się zwykle stopkę strony?","odpowiedz":"5"},{"tresc":"Relacja w bazach danych jest","odpowiedz":"logicznym połączeniem tabel"},{"tresc":"Kolor zapisany kodem RGB o wartości rgb(128, 16, 8) w postaci szesnastkowej ma wartość","odpowiedz":"#801008"},{"tresc":"Które z zapytań SQL, wybiera nazwiska z tabeli klient, które są minimum jednoliterowe i rozpoczynają się od litery Z?","odpowiedz":"SELECT nazwisko FROM klient WHERE nazwisko LIKE 'Z%';"},{"tresc":"W edytorze grafiki wektorowej stworzono przedstawiony kształt, który powstał z dwóch figur: trójkąta i koła. W celu stworzenia tego kształtu, po narysowaniu figur i odpowiednim ich ustawieniu, należy skorzystać z funkcji","odpowiedz":"sumy"},{"tresc":"W języku CSS aby zdefiniować odmienne formatowanie dla pierwszej litery akapitu, należy zastosować selektor","odpowiedz":"pseudoelementu p::first-letter"},{"tresc":"Jakie należy posiadać uprawnienia, aby wykonać i odtworzyć kopię zapasową bazy danych Microsoft SQL Server 2005 Express?","odpowiedz":"Administrator systemu"},{"tresc":" Wskaż poprawne stwierdzenie dotyczące przedstawionego kodu HTML.","odpowiedz":"Kod może nie działać w przeglądarce, jeśli nie obsługuje ona HTML5."},{"tresc":"Który znacznik lub grupa znaczników nie są stosowane do definiowania struktury strony HTML?","odpowiedz":"<i>, <b>, <u>"},{"tresc":"W programie Microsoft Access formą zabezpieczeń dostępu do danych związaną z tabelą i kwerendą jest","odpowiedz":"przypisanie uprawnień"},{"tresc":"Funkcja agregująca AVG użyta w zapytaniu ma za zadanie","odpowiedz":"obliczyć średnią arytmetyczną cen wszystkich usług."},{"tresc":"Aby utworzyć relację jeden do wielu, w tabeli po stronie wiele, należy zdefiniować","odpowiedz":"klucz obcy wskazujący na klucz podstawowy tabeli po stronie jeden"},{"tresc":"Pętla while powinna być wykonywana tak długo, jak długo zmienna x będzie przyjmowała wartości z przedziału obustronnie otwartego (-2, 5). Zapis tego warunku w nagłówku pętli za pomocą języka PHP ma postać","odpowiedz":"($x > -2) && ($x < 5)"},{"tresc":"Z którym ze słów kluczowych programowania obiektowego w języku JavaScript wiąże się dostęp do pól i metod tylko z poziomu klasy, w której są zdefiniowane?","odpowiedz":"private"},{"tresc":" Najprostszy sposób zamiany obiektu oznaczonego cyfrą 1 na obiekt oznaczony cyfrą 2 polega na","odpowiedz":"geometrycznym transformowaniu obiektu"},{"tresc":"Wykonanie kodu JavaScript w przeglądarce wymaga","odpowiedz":"interpretowania"},{"tresc":"Której właściwości CSS należy użyć, aby zdefiniować marginesy wewnętrzne dla elementu?","odpowiedz":"padding"},{"tresc":"Aby edytować dane w bazie danych można posłużyć się","odpowiedz":"formularzem."},{"tresc":"Która z zasad tworzenia części <head> języka HTML jest poprawna?","odpowiedz":"W części <head> mogą wystąpić znaczniki <meta>, <title>, <link>"},{"tresc":"Kwerenda ma za zadanie w tabeli artykuly","odpowiedz":"zmienić typ na float dla kolumny cena."},{"tresc":"W języku HTML atrybut shape znacznika area, określający typ obszaru, może przyjąć wartość","odpowiedz":"rect, poly, circle"},{"tresc":" W języku JavaScript podany w ramce fragment funkcji ma za zadanie","odpowiedz":"policzyć sumę wszystkich elementów tablicy"},{"tresc":"Funkcja COUNT języka SQL realizuje","odpowiedz":"zliczanie rekordów wybranych kwerendą."},{"tresc":"W przedstawionym diagramie bazy danych biblioteka, elementy: czytelnik, wypozyczenie i ksiazka są","odpowiedz":"encjami"},{"tresc":"W języku SQL, aby wstawić wiersz danych do bazy, należy zastosować polecenie","odpowiedz":"INSERT INTO"},{"tresc":" Który z kodów HTML opisuje przedstawioną tabelę? (Dla uproszczenia pominięto zapis stylu obramowania tabeli i komórek)","odpowiedz":"B"},{"tresc":"Automatyczna weryfikacja właściciela strony udostępnianej przez protokół HTTPS jest możliwa dzięki","odpowiedz":"certyfikatowi SSL"},{"tresc":"Baza danych MySQL uległa uszkodzeniu. Które z działań NIE pomoże przy jej naprawie?","odpowiedz":"Wykonanie replikacji bazy danych"},{"tresc":"Która z przedstawionych grup znaczników HTML zawiera znaczniki służące do grupowania elementów i tworzenia struktury dokumentu?","odpowiedz":"div, article, header"},{"tresc":"W załączonym fragmencie kodu CSS kolor jest zapisany w postaci","odpowiedz":"szesnastkowej"},{"tresc":"W języku HTML aby zdefiniować poziomą linię, należy użyć znacznika","odpowiedz":"<hr>"},{"tresc":"Kod języka CSS można umieścić wewnątrz kodu HTML, posługując się znacznikiem","odpowiedz":"<style>"},{"tresc":"Aby wyświetlić jedynie imię, nazwisko i ulicę wszystkich mieszkańców, należy zastosować zapytanie","odpowiedz":"SELECT imie, nazwisko, ulica FROM Mieszkancy JOIN Adresy ON Mieszkancy.Adresy_id = Adresy.id;"},{"tresc":"W stylach CSS, aby ustalić styl linii obramowania jako linię kreskową, należy zastosować wartość","odpowiedz":"dashed"},{"tresc":" Narzędziem służącym do grupowania i prezentowania informacji z wielu rekordów w celu ich drukowania lub rozpowszechniania jest","odpowiedz":"raport"},{"tresc":"Wskaż wynik wykonania skryptu napisanego w języku PHP","odpowiedz":"A"},{"tresc":"W języku HTML atrybut alt znacznika img jest wykorzystywany w celu zdefiniowania","odpowiedz":"tekstu, który będzie wyświetlony, jeśli nie może być wyświetlona grafika"},{"tresc":" W języku HTML, aby nadać dokumentowi tytuł \"Moja strona\", który będzie wyświetlany na zakładce przeglądarki internetowej, należy posłużyć się zapisem","odpowiedz":"<title>Moja strona</title>"},{"tresc":"Rozwinięcie słowne akronimu ACID w SQL to","odpowiedz":"atomic, consistent, isolated, durable."},{"tresc":"Który z formatów grafiki jest najbardziej odpowiedni do zapisu obrazu z przezroczystością na potrzeby strony internetowej?","odpowiedz":"PNG"},{"tresc":"W strukturalnych językach programowania w celu przechowania informacji o 50 uczniach (ich imionach, nazwiskach, średniej ocen) należy użyć","odpowiedz":"tablicy 50 elementów o składowych strukturalnych"},{"tresc":"Która z wymienionych funkcji zapisanych językiem PHP zwraca sumę połowy a i połowy b","odpowiedz":"function licz($a, $b) {return $a/2 + $b/2;}"},{"tresc":" W języku PHP, aby prawidłowo obsłużyć połączenie z bazą danych MySQL, ostatnią operacją, powinno być zastosowanie polecenia","odpowiedz":"mysqli_close"},{"tresc":"Ile maksymalnie należy użyć znaczników <td> w tabeli o trzech kolumnach i trzech wierszach niezawierającej złączeń komórek i wiersza nagłówkowego?","odpowiedz":"9"},{"tresc":"W palecie kolorów RGB kolor żółty jest połączeniem dwóch kolorów: zielonego i czerwonego. Który z kodów szesnastkowych oznacza kolor żółty?","odpowiedz":"#FFFF00"},{"tresc":"Działaniem przedstawionego kodu PHP jest wypełnienie tablicy","odpowiedz":"10 losowymi wartościami, a następnie wypisanie wartości ujemnych."},{"tresc":"Który zestaw pojęć definiuje interfejs użytkownika strony internetowej?","odpowiedz":"Przyciski, menu, interakcja użytkownika z aplikacją."},{"tresc":"Selektor CSS a:link {color:red} zawarty w kaskadowych arkuszach stylów definiuje","odpowiedz":"pseudoklasę"},{"tresc":"W bazie danych sklepu istnieją dwie tabele powiązane relacją: produkty oraz oceny. Tabela oceny zawiera dowolną liczbę ocen klientów dla danego produktu opisaną polami: id, ocena (pole numeryczne), produktID (klucz obcy). Aby wskazać maksymalną ocenę dla produktu o ID równym 10, należy posłużyć się zapytaniem","odpowiedz":"SELECT MAX(ocena) FROM oceny WHERE produktID = 10;"},{"tresc":"W języku CSS zdefiniowano styl. Sformatowana stylem sekcja będzie zawierała obramowanie o szerokości","odpowiedz":"2 px oraz marginesy na zewnątrz tego obramowania"},{"tresc":"Która z instrukcji umożliwia wysłanie tekstu do przeglądarki?","odpowiedz":"echo"},{"tresc":"Które z zadań programistycznych powinno być wykonane po stronie serwera?","odpowiedz":"Zapisanie danych pobranych z aplikacji internetowej w bazie danych"},{"tresc":" Na rysunku przedstawiono dwie tabele. Aby połączyć je relacją jeden do wielu, jeden po stronie Klienci wiele po stronie Zamowienia, należy","odpowiedz":"Dodać pole klucza obcego do tabeli Zamowienia i połączyć je z ID tabeli Klienci"},{"tresc":" Który zapis znacznika <div> może wystąpić w dokumencie HTML tylko jeden raz, a ponowne użycie tego zapisu spowoduje wygenerowanie błędów podczas walidacji dokumentu?","odpowiedz":"<div id=\"identyfikator\">"},{"tresc":"Za pomocą polecenia ALTER TABLE można","odpowiedz":"zmienić strukturę tabeli"},{"tresc":"Przedstawiony kod źródłowy, zapisany w języku C++, ma za zadanie dla wprowadzanych dowolnych całkowitych liczb różnych od zera wypisać","odpowiedz":"tylko liczby parzyste"},{"tresc":" Po wykonaniu się przedstawionego fragmentu kodu języka C/C++ zmiennej o nazwie zmienna2 zostanie","odpowiedz":"przypisany adres zmiennej o nazwie zmienna1"},{"tresc":"Wskaż poprawne stwierdzenie dotyczące przedstawionego kodu HTML.","odpowiedz":"Kod może nie działać w przeglądarce, jeśli nie obsługuje ona HTML5."},{"tresc":"W języku HTML atrybutem znacznika video, który włącza tryb odtwarzania w kółko, jest","odpowiedz":"loop"},{"tresc":"Debugger to oprogramowanie, którego zadaniem jest","odpowiedz":"dynamiczna analiza uruchomionego programu w celu wykrycia przyczyn nieprawidłowego działania."},{"tresc":"Które polecenie w CSS służy do załączenia zewnętrznego arkusza stylów?","odpowiedz":"import"},{"tresc":"Wskaż stwierdzenie, które jest prawdziwe dla następującej definicji stylu:","odpowiedz":"Zdefiniowano dwie klasy"},{"tresc":"W kodzie CSS zastosowano formatowanie elementu listy, przy czym żadne inne formatowanie CSS nie zostało zdefiniowane. Zastosowane formatowanie sprawi, że","odpowiedz":"po najechaniu kursorem na element listy, zmieni się kolor tekstu na Maroon."},{"tresc":"W języku SQL wykorzystywanym przez bazę danych MySQL atrybut UNIQUE polecenia CREATE TABLE","odpowiedz":"Jest stosowany, jeśli wartość w kolumnie nie mogą się powtarzać"},{"tresc":"Barwa zapisana w modelu RGB(255, 0, 0) jest","odpowiedz":"czerwona"},{"tresc":"Kwerenda pozwalająca na wprowadzenie zmian w wielu rekordach lub przeniesienie wielu rekordów przy użyciu pojedynczej operacji, nosi nazwę kwerendy","odpowiedz":"funkcjonalnej"},{"tresc":"W językach programowania tylko zmienna jednego typu wbudowanego może przyjmować wyłącznie dwie wartości. Jest to typ","odpowiedz":"logiczny"},{"tresc":"Wskaż stwierdzenie, które nie jest prawdziwe dla następującej definicji funkcji w języku C++?","odpowiedz":"Funkcja zwraca wartość"},{"tresc":"Zdarzenie JavaScript, będące reakcją na pojedynczo kliknięty dowolny element strony, nosi nazwę","odpowiedz":"onClick"},{"tresc":"Hermetyzacja to zasada programowania obiektowego mówiąca o tym, że","odpowiedz":"pola i metody wykorzystywane tylko przez daną klasę/obiekt są ograniczone zasięgiem private lub protected"},{"tresc":"Jaka treść komunikatu powinna być wstawiona w przedstawionym kodzie PHP zamiast znaków zapytania?","odpowiedz":"Błąd połączenia z serwerem SQL"},{"tresc":"W języku CSS wartości: underline, overline, line-through oraz blink dotyczą właściwości","odpowiedz":"text-decoration"},{"tresc":"Podczas obróbki grafiki rastrowej w programie z obsługą kanałów dodanie kanału alfa oznacza","odpowiedz":"dodanie warstwy z przezroczystością"},{"tresc":" W języku PHP chcąc wyświetlić ciąg n znaków @, należy użyć funkcji","odpowiedz":"D"},{"tresc":" W JavaScript wywołanie zdarzenia onKeydown nastąpi wtedy, gdy klawisz","odpowiedz":"klawiatury został naciśnięty"},{"tresc":" Jaka wartość zostanie wypisana na standardowym wyjściu dla zamieszczonego w ramce fragmentu programu napisanego w języku C++","odpowiedz":"3"},{"tresc":" Programista napisał w języku C++ pętlę, która miała obliczyć wynik działania 5! (5! = 1 * 2 * 3 * 4 * 5). Popełnił jednak błąd logiczny polegający na tym, że","odpowiedz":"w drugim parametrze pętli powinno być porównanie i < 6 zamiast i < 5"},{"tresc":"Który typ należy zastosować, aby pole bazy danych przyjmowało liczby rzeczywiste?","odpowiedz":"FLOAT"},{"tresc":"Działaniem przedstawionego kodu PHP będzie wypełnienie tablicy","odpowiedz":"10 losowymi wartościami, a następnie wypisanie wartości ujemnych"},{"tresc":" Które metody odnoszą się do predefiniowanego obiektu Date w języku JavaScript?","odpowiedz":"getMonth() oraz getDay()"},{"tresc":" Przeglądarka internetowa wyświetliła stronę w następujący sposób. Wskaż kod HTML, który poprawnie definiuje przedstawioną hierarchiczną strukturę tekstu:","odpowiedz":"<h1>Rozdział 1</h1> <p>tekst</p> <h2>Podrozdział 1.1</h2> <p>tekst</p> <h2>Podrozdział 1.2</h2>"},{"tresc":"Testy wydajnościowe mają na celu sprawdzenie","odpowiedz":"stopnia spełnienia wymagań wydajnościowych przez system lub moduł"},{"tresc":"Prawidłowy, zgodny ze standardem języka XHTML, zapis samozamykającego się znacznika odpowiadającego za łamanie linii ma postać","odpowiedz":"<br />"},{"tresc":"W podanym kodzie HTML przedstawiony styl CSS jest stylem","odpowiedz":"lokalnym"},{"tresc":"Sposób programowania, w którym ciąg poleceń (sekwencji instrukcji) przekazywanych komputerowi jest postrzegany jako program, nosi nazwę programowania","odpowiedz":"imperatywnego"},{"tresc":"W języku PHP, dla zmiennych a = 5 i b = 3 wartość typu zmiennoprzecinkowego zwróci wyrażenie","odpowiedz":"a / b"},{"tresc":"Do uruchomienia systemu CMS Joomla! wymagane jest środowisko:","odpowiedz":"Apache, PHP i MySQL"},{"tresc":"Który ze sposobów komentowania kodu nie jest stosowany w kodzie PHP?","odpowiedz":"<!-- komentarz -->"},{"tresc":" Zapytanie z klauzulą JOIN stosuje się, aby","odpowiedz":"uzyskać wyniki z dwóch tabel pozostających ze sobą w relacji"},{"tresc":"W języku JavaScript, aby sprawdzić warunek czy liczba znajduje się w przedziale (100;200>, należy zapisać:","odpowiedz":"if (liczba > 100 && liczba <= 200)"},{"tresc":"W języku JavaScript należy zapisać warunek, który będzie spełniony, gdy zmienna a będzie dowolną liczbą naturalną dodatnią (bez 0) lub gdy zmienna b będzie dowolną liczbą z przedziału domkniętego od 10 do 100. Użyte w tym warunku wyrażenie logiczne będzie miało postać","odpowiedz":"(a>0) || ((b>=10) && (b<=100))"},{"tresc":"W języku HTML zdefiniowano listę, która","odpowiedz":"jest numerowana z zagłębioną listą punktowaną"},{"tresc":"Aby w pliku z rozszerzeniem php umieścić kod w języku PHP należy użyć znaczników","odpowiedz":"<?php .......... ?>"},{"tresc":"W bazie danych, w celu uporządkowania listy uczniów według roku urodzenia, należy użyć polecenia","odpowiedz":"SELECT imie,nazwisko,klasa from uczniowie order by rok_urodzenia"},{"tresc":"W językach programowania zmienna typu integer służy do przechowywania","odpowiedz":"liczby całkowitej"},{"tresc":"Znaczniki HTML <strong> oraz <em> służące do podkreślenia ważności tekstu, pod względem formatowania są odpowiednikami znaczników","odpowiedz":"<b> oraz <i>"},{"tresc":"Aby poprawnie zdefiniować hierarchiczną strukturę tekstu witryny internetowej, należy zastosować","odpowiedz":"znaczniki <h1>, <h2> oraz <p>"},{"tresc":" Element <meta charset=\"utf-8\"> określa metadane strony internetowej dotyczące","odpowiedz":"kodowania znaków."},{"tresc":"W języku CSS poniższy zapis sprawi, że kolor żółty przyjmie czcionka","odpowiedz":"odnośników, które otwierają sie w osobnej karcie"},{"tresc":"Kolumna pełniąca rolę klucza głównego w tabeli musi","odpowiedz":"zawierać unikalne wartości."},{"tresc":"Którego typu danych w bazie MySQL należy użyć, aby przechować w jednym polu datę i czas?","odpowiedz":"TIMESTAMP"},{"tresc":"Model barw oparty na 3 parametrach: odcień, nasycenie i jasność to","odpowiedz":"HSV"},{"tresc":"Brak którego elementu języka HTML wygeneruje ostrzeżenie lub błąd walidatora HTML?","odpowiedz":"<title>"},{"tresc":"W języku CSS właściwość font-size przyjmuje, według słów kluczowych, wartości","odpowiedz":"ze zbioru xx-small, x-small, medium, large, x-large, xx-large"},{"tresc":"Wciśnięcie przycisku o treści \"niebieski\" spowoduje wykonanie przedstawionego kodu JavaScript. Jaki będzie efekt jego działania?","odpowiedz":"Zmiana koloru tekstu \"Przykładowy tekst\" na niebieski"},{"tresc":"Przedstawiony blok reprezentuje czynność","odpowiedz":"podjęcia decyzji"},{"tresc":"Co definiuje w języku C++ przedstawiony fragment kodu?","odpowiedz":"Typ strukturalny składający się z trzech pól"},{"tresc":"Które stwierdzenie odnosi się do skalowania obrazu?","odpowiedz":"Powoduje zmianę rozmiaru obrazu bez zmieniania ważnej zawartości wizualnej"},{"tresc":"W języku JavaScript przedstawiona definicja jest definicją","odpowiedz":"tablicy"},{"tresc":"Aby przy pomocy zapytania SQL zmodyfikować strukturę istniejącej tabeli, należy zastosować kwerendę","odpowiedz":"ALTER TABLE"},{"tresc":"Wskaż poprawny zapis instrukcji zapisanej w języku JavaScript.","odpowiedz":"document.write(\"Liczba π z dokładnością do 2 miejsc po przecinku ≈ \" + 3.14 );"},{"tresc":"Domyślna nazwa pliku konfiguracyjnego serwera Apache to","odpowiedz":".htaccess"},{"tresc":"W programowaniu obiektowym w języku JavaScript użyty w przedstawionym kodzie zapis: this.zawod oznacza","odpowiedz":"metodę"},{"tresc":"Wynikiem działania zamieszczonej pętli zapisanej językiem PHP jest wypisanie kolejnych liczb","odpowiedz":"od 10 do 1"},{"tresc":"W bazach danych do prezentacji danych spełniających określone warunki nalezy utworzyć","odpowiedz":"raport."},{"tresc":"Na potrzeby strony internetowej zdefiniowano styl. Styl będzie przypisany tylko do niektórych znaczników (np. niektórych nagłówków, kilku akapitów). W takim wypadku, aby przypisać styl do kilku konkretnych znaczników, najlepiej jest zastosować","odpowiedz":"klasę"},{"tresc":"W programie MS Access we właściwościach pola klasa należy ustawić maskę wprowadzania danych. Którą maskę należy podać, aby wprowadzone dane były złożone z trzech znaków w formacie: obowiązkowa cyfra, po niej obowiązkowe dwie litery?","odpowiedz":"0LL"},{"tresc":"W języku PHP, aby połączyć się z bazą danych MySQL przy pomocy biblioteki mysqli, stosując zamieszczony zapis, w miejscu litery 'c' należy zapisać","odpowiedz":"nazwę użytkownika."},{"tresc":"Wbudowanym w pakiet XAMPP narzędziem służącym do zarządzania bazą danych jest","odpowiedz":"phpMyAdmin"},{"tresc":"Wskaż prawidłową kolejność tworzenia bazy danych","odpowiedz":"Określenie celu, stworzenie tabel, utworzenie relacji, normalizacja"},{"tresc":"Aby bezpiecznie przesłać pliki strony internetowej na serwer WWW można użyć protokołu","odpowiedz":"SFTP"},{"tresc":"Przed wykonaniem kopii bezpieczeństwa bazy danych, tak aby kopia ta była poprawna i możliwa do późniejszego odtworzenia, należy sprawdzić","odpowiedz":"spójność bazy danych"},{"tresc":"Który fragment kodu JavaScript zwróci wartość true?","odpowiedz":"\"def\" > \"abc\""},{"tresc":"Funkcją języka PHP tworzącą ciasteczko jest","odpowiedz":"setcookie()"},{"tresc":"Która z wymienionych funkcji sortowania wykorzystywana w języku PHP sortuje tablicę asocjacyjną według indeksów","odpowiedz":"ksort()"},{"tresc":"Który zapis w dokumencie HTML pozwala na połączenie z zewnętrznym arkuszem stylów o nazwie style.css?","odpowiedz":"<link rel=\"stylesheet\" href=\"style.css\">"},{"tresc":"Którą czynność należy wykonać podczas obróbki zdjęcia w edytorze grafiki, aby białe tło zamienić na przezroczystość?","odpowiedz":"Dodać kanał alfa."},{"tresc":"Które zapytanie SQL posłuży do wyszukania z przedstawionej tabeli wyłącznie wszystkich imion i nazwisk pacjentów urodzonych przed rokiem 2002?","odpowiedz":"SELECT imie, nazwisko FROM Pacjenci WHERE rok_urodzenia < 2002;"},{"tresc":"W HTML, aby wstawić obrazek z tekstem przyległym, znajdującym się pośrodku obrazka, należy zapisać znacznik","odpowiedz":"<img src=\"obrazek.png\" alt=\"obraz2\" align=\"middle\"> tekst"},{"tresc":"W języku PHP, aby prawidłowo obsłużyć połączenie z bazą danych MySQL, ostatnią operacją, powinno być zastosowanie polecenia","odpowiedz":"mysqli_close"},{"tresc":"Proces walidacji strony internetowej to","odpowiedz":"sprawdzenie jej w celu wyeliminowania błędów"},{"tresc":"Do graficznego tworzenia stron internetowych należy wykorzystać.","odpowiedz":"program typu WYSIWYG"},{"tresc":"Strona HTML definiuje akapit oraz rysunek. Aby rysunek został umieszczony przez przeglądarkę w tej samej linii co akapit po jego lewej stronie, należy w stylu CSS rysunku zawrzeć własność","odpowiedz":"float:left;"},{"tresc":"Przedstawione polecenie SQL, użytkownikowi adam@localhost nadaje prawa","odpowiedz":"manipulowania danymi w tabeli klienci"},{"tresc":"Typ stało-znakowy w języku SQL to","odpowiedz":"char"},{"tresc":"Którą z właściwości pola tabeli należy zdefiniować, aby pole przyjmowało dane składające się wyłącznie z cyfr?","odpowiedz":"Maskę wprowadzania"},{"tresc":"Ile razy zostanie wykonana pętla zapisana w przedstawionym skrypcie PHP?","odpowiedz":"6"},{"tresc":"Zdefiniowano bazę danych z tabelą sklepy o polach: nazwa, ulica, miasto, branza. Aby wyszukać wszystkie nazwy sklepów spożywczych zlokalizowanych wyłącznie we Wrocławiu, należy posłużyć się kwerendą:","odpowiedz":"SELECT nazwa FROM sklepy WHERE branza=\"spozywczy\" AND miasto=\"Wrocław\";"},{"tresc":"Który z przedstawionych kodów HTML sformatuje tekst według wzoru? (uwaga: słowo \"stacji\" jest zapisane większą czcionką niż reszta słów w tej linii)","odpowiedz":"B"},{"tresc":"Wskaż prawidłową kolejność tworzenia aplikacji","odpowiedz":"Analiza wymagań klienta, specyfikacja wymagań tworzenie, testy, wdrażanie"},{"tresc":"Które dane z 8 rekordów wpisanych do tabeli zwierzeta zostaną wyświetlone w wyniku podanego zapytania SQL?","odpowiedz":"Dika, Fuks"},{"tresc":"Plikiem konfiguracyjnym, który pozwala na zdefiniowanie ustawień PHP dla całego serwera, jest","odpowiedz":"php.ini"},{"tresc":"W języku CSS, aby sformatować dowolny element języka HTML w ten sposób, że po najechaniu na niego kursorem zmienia on kolor czcionki, należy zastosować pseudoklasę","odpowiedz":":hover"},{"tresc":"Ile razy należy zapisać instrukcję warunkową, aby zaimplementować w języku programowania przedstawiony algorytm?","odpowiedz":"Dwa razy."},{"tresc":"Dokonując konwersji obrazu z 8 bitową głębią kolorów na obraz z 4 bitową głębią, liczba kolorów zmniejszy się o","odpowiedz":"240"},{"tresc":"Program zapisany w języku PHP ma za zadanie obliczyć średnią pozytywnych ocen ucznia od 2 do 6. Warunek wybierania ocen w pętli liczącej średnią powinien zawierać wyrażenie logiczne","odpowiedz":"$ocena >= 2 and $ocena <= 6"},{"tresc":"Którą czynność gwarantującą poprawne wykonanie przedstawionego kodu JavaScript, należy wykonać przed pętlą?","odpowiedz":"Zainicjować zmienną text"},{"tresc":"Które ze zdań jest prawdziwe w stosunku do grafiki rastrowej?","odpowiedz":"Jest to prezentacja obrazu za pomocą pionowo-poziomej siatki odpowiednio kolorowanych pikseli na monitorze komputera, drukarce lub innym urządzeniu wyjściowym"},{"tresc":"Zestaw komponentów i podprogramów służący pisaniu aplikacji, który ponadto narzuca szkielet wyglądu aplikacji, jej strukturę, a czasem nawet wzorzec według którego ma powstać aplikacja, to","odpowiedz":"framework."},{"tresc":"Aby w języku HTML uzyskać takie formatowanie paragrafu dla tekstu należy zastosować kod","odpowiedz":"<p>Tekst może być <mark>zaznaczony</mark> albo <em>istotny</em> dla autora</p>"},{"tresc":"Za pomocą, którego znacznika można wstawić listę numerowaną (uporządkowaną) w dokumencie HTML?","odpowiedz":"<ol>"},{"tresc":" Funkcja COUNT języka SQL realizuje","odpowiedz":"zliczanie rekordów wybranych kwerendą."},{"tresc":"Baza danych ma dwie tabele połączone relacją 1..n. Którą klauzulą SQL należy połączyć tabele, aby wybrać korespondujące ze sobą wartości z pól obu tabel?","odpowiedz":"JOIN"},{"tresc":"Które polecenie wydane z konsoli systemu operacyjnego, zawierające w swojej składni opcję --repair, umożliwia naprawę bazy danych?","odpowiedz":"mysqlcheck"},{"tresc":"Dany jest fragment kodu PHP z zdeklarowaną zmienną typu tablicowego. W wyniku wykonania kodu zostanie wpisane imię","odpowiedz":"Krzysztof"},{"tresc":"Dla akapitu zdefiniowano styl CSS. Które właściwości stylu CSS poprawnie opisują dla akapitu krój czcionki: Arial; rozmiar czcionki: 16 pt; styl czcionki: pochylenie?","odpowiedz":"p {font-family: Arial; font-size: 16pt; font-style: italic;}"},{"tresc":"Na obrazie przedstawiono wybór formatu pliku importującego bazę danych. Którego formatu należy użyć, jeżeli dane są wyeksportowane z programu Excel i zapisane tekstowo z zastosowaniem przecinka do rozdzielenia wartości pól?","odpowiedz":"CSV"},{"tresc":"W wyniku połączenia relacją kluczy głównych dwóch tabel otrzymuje się relację typu","odpowiedz":"jeden do jednego"},{"tresc":"Podany styl tworzy obramowanie pojedyncze, o następujących cechach:","odpowiedz":"krawędź górna jest koloru czerwonego, krawędź prawa koloru niebieskiego, krawędź dolna koloru zielonego, krawędź lewa koloru żółtego"},{"tresc":"Wskaż znacznik pozwalający na zapisanie tekstu nieprawidłowego lub nieodpowiedniego w sposób przekreślony.","odpowiedz":"<s> </s>"},{"tresc":"Podane polecenie SQL nadaje prawo SELECT","odpowiedz":"do wszystkich tabel w bazie hurtownia"},{"tresc":"Instrukcja języka PHP tworząca obiekt pkt dla zdefiniowanej w ramce klasy Punkt ma postać","odpowiedz":"pkt = new Punkt();"},{"tresc":"W języku PHP w wyniku działania fragmentu kodu w zmiennej o nazwie Nowy_Napis znajdzie się","odpowiedz":"zawsze sprawdz swoj kod"},{"tresc":"Proces organizowania danych w bazie obejmujący tworzenie tabel, ustanawianie relacji między nimi i polegający na wyeliminowaniu z bazy nadmiarowych danych oraz niespójnych zależności nazywa się","odpowiedz":"normalizacją."},{"tresc":"Którym słowem kluczowym, w języku z rodziny C należy posłużyć się, aby przypisać alternatywną nazwę dla istniejącego typu danych?","odpowiedz":"typedef"},{"tresc":"Aby usunąć wszystkie rekordy z tabeli należy zastosować kwerendę","odpowiedz":"TRUNCATE TABLE"},{"tresc":"Który z wymienionych znaczników należy do części <head> dokumentu HTML?","odpowiedz":"<title>"},{"tresc":" Którą czynność gwarantującą poprawne wykonanie przedstawionego kodu JavaScript, należy wykonać przed pętlą?","odpowiedz":"Zainicjować zmienną text"},{"tresc":"Którego ze słów kluczowych języka SQL należy użyć, aby wyeliminować duplikaty?","odpowiedz":"DISTINCT"},{"tresc":"Po wykonaniu przedstawionego kodu JavaScript wyświetli się wartość","odpowiedz":"13"},{"tresc":"Który znacznik służy budowaniu hierarchii tekstu w języku HTML?","odpowiedz":"<h6>"},{"tresc":"Która pętla w języku PHP pozwala wykonać operacje na wszystkich elementach tablicy z automatycznym indeksowaniem jej elementów?","odpowiedz":"foreach"},{"tresc":"Wynikiem wykonania przedstawionego kodu PHP jest wypisanie wartości","odpowiedz":"147"},{"tresc":"Które oprogramowanie NIE JEST systemem zarządzania treścią (CMS)?","odpowiedz":"Apache"},{"tresc":"W tabeli artykuly wykonano następujące polecenia dotyczące praw użytkowania jan. Po wykonaniu poleceń użytkownik jan będzie miał prawa do","odpowiedz":"tworzenia tabeli i wypełniania jej danymi"},{"tresc":"Przedstawiono efekt formatowania CSS oraz kod HTML. Jak należy zdefiniować styl, aby osiągnąć takie formatowanie?","odpowiedz":"p::first-line {font-size: 200%; color:brown;}"},{"tresc":"Znacznik meta języka HTML należy umieścić","odpowiedz":"w części nagłówkowej witryny internetowej"},{"tresc":"W języku HTML, aby uzyskać następujący efekt pogrubienia, pochylenia lub zapisania w górnym indeksie należy zapisać kod:","odpowiedz":"<b>pogrubiony </b><i>pochylony</i> lub w <sup>górnym indeksie</sup>"},{"tresc":"W języku JavaScript zapisano następującą funkcję. Ma ona za zadanie","odpowiedz":"Zwrócić wartość bezwzględną z f"},{"tresc":"Przedstawiono tabelę zdefiniowaną kodem HTML, bez formatowania CSS. Który z fragmentów kodu HTML odpowiada pierwszemu wierszowi tabeli?","odpowiedz":"D"},{"tresc":"W języku CSS, aby formatować tekst poprzez przekreślenie, podkreślenie dolne lub górne, należy zastosować","odpowiedz":"text-decoration"},{"tresc":" Które z zadań programistycznych powinno być wykonane po stronie serwera?","odpowiedz":"Zapisanie danych pobranych z aplikacji internetowej w bazie danych"},{"tresc":"Wskaż instrukcję iteracyjną.","odpowiedz":"for"},{"tresc":"Dana jest tabela pracownicy. Polecenie MySQL usuwające wszystkie rekordy z tabeli, dla których nie wypełniono pola rodzaj_umowy, ma postać","odpowiedz":"DELETE FROM pracownicy WHERE rodzaj_umowy IS NULL;"},{"tresc":"Obraz, który ma być wyświetlony na stronie powinien mieć tło przezroczyste. Wskaż format graficzny, w którym należy zapisać taki plik.","odpowiedz":"PNG"},{"tresc":"Który z wymienionych formatów plików graficznych obsługuje przezroczystość?","odpowiedz":"PNG"},{"tresc":"Po wykonaniu się przedstawionego fragmentu kodu języka C/C++ zmiennej o nazwie zmienna2 zostanie","odpowiedz":"przypisany adres zmiennej o nazwie zmienna1"},{"tresc":"Za pomocą którego protokołu należy wysłać pliki na serwer WWW?","odpowiedz":"FTP"},{"tresc":"Przedstawiona baza danych zawiera trzy tabele i dwie relacje. Aby wyświetlić dane wszystkich lekarzy przypisanych do konkretnego pacjenta, należy przyrównać klucze","odpowiedz":"Lekarze.id = Pacjenci.Lekarze_id"},{"tresc":"Do określenia listy definicji w kodzie HTML używa się znacznika","odpowiedz":"<dl>"},{"tresc":"W języku PHP zmienna typu float przyjmuje wartości","odpowiedz":"zmiennoprzecinkowe"},{"tresc":"Przedstawiony kod języka PHP","odpowiedz":"definiuje tablicę z trzema wartościami"},{"tresc":"Aby w tworzonej w języku SQL tabeli praca dodać w kolumnie stawka warunek, że musi przyjmować rzeczywiste wartości dodatnie mniejsze od 50, należy użyć zapisu","odpowiedz":"... stawka float CHECK(stawka>0 AND stawka<50.00)"},{"tresc":"Który odnośnik jest prawidłowo zdefiniowany?","odpowiedz":"<a href=\"http://strona.pl\">strona</a>"},{"tresc":"Formatem zapisu rastrowych plików graficznych z kompresją bezstratną jest","odpowiedz":"PNG"},{"tresc":"W języku JavaScript zapisano definicję obiektu. Aby odwołać się do własności nazwisko należy zapisać","odpowiedz":"osoba.nazwisko"},{"tresc":"Do grupowania obszarów na poziomie bloków, które będą formatowane za pośrednictwem znaczników, należy użyć","odpowiedz":"<div>"},{"tresc":"Które wyrażenie logiczne w języku PHP sprawdza, czy zmienna1 należy do przedziału jednostronnie domkniętego <-5, 10)?","odpowiedz":"$zmienna1 >= -5 && $zmienna1 < 10"},{"tresc":"W języku PHP zmienna predefiniowana $_SESSION zawiera","odpowiedz":"zmienne zarejestrowane w bieżącej sesji"},{"tresc":" Zakładając, że zmienna tablicowa $tab jest wypełniona liczbami naturalnymi, wynikiem programu będzie wypisanie","odpowiedz":"największego elementu tablicy"},{"tresc":"W języku HTML zapis &lt; spowoduje wyświetlenie w przeglądarce znaku","odpowiedz":"<"},{"tresc":" Istnieje tabela pracownicy z polami: id, imie, nazwisko, pensja. W nowym roku postawiono podnieść pensję wszystkim pracownikom o 100 zł. Aktualizacja ta w bazie danych będzie miała postać","odpowiedz":"UPDATE pracownicy SET pensja = pensja + 100;"},{"tresc":"Poprawne udokumentowanie wzorca weryfikacji pola nazwa w części kodu aplikacji JavaScript to","odpowiedz":"/* Pole nazwa może zawierać dowolny ciąg cyfr (z wyłączeniem 0), następnie musi zawierać dużą literę i ciąg minimum dwóch małych liter. */"},{"tresc":"W języku zapytań SQL, aby dodać do tabeli Towar kolumnę rozmiar typu znakowego o maksymalnej długości 20 znaków, należy wykonać polecenie","odpowiedz":"ALTER TABLE Towar ADD rozmiar varchar(20);"},{"tresc":"Ile iteracji będzie miała pętla zapisana w języku PHP, zakładając, że zmienna sterująca nie jest modyfikowana we wnętrzu pętli?","odpowiedz":"6"},{"tresc":"Jakiego znacznika należy użyć, aby przejść do kolejnej linii tekstu, nie tworząc akapitu na stronie interenetowej ?","odpowiedz":"<br>"},{"tresc":"Dana jest tabela oceny o polach id, nazwisko, imie, ocena. Przedstawione zapytanie jest przykładem","odpowiedz":"selekcji."},{"tresc":"Znacznik <pre> </pre> jest stosowany w celu wyświetlenia","odpowiedz":"treści czcionką o stałej szerokości."},{"tresc":"Źródłem rekordów dla raportu może być","odpowiedz":"Tabela"},{"tresc":"Przedstawiona instrukcja zapisana w języku SQL jest przykładem kwerendy","odpowiedz":"aktualizującej."},{"tresc":"W tabeli pracownicy zdefiniowano klucz główny typu INTEGER z atrybutami NOT NULL oraz AUTO_INCREMENT. Ponadto zdefiniowano pola imie oraz nazwisko. W przypadku zastosowania przedstawionej kwerendy SQL wprowadzającej dane, w której zostało pominięte pole klucza, w bazie danych MySQL nastąpi","odpowiedz":"wpisanie rekordu do tabeli, dla klucza głównego zostanie przydzielona kolejna wartość naturalna"},{"tresc":"W podanej regule CSS: h1 {color: blue} h1 oznacza","odpowiedz":"selektor"},{"tresc":"Tworzenie i przypisanie do zmiennej tablicy asocjacyjnej zrealizuje się w PHP zapisem","odpowiedz":"$tab = array (\"a\" => 1, \"b\" => 2, \"c\" => 3);"},{"tresc":"Wskaż poprawną definicję stylu CSS dla przycisku typu submit o właściwościach: czarny kolor tła, brak obramowania, marginesy wewnętrzne 5 px.","odpowiedz":"A"},{"tresc":"Atrybut kolumny NOT NULL jest wymagany w przypadku","odpowiedz":"klucza podstawowego."},{"tresc":"Aby za pomocą CSS zdefiniować przedstawione opływanie obrazu tekstem należy w stylu obrazu wprowadzić zapis","odpowiedz":"float: right;"},{"tresc":"Jednostka ppi (pixels per inch)","odpowiedz":"określa rozdzielczość obrazów rastrowych"},{"tresc":"W procesie walidacji stron internetowych nie bada się","odpowiedz":"źródła pochodzenia narzędzi edytorskich"},{"tresc":"Wskaż prawidłową kolejność stylów CSS mając na uwadze ich pierwszeństwo w formatowaniu elementów strony WWW.","odpowiedz":"Lokalny, Wewnętrzny, Zewnętrzny"},{"tresc":"W MS SQL Server predefiniowana rola o nazwie dbcreator pozwala użytkownikowi na","odpowiedz":"tworzenie, modyfikowanie, usuwanie i odzyskiwanie bazy danych"},{"tresc":"Kod: SELECT imie, pesel, wiek FROM dane WHERE wiek IN (18,30) spowoduje wybranie:","odpowiedz":"imion, numerów PESEL i wieku osób w wieku równym 18 lub 30 lat"},{"tresc":"Aby edytować nakładające się na siebie pojedyncze fragmenty obrazu, pozostawiając pozostałe elementy niezmienione, należy zastosować","odpowiedz":"Warstwy"},{"tresc":"Który z elementów dokumentacji aplikacji powinien znaleźć się w dokumentacji użytkownika?","odpowiedz":"Opis obsługi funkcji systemu"},{"tresc":"Formatowanie CSS akapitu określa styl szarej ramki o cechach:","odpowiedz":"linia kropkowa; grubość 2 px; marginesy pomiędzy tekstem a ramką 15 px."},{"tresc":"Integralność referencyjna w modelu relacyjnych baz danych oznacza, że","odpowiedz":"wartość klucza obcego w danej tabeli musi być albo równa wartości klucza głównego w tabeli z nia powiązanej albo równa wartości NULL"},{"tresc":"W języku HTML zapisano formularz. Który z efektów działania kodu będzie wyświetlony przez przeglądarkę zakładając, że w drugie pole użytkownik wpisał wartość \"ala ma kota\"?","odpowiedz":"B"},{"tresc":"W procesie przygotowywania grafiki na stronę internetową należy wyciąć jedynie jej fragment. Taka operacja to","odpowiedz":"kadrowanie"},{"tresc":"Połączenie dwóch barw leżących po przeciwnych stronach w kole barw jest połączeniem","odpowiedz":"dopełniającym"},{"tresc":"W tabeli Recepta pola Imie i Nazwisko dotyczą pacjenta, na którego recepta jest wydana. Którą kwerendę należy zastosować, aby dla wszystkich recept uzyskać datę wystawienia recepty oraz imię i nazwisko lekarza wystawiającego?","odpowiedz":"SELECT Lekarz.Imie, Lekarz.Nazwisko, DataWystawienia FROM Recepta JOIN Lekarz ON Recepta.Lekarz_id = Lekarz.id;"},{"tresc":"Fragment kodu w języku JavaScript realizujący dodawanie dwóch liczb ma następującą postać. Aby dodawanie wykonane było po kliknięciu przycisku o nazwie dodaj, należy w wykropkowane miejsce wstawić","odpowiedz":"<button onclick=\"return dodaj()\">dodaj</button>"},{"tresc":"Aby usunąć tabelę należy zastosować kwerendę","odpowiedz":"DROP TABLE"},{"tresc":"W kodzie źródłowym zapisanym w języku HTML wskaż błąd walidacji dotyczący tego fragmentu","odpowiedz":"Znacznik zamykający /b niezgodny z zasadą zagnieżdżania"},{"tresc":"W zamieszczonym przykładzie pseudoklasa hover sprawi, że styl pogrubiony będzie przypisany","odpowiedz":"odnośnikowi, w momencie kiedy najechał na niego kursor myszy"},{"tresc":"Jednoznacznym identyfikatorem rekordu w bazie danych jest pole","odpowiedz":"klucza podstawowego"},{"tresc":"W języku HTML, aby dodać animację FLASH (z rozszerzeniem .swf) na stronę internetową, należy użyć znacznika","odpowiedz":"<object>"},{"tresc":"W języku JavaScript zapis w ramce oznacza, że","odpowiedz":"zmienna x będzie przechowywać wynik działania metody nazwa"},{"tresc":"Która z przedstawionych funkcji języka PHP zamieni słowo \"kota\" na słowo \"mysz\" w napisie \"ala ma kota\"?","odpowiedz":"str_replace( \"kota\", \"mysz\", \"ala ma kota\");"},{"tresc":"Którą integralność opisuje cytowana definicja?","odpowiedz":"Referencyjną."},{"tresc":"Do optymalnej realizacji algorytmu szukającego największej z trzech podanych liczb a, b i c, wystarczy zastosować","odpowiedz":"dwa warunki"},{"tresc":"W języku HTML znacznik <strong>tekst</strong> będzie wyświetlany w ten sam sposób przez przeglądarkę co znacznik","odpowiedz":"<b>tekst</b>"},{"tresc":"Oznaczenie barwy w postaci #ff00e0 jest równoważne zapisowi","odpowiedz":"rgb(255,0,224)"},{"tresc":"Istnieje tabela pracownicy z polami: id, imie, nazwisko, pensja. W nowym roku postawiono podnieść pensję wszystkim pracownikom o 100 zł. Aktualizacja ta w bazie danych będzie miała postać","odpowiedz":"UPDATE pracownicy SET pensja = pensja + 100;"},{"tresc":"Kolor zapisany w postaci szesnastkowej o wartości #11FE07 w kodzie RGB ma postać","odpowiedz":"rgb(17,254,7)"},{"tresc":"Normalizacja tabel jest procesem, który ma na celu","odpowiedz":"sprawdzenie i optymalizację bazy danych"},{"tresc":"Formatem plików dźwiękowych z kompresją bezstratną jest","odpowiedz":"FLAC"},{"tresc":"Wskaż PRAWDZIWE stwierdzenie dla polecenia: CREATE TABLE IF NOT EXISTS ADRES(ulica VARCHAR(70) CHARACTER SET utf8);","odpowiedz":"IF NOT EXISTS stosuje się opcjonalnie, aby upewnić się, że brak w bazie danych takiej tabeli"},{"tresc":"Aby użyć zewnętrznego skryptu JavaScript o nazwie skrypt.js, należy zapisać w kodzie HTML","odpowiedz":"<script src=\"skrypt.js\"></script>"},{"tresc":"W języku HTML, aby scalić w poziomie dwie sąsiednie komórki w wierszu tabeli należy zastosować atrybut","odpowiedz":"colspan"},{"tresc":"Dla przedstawionego fragmentu dokumentu HTML zdefiniowano formatowanie CSS selektora klasy \"menu\" tak, aby kolor tła bloku był zielony. Która definicja stylu CSS odpowiada temu formatowaniu?","odpowiedz":"div.menu { background-color: green; }"},{"tresc":"W przedstawionym kodzie PHP, zamiast znaków zapytania powinien pojawić się komunikat:","odpowiedz":"Błąd przetwarzania zapytania"},{"tresc":"W ramce przedstawiono kod JavaScript z błędem logicznym. Program powinien wypisywać informację, czy liczby są sobie równe czy nie, lecz nie wykonuje tego. Wskaż odpowiedź, która dotyczy błędu","odpowiedz":"W klauzuli if występuje przypisanie zamiast porównania"},{"tresc":"Grafik wykonał logo strony internetowej. To czarny znaczek na przezroczystym tle. Aby zachować wszystkie atrybuty obrazu i umieścić go na stronie internetowej, grafik powinien zapisać obraz w formacie","odpowiedz":"PNG"},{"tresc":"Na rysunku została przedstawiona relacja jeden do wielu. Łączy ona","odpowiedz":"klucz obcy rezyserzy_id tabeli filmy z kluczem podstawowym id tabeli rezyserzy"},{"tresc":"Zadaniem funkcji zapisanej w języku PHP jest","odpowiedz":"Zwrócenie wartości 1, gdy liczba jest parzysta"},{"tresc":"Do tabeli pracownicy wpisano rekordy. Co zostanie wyświetlone po uruchomieniu kwerendy SQL SELECT podanej w ramce?","odpowiedz":"Wartość 10000, czyli suma pensji pracownika o id=4 oraz o id=6"},{"tresc":"Jaką wartość zwróci funkcja empty($a); zapisana w języku PHP, gdy zmienna $a przyjmie wartość liczbową równą 0?","odpowiedz":"TRUE"},{"tresc":"Zdefiniowano bazę danych z tabelą podzespoły o polach: model, producent, typ, cena. Aby wyświetlić wszystkie modele pamięci RAM firmy Kingston w kolejności od najtańszej do najdroższej, należy posłużyć się kwerendą:","odpowiedz":"SELECT model FROM podzespoly WHERE typ=\"RAM\" AND producent=\"Kingston\" ORDER BY cena ASC;"},{"tresc":"Przedstawiony fragment kodu napisano w języku JavaScript. Aby program przypisywał wartość równą 1 co trzeciemu elementowi w tablicy, to w miejscu kropek należy wpisać","odpowiedz":"i += 3"},{"tresc":"Które ze znaczników HTML umożliwią wyświetlenie na stronie tekstu w jednym wierszu, jeżeli żadne formatowanie CSS nie zostało zdefiniowane?","odpowiedz":"<span>Dobre strony </span><span style=\"letter-spacing:3px\">mojej strony</span>"},{"tresc":"W języku C++ zdefiniowano zmienną: char zm1;. W jaki sposób można do niej przypisać wartość zgodnie ze składnią języka?","odpowiedz":"zm1 = 'w';"},{"tresc":"Który z obiektów relacyjnej bazy danych, będący kodem języka SQL, może być wywoływany w zapytaniach modyfikujących kolumny danych widoczne jako tabela, bez względu na to czy jest tworzony programowo, czy dynamicznie?","odpowiedz":"Funkcja zdefiniowana"},{"tresc":"W języku JavaScript zdefiniowana zmienna i, która ma przechowywać wynik dzielenia wynoszący 1, to","odpowiedz":"var i=parseInt(3/2);"},{"tresc":"W języku JavaScript zdefiniowano obiekt Samochod. Aby wywołać jedną z metod tego obiektu, należy zapisać","odpowiedz":"Samochod.spalanie()"},{"tresc":"W skrypcie PHP należy utworzyć cookie o nazwie owoce które przyjmie wartość jabłko. Cookie ma być dostępne przez jedną godzinę od jego utworzenia. W tym celu należy w skrypcie PHP użyć funkcji:","odpowiedz":"setcookie(\"owoce\",\"jabłko\",time()+3600);"},{"tresc":"Aby dołączyć kaskadowy arkusz stylów zapisany w zewnętrznym pliku, należy użyć następującego fragmentu kodu HTML","odpowiedz":"<link rel=\"stylesheet\" type=\"text/css\" href=\"styl.css\" />"},{"tresc":"Która wartość tekstowa nie pasuje do podanego w ramce wzorca wyrażenia regularnego?","odpowiedz":"Jelenia Góra"},{"tresc":"Kwalifikatory dostępu: private, protected i public definiują mechanizm","odpowiedz":"hermetyzacji."},{"tresc":"Poniżej została przedstawiona obsługa","odpowiedz":"ciasteczek"},{"tresc":"W języku PHP pobrano z bazy danych wyniki działania kwerendy za pomocą polecenia mysql_query(). Aby otrzymać ze zwróconej kwerendy wierszy danych, należy zastosować polecenie:","odpowiedz":"mysql_fetch_row()"},{"tresc":"Aby wykonać kopię zapasową bazy danych MySQL można posłużyć się","odpowiedz":"eksportem bazy."},{"tresc":"Przedstawiona instrukcja warunkowa zapisana w języku JavaScript jest spełniona dla zmiennej x równej","odpowiedz":"3"},{"tresc":"Dołączenie zewnętrznego arkusza stylów do kodu HTML jest realizowane przy użyciu znacznika","odpowiedz":"<link>"},{"tresc":"Relacja opisana w sposób: \"Rekordowi z tabeli A odpowiada dowolna liczba rekordów z tabeli B. Jednemu rekordowi z tabeli B odpowiada dokładnie jeden rekord z tabeli A\" jest relacją","odpowiedz":"jeden do wielu."},{"tresc":"W celu stworzenia relacji wiele do wielu łączącej tabele A i B wystarczy, że","odpowiedz":"zdefiniuje się trzecią tabelę z kluczami obcymi do tabel A i B"},{"tresc":"Do poprawnego i spójnego działania bazy danych niezbędne jest umieszczenie w każdej tabeli","odpowiedz":"klucza PRIMARY KEY z wartością NOT NULL i UNIQUE"},{"tresc":"Przy użyciu którego znacznika w języku HTML nie można umieścić na stronie grafiki dynamicznej?","odpowiedz":"<strike>"},{"tresc":"Komentarz w kodzie PHP można umieścić pomiędzy znakami","odpowiedz":"/* ... */"},{"tresc":"Aby przywrócić bazę danych z kopii bezpieczeństwa na serwerze MSSQL, należy posłużyć się poleceniem","odpowiedz":"RESTORE DATABASE"},{"tresc":"W języku CSS, przedstawiony zapis sprawi, że plik rysunek.png będzie","odpowiedz":"tłem każdego paragrafu"},{"tresc":"Poziom izolacji transakcji Repeatable Read (tryb powtarzalnego odczytu) stosowany przez MS SQL wiąże się z problemem","odpowiedz":"odczytów widm."},{"tresc":" Przy użyciu jakiego znacznika HTML otrzymamy tekst napisany czcionką o stałej szerokości znaku, który uwzględnia dodatkowe spacje, tabulacje i znaki końca linii?","odpowiedz":"<pre> ... </pre>"},{"tresc":"Aby ustawić tło na stronie www należy użyć polecenia","odpowiedz":"<body bgcolor=\"\"></body>"},{"tresc":"Zadaniem funkcji PHP o nazwie mysql_num_rows() jest","odpowiedz":"zwrócić liczbę wierszy znajdujących się w wyniku zapytania"},{"tresc":"Aby przygotować szablon strony z trzema kolumnami ustawionymi obok siebie, można posłużyć się stylem CSS","odpowiedz":"A"},{"tresc":"W języku PHP zmienna $_GET jest zmienną","odpowiedz":"predefiniowaną, używaną do przekazywania danych do skryptów PHP poprzez adres strony"},{"tresc":"W prezentowanym kodzie PHP w miejscu kropek powinno znaleźć się polecenie","odpowiedz":"mysqli_fetch_row($zapytanie);"},{"tresc":"W języku PHP funkcja, która może służyć do sprawdzenia, czy dany ciąg jest fragmentem innego ciągu, to","odpowiedz":"strstr();"},{"tresc":"Wskaż zapisany w języku JavaScript warunek, który ma sprawdzić spełnienie przynajmniej jednego z przypadków: 1) dowolna naturalna liczba a jest trzycyfrowa, 2) dowolna całkowita liczba b jest ujemna","odpowiedz":"((a>99) && (a<1000)) || (b<0)"},{"tresc":"Poprawny zapis znacznika <img>, za pomocą którego można umieścić na stronie internetowej obraz rys.jpg przeskalowany do szerokości 120 px i wysokości 80 px z tekstem alternatywnym \"krajobraz\" to","odpowiedz":"<img src=\"rys.jpg\" width=\"120px\" height=\"80px\" alt=\"krajobraz\"/>"},{"tresc":"Baza danych zawiera tabele artykuły z polami: nazwa, typ, producent, cena. Aby wyświetlić wszystkie nazwy artykułów wyłącznie typu pralka, dla których cena jest z przedziału 1000 PLN i 1500 PLN, należy zastosować polecenie","odpowiedz":"SELECT nazwa FROM artykuly WHERE typ=\"pralka\" AND cena BETWEEN 1000 AND 1500;"},{"tresc":"W jaki sposób wykonanie podanej w ramce kwerendy SQL wpłynie na tabelę pracownicy?","odpowiedz":"Zmieni typ danych kolumny plec na znakowy o stałej długości 9"},{"tresc":"W bazie danych MYSQL dana jest tabela programów komputerowych o polach: nazwa, producent, rokWydania. Aby kwerenda SELECT zwróciła wszystkie nazwy producentów tak, by nazwy te nie powtarzały się, należy zapisać:","odpowiedz":"SELECT DISTINCT producent FROM programy;"},{"tresc":"Zapisaną językiem PHP funkcję o nazwie policz wywołano z argumentem $Z = 1. Jaki wynik zostanie zwrócony?","odpowiedz":"13"},{"tresc":"W przedstawionym fragmencie kwerendy języka SQL, komenda SELECT ma za zadanie zwrócić","odpowiedz":"liczbę wierszy"},{"tresc":"Aby w systemie MySQL nadać użytkownikowi prawo do nadawania i zmiany uprawnień innym użytkownikom należy zastosować klauzulę","odpowiedz":"GRANT OPTION"},{"tresc":" Fragment kodu napisany w języku HTML zamieszczony w ramce przedstawia listę","odpowiedz":"numerowaną"},{"tresc":"W języku JavaScript typ boolean może być reprezentowany przez wartość","odpowiedz":"true"},{"tresc":"Który parametr obiektu graficznego ulegnie zmianie po modyfikacji wartości kanału alfa?","odpowiedz":"Przezroczystość"},{"tresc":"Przedstawiony fragment kodu PHP działa poprawnie i ma za zadanie wyświetlić na stronie internetowej dane pobrane kwerendą z bazy danych. Z ilu pól zostaną wyświetlone dane?","odpowiedz":"Z trzech pól."},{"tresc":"W stylu CSS aby zadeklarować krój czcionki, należy użyć właściwości","odpowiedz":"font-family"},{"tresc":"Wskaż różnicę pomiędzy poleceniami DROP TABLE i TRUNCATE TABLE.","odpowiedz":"DROP TABLE usuwa tabelę, a TRUNCATE TABLE usuwa wszystkie dane, pozostawiając pustą tabelę."},{"tresc":"Jak nazywa się program, który wykonuje instrukcje zawarte w kodzie źródłowym tworzonego programu bez uprzedniego generowania programu wynikowego?","odpowiedz":"Interpreter"},{"tresc":"W formularzu HTML zastosowano znacznik <input>. Wyświetlone pole będzie służyło do wprowadzania maksymalnie","odpowiedz":"20 znaków, które nie są widoczne w polu tekstowym"},{"tresc":"Jaką wartość zwróci funkcja zao zdefiniowana w języku C++, wywołana z aktualnym parametrem 3.55","odpowiedz":"4"},{"tresc":"Proporcje obrazu 16:9 (przy założeniu, że piksel ma kształt kwadratu) można uzyskać przy rozdzielczości","odpowiedz":"1366 na 768 pikseli."},{"tresc":"Certyfikat SSL jest stosowany do","odpowiedz":"zidentyfikowania właściciela domeny"},{"tresc":"Stronę internetową zapisano w języku XHTML. Który z kodów stanowi implementację przedstawionego fragmentu strony, jeżeli żadne style CSS nie zostały zdefiniowane?","odpowiedz":"B"},{"tresc":"Przedstawiona funkcja zapisana w języku JavaScript ma za zadanie","odpowiedz":"zwrócić wartość bezwzględną z f"},{"tresc":"W języku PHP zapisano fragment kodu. Po zakończeniu pętli zmienna a przyjmie wartość","odpowiedz":"20"},{"tresc":"Tabela Pacjenci ma pola: imie, nazwisko, wiek, lekarz_id. Aby zestawić raport zawierający wyłącznie imiona i nazwiska pacjentów poniżej 18 roku życia, którzy zapisani są do lekarza o id równym 6, można posłużyć się kwerendą SQL","odpowiedz":"SELECT imie, nazwisko FROM Pacjenci WHERE wiek<18 AND lekarz_id=6;"},{"tresc":"Zapisano kod HTML wstawiający grafikę na stronę internetową. Jeżeli rysunek.png nie zostanie odnaleziony, przeglądarka","odpowiedz":"w miejscu grafiki wypisze tekst \"pejzaż\""},{"tresc":"Przedstawione pole input umożliwi","odpowiedz":"zaznaczenie opcji"},{"tresc":"Witryna internetowa ma mieć przedstawioną strukturę bloków. Aby uzyskać ten układ, należy znacznikom sekcji przypisać właściwości w następujący sposób:","odpowiedz":"float tylko dla bloków: 2, 3, 4; clear dla bloku 5"},{"tresc":"Jak nazywa się proces przedstawienia, we właściwej dla danego środowiska formie, informacji zawartej w dokumencie elektronicznym?","odpowiedz":"Renderowanie"},{"tresc":"Użytkownik wprowadził adres nieistniejącego zasobu na serwerze. Próba połączenia wygeneruje błąd","odpowiedz":"404"},{"tresc":"CAPTCHA to technika zabezpieczeń na stronach WWW pozwalająca","odpowiedz":"potwierdzić, że dane z formularza są wysyłane przez człowieka."},{"tresc":"Które z poleceń nadaje najniższy poziom uprawnień użytkownikowi uczen pod względem modyfikacji danych i struktury tabel?","odpowiedz":"GRANT SELECT ON szkola.przedmioty TO uczen;"},{"tresc":"Aby odebrać uprawnienia użytkownikowi, należy zastosować polecenie","odpowiedz":"REVOKE"},{"tresc":"Aby zmodyfikować strukturę tabeli w bazie MySQL należy wykonać polecenie","odpowiedz":"ALTER TABLE"},{"tresc":"Instrukcja przypisania elementu do tablicy w języku JavaScript dotyczy tablicy","odpowiedz":"asocjacyjnej"},{"tresc":"W aplikacjach internetowych tablice asocjacyjne to tablice, w których","odpowiedz":"indeks jest łańcuchem tekstowym"},{"tresc":"Który z atrybutów background-attachment w języku CSS należy wybrać, aby tło strony było nieruchome względem okna przeglądarki?","odpowiedz":"Fixed"},{"tresc":"W języku MySQL należy zastosować polecenie REVOKE, aby użytkownikowi anna odebrać prawo do dokonywania zmian jedynie w definicji struktury bazy danych. Polecenie odpowiadające odebraniu tych praw ma postać","odpowiedz":"REVOKE CREATE ALTER DROP ON tabela1 FROM 'anna'@'localhost'"},{"tresc":"Analizując przedstawiony kod zapisany w języku HTML, można stwierdzić, że w przeglądarce","odpowiedz":"blok B będzie oddalony od bloku A o 20 px"},{"tresc":"Blok deklaracji postaci background-attachment: scroll powoduje, że","odpowiedz":"tło strony będzie przewijane razem z tekstem"},{"tresc":"Zapytanie z klauzulą JOIN stosuje się, aby","odpowiedz":"uzyskać wyniki z dwóch tabel pozostających ze sobą w relacji"},{"tresc":"Aby uzyskać informacje o środowisku pracy serwera obsługującego PHP, należy skorzystać z funkcji","odpowiedz":"phpinfo()"},{"tresc":"W języku HTML, aby uzyskać efekt jak na przykładzie, należy zastosować konstrukcję","odpowiedz":"<p><big>Duży tekst</big> zwykły tekst</p>"},{"tresc":"Która wartość zostanie wypisana przez algorytm?","odpowiedz":"15"},{"tresc":"Którą wartość będzie przechowywała zmienna a po wykonaniu przedstawionej sekwencji instrukcji języka PHP?","odpowiedz":"11"},{"tresc":"W którym z bloków należy umieścić warunek pętli?","odpowiedz":"C"},{"tresc":"Podaj wynik działania programu zapisanego w języku JavaScript, znajdującego się w ramce, po podaniu na wejściu wartości 5","odpowiedz":"120"},{"tresc":"Która z przedstawionych metod pozwoli wypisać w języku JavaScript komunikat w konsoli przeglądarki internetowej?","odpowiedz":"console.log(\"test\");"},{"tresc":"Którego znacznika NIE NALEŻY umieszczać w nagłówku dokumentu HTML?","odpowiedz":"<h2>"},{"tresc":"Konstruktor w języku PHP jest metodą o nazwie","odpowiedz":"_construct"},{"tresc":"Która z funkcji SQL NIE pobiera argumentów?","odpowiedz":"now"},{"tresc":"Projektując stronę internetową, umieszczono kod definiujący jej styl. Jaką szerokość pozostawiono na treść strony?","odpowiedz":"560 px"},{"tresc":"W języku skryptowym JavaScript operatory: ||, && należą do grupy operatorów","odpowiedz":"logicznych"},{"tresc":"Którą relację w projekcie bazy danych należy ustalić między tabelami widocznymi na rysunku zakładając, że każdy klient sklepu internetowego dokona przynajmniej dwóch zamówień?","odpowiedz":"1:n, gdzie 1 jest po stronie Klienta, a wiele po stronie Zamówienia"},{"tresc":"Polecenie w języku SQL GRANT ALL PRIVILEGES ON klienci TO pracownik","odpowiedz":"nadaje wszystkie uprawnienia do tabeli klienci użytkownikowi pracownik"},{"tresc":"Który znacznik należy do znaczników definiujących listy w języku HTML?","odpowiedz":"<ul>"},{"tresc":"Przedstawiona instrukcja JavaScript wyświetli","odpowiedz":"false"},{"tresc":"Jak posortowana będzie lista, utworzona ze wszystkich kolumn tabeli uczniowie i zawierająca uczniów ze średnią większą od 5, która zostanie zwrócona jako wynik przedstawionego zapytania?","odpowiedz":"Malejąco według parametru klasa"},{"tresc":"W języku JavaScript należy odwołać się do elementu zawartego w pierwszym paragrafie przedstawionego fragmentu strony HTML. Można to wykonać za pomocą funkcji","odpowiedz":"getElementByTagName(\"p\")[0];"},{"tresc":"Którego języka należy użyć, aby zapisać skrypt wykonywany po stronie klienta w przegladarce internetowej?","odpowiedz":"JavaScript"},{"tresc":"Częstotliwość próbkowania ma wpływ na","odpowiedz":"jakość cyfrowego dzwięku"},{"tresc":"W języku PHP float reprezentuje typ","odpowiedz":"zmiennoprzecinkowy"},{"tresc":"CMYK to zestaw czterech podstawowych kolorów farb drukarskich:","odpowiedz":"turkusowego, purpurowego, żółtego, czarnego"},{"tresc":"Baza danych zawiera dane multimedialne, co wiąże się z przechowywaniem dużych ilości danych binarnych. Do takich danych należy zastosować typ","odpowiedz":"BLOB"},{"tresc":"Znaczniki <header>, <article>, <section>, <footer> są charakterystyczne dla języka","odpowiedz":"HTML 5"},{"tresc":"Algorytm przedstawiony na rysunku można zapisać w języku JavaScript za pomocą instrukcji","odpowiedz":"var i = 0; while(i <= 10) i += 2;"},{"tresc":"Które z poniższych zdań dotyczących zasad programowania w języku PHP jest prawdziwe?","odpowiedz":"Jest to język o słabej kontroli typów"},{"tresc":"Aby przywrócić bazę danych MS SQL z kopii bezpieczeństwa, należy zastosować polecenie","odpowiedz":"RESTORE DATABASE"},{"tresc":"W MS SQL Server polecenie RESTORE DATABASE służy do","odpowiedz":"odtworzenia bazy danych z kopii bezpieczeństwa"},{"tresc":"W instrukcji warunkowej JavaScript należy sprawdzić przypadek, gdy zmienne a oraz b są dodatnie, z czego zmienna b jest mniejsza od 100. Warunek taki powinien być zapisany w następujący sposób:","odpowiedz":"if ( a > 0 && b > 0 && b < 100)"},{"tresc":"Chcąc zdefiniować marginesy wewnętrzne dla danych: margines górny 50px, dolny 40px, prawy 20px i lewy 30px należy użyć składni CSS","odpowiedz":"padding: 50px, 20px, 40px, 30px;"},{"tresc":"Właściwym zestawem kroków według kolejności, które należy wykonać w celu nawiązania współpracy między aplikacją internetową po stronie serwera a bazą SQL, jest","odpowiedz":"nawiązanie połączenia z serwerem baz danych, wybór bazy, zapytanie do bazy - wyświetlane na stronie WWW, zamknięcie połączenia"},{"tresc":"Proces filtracji sygnału wejściowego w dziedzinie czasu, obejmujący zasadę superpozycji, związany jest filtrem","odpowiedz":"liniowym"},{"tresc":"W języku HTML zdefiniowano hiperłącze ze znakiem #. Co stanie się po wybraniu przedstawionego odsyłacza?","odpowiedz":"Strona przewinie się do elementu o wartości id równej dane"},{"tresc":"Przedstawiono kod tabeli 3x2. Której z modyfikacji w jej drugim wierszu należy dokonać, aby tabela wyglądała jak na obrazku z niewidocznym wierszem?","odpowiedz":"<tr style=\"visibility: hidden\">"},{"tresc":"Wielkość grafiki JPEG umieszczonej na stronie internetowej może mieć wpływ na","odpowiedz":"długość czasu ładowania strony."},{"tresc":"Chcąc zdefiniować formatowanie tabeli w języku CSS w taki sposób, aby wiersz, który jest aktualnie wskazywany kursorem myszy, został wyróżniony np. innym kolorem, należy zastosować","odpowiedz":"pseudoklasę :hover"},{"tresc":"Aby w wyniku zapytania wyeliminować powtarzające się wiersze, należy użyć klauzuli","odpowiedz":"DISTINCT"},{"tresc":"Baza danych zawiera tabelę o nazwie pracownicy o polach: nazwisko, imie, pensja, wiek. Jak wygląda składnia polecenia wyznaczającego średnią pensję pracowników?","odpowiedz":"select AVG (pensja) from pracownicy"},{"tresc":"W formularzu, dane z pola input o typie number zostały zapisane do zmiennej a, a następnie przetworzone w skrypcie JavaScript w następujący sposób. Zmienna x będzie typu","odpowiedz":"liczbowego, całkowitego"},{"tresc":"W języku SQL polecenie ALTER TABLE ma za zadanie","odpowiedz":"modyfikować kolumny w tabeli"},{"tresc":"Znacznik języka HTML, który służy do oznaczenia fragmentu tekstu jako kodu komputerowego, to","odpowiedz":"<code> </code>"},{"tresc":"W języku JavaScript, funkcja matematyczna Math.pow() służy do wyznaczenia","odpowiedz":"potęgi liczby"},{"tresc":"Aby zaimportować plik z danymi SQL do bazy danych MySQL można użyć narzędzia","odpowiedz":"phpMyAdmin."},{"tresc":"Która z reguł walidacji strony internetowej jest błędna?","odpowiedz":"Jeżeli w instrukcji używa się kilku atrybutów, ich kolejność powinna być zgodna z alfabetem, np. <img alt=\"....\" src=\"....\" />"},{"tresc":"Najprostszy sposób zamiany obiektu oznaczonego cyfrą 1 na obiekt oznaczony cyfrą 2 polega na","odpowiedz":"geometrycznym transformowaniu obiektu"},{"tresc":"Aby obraz wstawiony kodem HTML mógł być interpretowany przez programy wspomagające osoby niewidzące, należy zdefiniować atrybut","odpowiedz":"alt"},{"tresc":"Który framework został opracowany dla skryptowego języka PHP?","odpowiedz":"Symfony."},{"tresc":"W języku CSS, w celu zdefiniowania wewnętrznego górnego marginesu, czyli odstepu między elementem a otaczającym go obramowaniem, należy użyć polecenia","odpowiedz":"padding-top"},{"tresc":"W instrukcji CREATE TABLE użycie klauzuli PRIMARY KEY przy deklaracji pola tabeli spowoduje, że pole to stanie się","odpowiedz":"kluczem podstawowym"},{"tresc":"W języku CSS wcięcie pierwszej linii akapitu na 30 pikseli uzyska się za pomocą zapisu","odpowiedz":"p { text-indent: 30px; }"},{"tresc":"W języku PHP, aby usunąć spacje z początku i końca ciągu znaków, można użyć funkcji","odpowiedz":"trim()"},{"tresc":"Logo systemu CMS o nazwie Joomla! to","odpowiedz":"B"},{"tresc":"Pierwszym krokiem podczas przetwarzania sygnału analogowego na cyfrowy jest","odpowiedz":"próbkowanie"},{"tresc":"W standardzie HDTV jest stosowana rozdzielczość","odpowiedz":"1920 x 1080 px"},{"tresc":"Wskaż funkcję JavaScript, za pomocą której można obliczyć połowę kwadratu liczby przekazanej jako argument.","odpowiedz":"function wynik(a) { return a*a/2; }"},{"tresc":"W znaczniku <head> (w części <meta ... >) strony www NIE umieszcza się informacji dotyczącej","odpowiedz":"typu dokumentu"},{"tresc":"Wskaż zapytanie, w którym dane zostały posortowane.","odpowiedz":"SELECT imie, nazwisko FROM mieszkancy WHERE wiek > 18 ORDER BY wiek;"},{"tresc":"Która instrukcja algorytmu odpowiada graficznej reprezentacji bloku przedstawionego na rysunku?","odpowiedz":"n > 20"},{"tresc":"W bazie danych sklepu spożywczego pod koniec dnia jest tworzony raport wyświetlający te produkty wraz z ich dostawcami, dla których stan magazynowy jest mniejszy niż 10 sztuk. Do zdefiniowania tego raportu posłużono się kwerendą","odpowiedz":"SELECT"}]